

{
  "passages": [
    {
      "text": "You and Bubba find yourselves in a bizarre, endless store, the shelves stretching out so far ahead that they disappear into the horizon. The store’s aisles curve in impossible ways, twisting around corners that can’t possibly exist. The air smells of old paper, spices, and something faintly metallic.\nBubba looks around, clearly intrigued, but also a little unnerved. 'I’ve seen some weird places, Em, but this… this takes the cake.'\nYou nod, scanning the shelves. There are strange trinkets and peculiar items everywhere: old lanterns that seem to flicker with no flame, jars filled with shimmering dust, and books with spines that seem to change when you’re not looking.\n'Let’s set up camp,' you say, deciding it might be best to rest for a bit and figure out what’s going on. You pull out your tent, and Bubba starts gathering firewood, though there’s no telling where it’s coming from.\n[[camping, 10, The store seems quiet, but you get the feeling it’s watching you ->Set up the tent]]\n[[observation, 8, You notice that the store shifts whenever you turn away ->Shelves]]\n[[intuition, 7, Something feels off about the endless aisles ->Check the store’s entrance again]]",
      "links": [
        {
          "name": "camping, 10, The store seems quiet, but you get the feeling it’s watching you ",
          "link": "Set up the tent",
          "pid": "2"
        },
        {
          "name": "observation, 8, You notice that the store shifts whenever you turn away ",
          "link": "Shelves",
          "pid": "3"
        },
        {
          "name": "intuition, 7, Something feels off about the endless aisles ",
          "link": "Check the store’s entrance again",
          "pid": "4"
        }
      ],
      "name": "Intro",
      "pid": "1",
      "position": {
        "x": "900",
        "y": "0"
      }
    },
    {
      "text": "You unfurl the tent, placing it on the soft, strange floor that seems to hum beneath you. Bubba grins as he gathers some firewood that appears to come out of nowhere. The store’s eerie silence makes you feel like you’re being watched, though there’s no one around.\n'This is definitely a place that’s not supposed to exist,' Bubba mutters, glancing nervously at the aisles.\n[[Ignore the feeling of being watched and just enjoy camping with Bubba]]\n[[history, 12, You’ve heard of stores like this, but only in ancient legends ->Try to recall the stories]]\n[[diplomacy, 5, Maybe there’s someone around to talk to ->Call out to see if anyone’s nearby]]",
      "links": [
        {
          "name": "Ignore the feeling of being watched and just enjoy camping with Bubba",
          "link": "Ignore the feeling of being watched and just enjoy camping with Bubba",
          "pid": "36"
        },
        {
          "name": "history, 12, You’ve heard of stores like this, but only in ancient legends ",
          "link": "Try to recall the stories",
          "pid": "5"
        },
        {
          "name": "diplomacy, 5, Maybe there’s someone around to talk to ",
          "link": "Call out to see if anyone’s nearby",
          "pid": "6"
        }
      ],
      "name": "Set up the tent",
      "pid": "2",
      "position": {
        "x": "475",
        "y": "350"
      }
    },
    {
      "text": "You glance over your shoulder, and sure enough, the shelves seem to have shifted slightly since you last looked. The aisles curve in a different direction now, as though the space itself is rearranging. Bubba narrows his eyes. 'What’s going on here?' he mutters, but you don’t have an answer.\nThe shelves stretch on endlessly in every direction, and you can’t see a clear path to the exit anymore.\n[[observation, 15, You notice strange symbols etched into the shelves ->Investigate the symbols]]\n[[exploration, 10, You decide to follow one aisle further ->Walk toward the glowing light at the end of the aisle]]\n[[intuition, 8, The air feels colder down this path ->Turn back toward the tent]]",
      "links": [
        {
          "name": "observation, 15, You notice strange symbols etched into the shelves ",
          "link": "Investigate the symbols",
          "pid": "7"
        },
        {
          "name": "exploration, 10, You decide to follow one aisle further ",
          "link": "Walk toward the glowing light at the end of the aisle",
          "pid": "8"
        },
        {
          "name": "intuition, 8, The air feels colder down this path ",
          "link": "Turn back toward the tent",
          "pid": "9"
        }
      ],
      "name": "Shelves",
      "pid": "3",
      "position": {
        "x": "800",
        "y": "450"
      }
    },
    {
      "text": "You walk back to where you entered, but you find that the entrance is gone—there’s no door, no window, no trace of where you came from. The aisles continue endlessly in all directions, and the walls now seem to be made of a shifting, liquid-like material that reflects odd colors. The air is thick and oppressive, and the atmosphere feels increasingly unnatural.\n\n\"Uh, Em, I’m getting a bad feeling about this,\" Bubba says, stepping closer to you, his voice tight with unease. \"We’ve gotta get out of here.\"\n\nYou turn to look around, but everything looks the same—strange and alien, and now even more distorted. The walls pulse as if alive. Every movement you make echoes unnervingly through the space.\n\n[[astronomy, 62, You attempt to understand the celestial patterns reflected in the walls ->Attempt to map the environment]]\n[[geology, 68, You analyze the shifting material of the walls ->See if you can find a way to stabilize the surroundings]]\n[[cybernetics, 73, You try to interface with the walls using your cybernetic implants ->Attempt to hack into the liquid material]]\n[[dowsing, 64, You try to detect any hidden pathways or exits ->Search for a hidden exit]]",
      "links": [
        {
          "name": "astronomy, 62, You attempt to understand the celestial patterns reflected in the walls ",
          "link": "Attempt to map the environment",
          "pid": "21"
        },
        {
          "name": "geology, 68, You analyze the shifting material of the walls ",
          "link": "See if you can find a way to stabilize the surroundings",
          "pid": "22"
        },
        {
          "name": "cybernetics, 73, You try to interface with the walls using your cybernetic implants ",
          "link": "Attempt to hack into the liquid material",
          "pid": "23"
        },
        {
          "name": "dowsing, 64, You try to detect any hidden pathways or exits ",
          "link": "Search for a hidden exit",
          "pid": "24"
        }
      ],
      "name": "Check the store’s entrance again",
      "pid": "4",
      "position": {
        "x": "1450",
        "y": "125"
      }
    },
    {
      "text": "You sit down on a nearby crate, the hum of the floor beneath you as steady and unsettling as ever. You close your eyes, trying to recall what you know about places like this—ancient stores that aren’t supposed to exist, appearing in forgotten corners of the world, sometimes in dreams, sometimes in legends.\n\nYour mind wanders back to old stories you’ve heard over the years—tales of wandering merchants who spoke of selling goods in places that shifted between dimensions. Of stores that existed in both the past and the future, in places that had no real physical location but rather were built upon an ever-changing landscape of time itself. You remember one story in particular: a store built atop the ruins of an ancient temple, its shelves filled with items that seemed to rewrite reality with every touch. In this store, things you bought would change with you; they would grow or decay depending on your own state of mind. But the most chilling part of the story was always the same—no one ever left the store in the same way they entered.\n\nThe weight of the legend feels like a veil settling over your thoughts. The more you think, the more it becomes clear that this place is part of a much older network—a system of stores scattered across forgotten dimensions, some of which might have been abandoned, and others that still pulse with energy.\n\nAs you gather your thoughts, Bubba looks at you quizzically. “You okay, Em?”\n\nYou nod, but you don’t feel entirely sure. This place feels too familiar now. The ancient stories weren't just stories after all. They were warnings.\n\nSuddenly, the store’s walls shift and warp around you, as if responding to your thoughts. It’s unsettling, but you can’t help but feel that you're on the brink of understanding something vast and incomprehensible.\n\nPerhaps there’s a way to find an exit. Or perhaps there’s something else you're meant to uncover here.\n\n[[Explore deeper to see if the walls reveal more clues.->Shelves]] \n[[Look for a door—anything that might lead to an exit.->Try to find another exit]]",
      "links": [
        {
          "name": "Explore deeper to see if the walls reveal more clues.",
          "link": "Shelves",
          "pid": "3"
        },
        {
          "name": "Look for a door—anything that might lead to an exit.",
          "link": "Try to find another exit",
          "pid": "16"
        }
      ],
      "name": "Try to recall the stories",
      "pid": "5",
      "position": {
        "x": "250",
        "y": "700"
      }
    },
    {
      "text": "You glance around the shelves, the eerie silence hanging in the air. There’s no sign of life—no people, no creatures, no movement except for the shifting aisles. The idea of being completely alone in this strange, unchanging place makes your skin crawl.\n\nBubba watches you, his brow furrowed with concern. “You think someone’s here? Or are we just stuck with the walls for company?”\n\n“Well, there might be someone,” you reply, thinking that maybe there’s some hidden figure, some entity that knows the way out—or at least has answers about this place. If anything, you need some sort of contact to ground yourself.\n\nYou clear your throat and call out, “Hello? Is anyone here?”\n\nYour voice echoes, the sound unnervingly loud in the silent space. For a moment, nothing happens. Then, faintly, you hear something—a low, almost imperceptible murmur that seems to come from deep within the aisles.\n\nBubba’s eyes widen. “You heard that too, right?”\n\nYou nod. The murmur turns into a soft, rhythmic sound, like a chant or a melody, distant and muffled but unmistakable. It seems to be coming from deeper within the store. Something—or someone—is responding.\n\nWith a cautious glance at Bubba, you decide to investigate the source of the sound. You follow the trail, your heart pounding in your chest as you step deeper into the store’s endless aisles. As you move, the walls seem to ripple with the sound, like they’re alive, echoing back your every step.\n\nThe chanting grows louder, and soon, you find yourself at the edge of a strange, glowing circle etched into the floor, surrounded by ancient symbols. In the center of the circle stands a figure—a cloaked individual, too indistinct to make out fully, who seems to be the source of the strange hum that has filled the air.\n\nThe figure doesn’t speak but raises one hand, gesturing for you to come closer. Something about the figure feels strangely familiar, as though you’ve encountered them before—or maybe you will in some future time.\n\nYour curiosity piqued, you step forward, prepared for whatever answers they may hold.\n\n[[id: chantingcircle->Step into the circle and see what happens next.]]",
      "links": [
        {
          "name": "id: chantingcircle",
          "link": "Step into the circle and see what happens next.",
          "pid": "37"
        }
      ],
      "name": "Call out to see if anyone’s nearby",
      "pid": "6",
      "position": {
        "x": "375",
        "y": "675"
      }
    },
    {
      "text": "You approach one of the shelves, your curiosity piqued by the strange symbols etched into the wood. They pulse faintly with light, like they’re alive. As you run your fingers over the symbols, the air around you vibrates.\n'What are these?' you wonder aloud, but Bubba shrugs, clearly unsettled.\n[[arcanism, 18, You feel a slight magical presence in the symbols ->Try to decipher their meaning]]\n[[cryptography, 12, The symbols seem like a code ->Use your knowledge of languages to crack it]]\n[[history, 10, These symbols remind you of ancient wards ->Trace them to see if they’re protective]]",
      "links": [
        {
          "name": "arcanism, 18, You feel a slight magical presence in the symbols ",
          "link": "Try to decipher their meaning",
          "pid": "10"
        },
        {
          "name": "cryptography, 12, The symbols seem like a code ",
          "link": "Use your knowledge of languages to crack it",
          "pid": "11"
        },
        {
          "name": "history, 10, These symbols remind you of ancient wards ",
          "link": "Trace them to see if they’re protective",
          "pid": "12"
        }
      ],
      "name": "Investigate the symbols",
      "pid": "7",
      "position": {
        "x": "675",
        "y": "700"
      }
    },
    {
      "text": "The end of the aisle glows faintly, a soft, inviting light beckoning you forward. Bubba looks hesitant but follows you anyway. As you walk closer, you realize the light seems to warp around you, bending and twisting in impossible ways.\n[[exploration, 13, The light feels strange and comforting ->Step into the light]]\n[[intuition, 10, Something about this light feels dangerous ->Turn back toward the tent]]\n[[diplomacy, 6, Maybe the light has an answer for you ->Call out to the light]]",
      "links": [
        {
          "name": "exploration, 13, The light feels strange and comforting ",
          "link": "Step into the light",
          "pid": "13"
        },
        {
          "name": "intuition, 10, Something about this light feels dangerous ",
          "link": "Turn back toward the tent",
          "pid": "9"
        },
        {
          "name": "diplomacy, 6, Maybe the light has an answer for you ",
          "link": "Call out to the light",
          "pid": "14"
        }
      ],
      "name": "Walk toward the glowing light at the end of the aisle",
      "pid": "8",
      "position": {
        "x": "975",
        "y": "675"
      }
    },
    {
      "text": "You trust your instincts and decide to leave the glowing light behind. You turn around and walk back toward the tent, but as you do, the aisles around you begin to twist. The shelves shift, making it harder to find your way back.\nThe eerie silence returns, and you start to feel as though the store is mocking you, shifting just out of reach every time you think you’re near the tent.\n'Maybe this was a mistake,' Bubba mutters, having somehow reappeared behind you. 'We’re trapped, Em.'\nThe aisles stretch into infinity, and you realize that the way out might not exist at all.\n[[intuition, 10, The walls seem to pulse with a strange energy ->Try to communicate with the walls]]\n[[exploration, 8, The shelves are still shifting ->Try to find another exit]]",
      "links": [
        {
          "name": "intuition, 10, The walls seem to pulse with a strange energy ",
          "link": "Try to communicate with the walls",
          "pid": "15"
        },
        {
          "name": "exploration, 8, The shelves are still shifting ",
          "link": "Try to find another exit",
          "pid": "16"
        }
      ],
      "name": "Turn back toward the tent",
      "pid": "9",
      "position": {
        "x": "1250",
        "y": "550"
      }
    },
    {
      "text": "You study the liquid-like walls closely, noticing that they shift when you touch them, revealing brief glimpses of strange landscapes—forests, deserts, cities, and seas. The images flicker quickly, never staying long enough for you to fully understand them.\nBubba taps you on the shoulder. 'We need to figure this out, Em. Maybe these walls are showing us where we are.'\n\nIt takes a few moments of intense concentration, but you finally start to make out the flow of the magic. These symbols are part of an ancient spell, a ward of protection, but it’s corrupted. Instead of shielding, it seems to be trying to draw power from the environment around it.\n\nWith your newfound understanding, you carefully begin the process of unweaving the magic. The symbols lose their glow, the vibration in the air ceases, and the shelf’s strange aura fades.\n\n“Done,” you say, wiping a bead of sweat from your brow. “It was feeding on ambient magic.”\nBubba looks relieved, but you can’t shake the feeling that something darker still lurks in the corners of this place.\n[[Check the shelf]]\n[[Keep investigating the symbols ->Investigate the symbols]] ",
      "links": [
        {
          "name": "Check the shelf",
          "link": "Check the shelf",
          "pid": "18"
        },
        {
          "name": "Keep investigating the symbols ",
          "link": "Investigate the symbols",
          "pid": "7"
        }
      ],
      "name": "Try to decipher their meaning",
      "pid": "10",
      "position": {
        "x": "500",
        "y": "750"
      }
    },
    {
      "text": "You take a step back and examine the symbols more critically. These aren’t just magical runes—they appear to be part of a complex code. Your mind begins to churn through the possibilities, trying to decipher their meaning. You recognize some of the shapes as old language patterns, likely of a lost civilization.\n\nAfter a few moments, you manage to piece the symbols together. It seems to be a cryptic message:\n\"Only the blood of the forgotten will open the gate.\"\n\nAs the realization hits, the symbols on the shelf glow brighter for a moment. Suddenly, you hear a creaking sound from the back of the room, followed by the distinct shifting of stone. The shelf slides forward, revealing a hidden compartment in the wall. Inside lies a small chest.\n\nBubba steps forward, cautiously. \"Is this... what it meant?\" he asks, his voice tinged with awe.\n[[Open che chest]]\n[[Keep investigating the symbols ->Investigate the symbols]] ",
      "links": [
        {
          "name": "Open che chest",
          "link": "Open che chest",
          "pid": "19"
        },
        {
          "name": "Keep investigating the symbols ",
          "link": "Investigate the symbols",
          "pid": "7"
        }
      ],
      "name": "Use your knowledge of languages to crack it",
      "pid": "11",
      "position": {
        "x": "650",
        "y": "850"
      }
    },
    {
      "text": "You place your fingers along the lines of the symbols, recalling the old texts you’ve read. The patterns seem familiar; these are wards, but they aren’t the usual protective runes you would expect. Instead, these seem like warnings, perhaps to ward off an intrusion or prevent something from escaping.\n\nAs you trace the symbols, a ripple of cold air sweeps through the room. The markings seem to be reacting to your touch, like they’re aware of your presence. With a shiver down your spine, you pull your hand away, but not before you notice something strange: the symbols have changed. They've begun to glow a dark crimson hue, pulsating with an ominous rhythm.\n\n\"What did you do?\" Bubba asks, backing away. \"I think we’ve just triggered something.”\n\nSuddenly, the ground trembles. A low rumble echoes from deeper within the facility. You feel an overwhelming sensation of danger—a dark force has been awakened.\n\n[[id: darkforce->Face the dark force]] ",
      "links": [
        {
          "name": "id: darkforce",
          "link": "Face the dark force",
          "pid": "30"
        }
      ],
      "name": "Trace them to see if they’re protective",
      "pid": "12",
      "position": {
        "x": "825",
        "y": "850"
      }
    },
    {
      "text": "You take a deep breath and step into the glowing light. The world around you warps, and you feel a strange, weightless sensation. You try to take a step forward, but the light engulfs you entirely. For a moment, everything goes dark.\nWhen you open your eyes, you find yourself standing in a completely different place—still inside the store, but it looks different. The shelves are more chaotic, and the aisles twist at strange angles. Bubba is gone.\n'What happened?' you whisper to yourself.\nSuddenly, the light flickers, revealing a hidden door in the distance. You can’t help but feel that it’s your way out.\n[[Open the door]]",
      "links": [
        {
          "name": "Open the door",
          "link": "Open the door",
          "pid": "20"
        }
      ],
      "name": "Step into the light",
      "pid": "13",
      "position": {
        "x": "950",
        "y": "825"
      }
    },
    {
      "text": "You call out to the light, your voice echoing through the aisles. The light pulses brighter for a moment, and you think you hear a faint voice answer, but it’s impossible to make out the words.\nSuddenly, the light shifts, forming a figure—an ancient being that seems to be made of pure light. It steps forward, speaking in a language you don’t understand, but you feel the words in your chest as though they’re being spoken directly to your heart.\n[[Step into the light]] \n[[Turn back toward the tent]] ",
      "links": [
        {
          "name": "Step into the light",
          "link": "Step into the light",
          "pid": "13"
        },
        {
          "name": "Turn back toward the tent",
          "link": "Turn back toward the tent",
          "pid": "9"
        }
      ],
      "name": "Call out to the light",
      "pid": "14",
      "position": {
        "x": "1150",
        "y": "775"
      }
    },
    {
      "text": "You place your hand against the pulsating walls, feeling the energy vibrate through your fingertips. The walls respond to your touch, shifting slightly and revealing a series of glowing symbols. The strange energy surges, and a voice, soft and distant, seems to speak directly into your mind.\n\"You seek answers, but they are not for you.\"\nThe walls start to hum louder, and you feel yourself being drawn into them, as if the space is swallowing you whole. For a moment, the world around you fades to black.\nWhen your vision returns, you’re standing in the center of the store once more, but everything has changed. The aisles are now completely still. Bubba stands by the tent, looking worried, but no longer seems to recognize you.\nThe walls have reset everything. It’s as if you’ve been trapped in an endless loop.\n[[Loop back ->Intro]] ",
      "links": [
        {
          "name": "Loop back ",
          "link": "Intro",
          "pid": "1"
        }
      ],
      "name": "Try to communicate with the walls",
      "pid": "15",
      "position": {
        "x": "1100",
        "y": "325"
      }
    },
    {
      "text": "You push forward through the shifting aisles, determined to find a way out. The shelves twist around you, rearranging themselves faster than you can keep up with. Every time you think you’ve found a path, it disappears behind you, replaced by more impossibly endless shelves.\nAfter what feels like hours, you come to a sudden stop. A doorway appears before you—seemingly out of nowhere, bathed in a faint light. You walk toward it cautiously, heart pounding, hoping this is the exit you’ve been searching for.\nAs you step through the door, the world shifts. You’re no longer in the store, but standing in an open field under a strange sky. Bubba is beside you, looking equally confused.\n'Well, I guess that worked,' he says, still looking around.\nBut something feels off. You have no idea where you are, and the air feels too still. It might be an escape… but it’s still a mystery.\n[[Continue]]",
      "links": [
        {
          "name": "Continue",
          "link": "Continue",
          "pid": "17"
        }
      ],
      "name": "Try to find another exit",
      "pid": "16",
      "position": {
        "x": "1425",
        "y": "675"
      }
    },
    {
      "text": "",
      "name": "Continue",
      "pid": "17",
      "position": {
        "x": "1437.5",
        "y": "800"
      }
    },
    {
      "text": "You find small crystal that now pulses with the power you’ve absorbed from the symbols.\n{reward: soulgem}\n",
      "name": "Check the shelf",
      "pid": "18",
      "position": {
        "x": "375",
        "y": "900"
      }
    },
    {
      "text": "You find a small chest containing an ancient map and a key that seems to correspond to an old lock you’ve seen before.\n{reward: ancientMap}\n[reward: forgottenKey}",
      "name": "Open che chest",
      "pid": "19",
      "position": {
        "x": "475",
        "y": "1050"
      }
    },
    {
      "text": "",
      "name": "Open the door",
      "pid": "20",
      "position": {
        "x": "1075",
        "y": "950"
      }
    },
    {
      "text": "You focus on the flickering patterns in the walls, trying to recognize any celestial bodies or cosmic alignment. The strange, liquid material seems to shimmer in ways that mirror the night sky—constellations twisting unnaturally, stars bleeding into each other.\n\nYou realize that the patterns aren’t random; they seem to be forming a map—a map of an entirely different reality, one where time and space bend in unpredictable ways.\n\nBut as you try to trace the stars, they shift and twist, mocking your efforts. The sense of disorientation is overwhelming, and for a moment, you lose your sense of direction entirely. The map you’ve begun to chart flickers out of existence, leaving you feeling helpless.\n\nBubba grabs your arm, pulling you away from the shifting walls. \"This is bad, Em. We need a new plan.\"\n",
      "name": "Attempt to map the environment",
      "pid": "21",
      "position": {
        "x": "1250",
        "y": "300"
      }
    },
    {
      "text": "You kneel down to inspect the walls more closely. The liquid material shifts beneath your fingertips, a strange substance that seems part organic, part mineral. It feels slick, almost like molten glass, yet it doesn’t burn you. It reflects odd colors—pinks, blues, and purples—in ways that seem impossible for regular materials.\n\nYou realize this isn’t just a wall—this is a manifestation of unstable, shifting geological forces. A form of rock, liquefied and manipulated by powerful forces beyond your understanding. If you can stabilize it, the walls might stop shifting, and perhaps you can re-establish some semblance of order.\n\nDrawing on your geological knowledge, you attempt to apply pressure at key points, trying to lock the material into a more stable form. As you press your palms against the liquid wall, you feel a strange resistance. For a moment, it seems like the material might respond to you—then it pushes back violently, causing the walls to ripple.",
      "name": "See if you can find a way to stabilize the surroundings",
      "pid": "22",
      "position": {
        "x": "1400",
        "y": "325"
      }
    },
    {
      "text": "You activate the cybernetic implant in your arm, linking it to your internal network. The walls seem to pulse in rhythm with your movements as you try to interface with them. You focus your neural patterns, pushing the data streams from your implants into the liquid substance that surrounds you.\n\nA sharp buzz in your skull signals a connection, but it’s not what you expected. The wall responds, not with access to any hidden systems, but with an invasive, overwhelming surge of information—images, sounds, voices—all jumbled and distorted. It’s as if you’ve accessed the thoughts of the walls themselves.\n\nThe flood of data overwhelms you. Your vision blurs as flashes of impossible images streak past your consciousness—holographic visions of faraway places, strange symbols, cryptic messages. A low hum fills the air, vibrating through your entire body. Just as you're about to disconnect, the ground beneath your feet shifts violently.\n\nYour vision snaps back into focus, but it’s not the room you were just in. You find yourself in an entirely different environment—a small, sterile room with rows upon rows of humming servers and data terminals. The walls here are clean, smooth, and white, and you can hear the faint sound of machinery working in the background.\n\nBubba isn’t with you. In fact, you’re alone. The environment is stark, with no windows, no doors—just rows of equipment. Your head is spinning from the unexpected transition, and the last thing you remember was the pulsating liquid walls of the strange, shifting aisles.\n\n[[Inspect the equipment]]",
      "links": [
        {
          "name": "Inspect the equipment",
          "link": "Inspect the equipment",
          "pid": "26"
        }
      ],
      "name": "Attempt to hack into the liquid material",
      "pid": "23",
      "position": {
        "x": "1525",
        "y": "325"
      }
    },
    {
      "text": "You pull out your dowsing rods and begin to scan the area, hoping to detect any hidden paths or exits. As you walk carefully through the shifting aisles, the rods vibrate in your hands, indicating something faintly ahead.\n\nYou follow the sensation, the rods guiding you as you approach what seems like an alcove in the walls—an opening that wasn’t there moments ago. The walls, still shifting, reveal a narrow gap, just wide enough for you to slip through.\n\nBubba gives you a skeptical look. \"You sure about this?\" he asks.\n\nThe rods pulse one last time, confirming the path is real. You nod. \"This is it. Let’s go.\"\n[[Enter the gap]]",
      "links": [
        {
          "name": "Enter the gap",
          "link": "Enter the gap",
          "pid": "25"
        }
      ],
      "name": "Search for a hidden exit",
      "pid": "24",
      "position": {
        "x": "1750",
        "y": "275"
      }
    },
    {
      "text": "You take a deep breath, your dowsing rods pulsing in your hands as you approach the gap. The walls tremble slightly, and the flickering lights grow erratic, casting strange shadows across the narrow passage. With no time to waste and no other options left, you gesture to Bubba.\n\n“Let’s go,” you say, stepping into the gap.\n\nAs you squeeze through, the air around you feels different—heavier, colder. You hear strange whispers, like distant voices calling your name from all directions. Bubba follows you, but his steps falter. “I don’t like this, Em,” he mutters, but it’s too late to turn back now.\n\nThe gap leads you deeper into the labyrinthine structure, and as you go, the walls seem to close in around you. Your footsteps echo unnervingly, and the faint hum of the machinery becomes a distant thrum beneath your feet. You’re getting closer to something, but you’re not sure what.\n\nSuddenly, the passageway opens up into a large chamber. At first, it appears empty, but then you notice something that makes your blood run cold.\n\nIn the center of the room stands a massive figure—hulking, twisted, and strangely mechanical. It seems to be a grotesque fusion of flesh and metal, a distorted amalgamation of the facility’s many secrets. The figure’s eyes are dark, cold voids that seem to devour the light, and its limbs twitch erratically, as though testing the space around it. The figure’s presence is overpowering, and the air feels thick with a palpable sense of dread.\n\nBefore you can react, a voice booms through the chamber, deep and guttural, vibrating through your bones.\n\n“INTERLOPERS.”\n\nThe ground beneath you shakes as the figure steps forward, its heavy footfalls echoing. Bubba stumbles back, his eyes wide with terror. “Em… What the hell is that thing?”\n\nThe figure lunges forward, its metallic limbs scraping the floor with an unnatural screech. It's faster than it should be for its size. A cold wave of energy washes over you, and you instinctively reach for your weapon.\n\n“YOU HAVE COME TOO FAR. NOW YOU WILL PAY.”\n\nThe room flickers and distorts as the figure moves to strike, its massive, claw-like hand swinging through the air with deadly precision. You barely manage to dodge, the sharp edges of its appendages narrowly missing you.\n\n[[id: clawfight->Prepare to fight]]",
      "links": [
        {
          "name": "id: clawfight",
          "link": "Prepare to fight",
          "pid": "35"
        }
      ],
      "name": "Enter the gap",
      "pid": "25",
      "position": {
        "x": "1925",
        "y": "350"
      }
    },
    {
      "text": "A terminal in the corner of the room flickers to life, displaying a message that seems to be addressing you:\n\n\"ACCESS GRANTED.\nWELCOME TO THE DATA CORE.\"\n\nSuddenly, a low mechanical voice fills the room, and the terminal begins to relay unsettling data:\n\n\"Subjugation complete. External subject: Em, located. Commence observation and monitoring.\"\n\nA feeling of dread sweeps over you. This wasn’t a random shift in location. You’ve been moved to a secure, isolated data facility, and it seems like you’ve been identified as an “external subject.”\n\nWhat is this place? Who or what is monitoring you? And more importantly, what is your role in all of this?\n\nYou hear the soft clicking of machinery around you, like gears winding into motion. A countdown begins on the terminal’s screen: \"5… 4… 3…\"\n\n[[Try pressing buttons at random]]\n[[Let the coundown finish]]",
      "links": [
        {
          "name": "Try pressing buttons at random",
          "link": "Try pressing buttons at random",
          "pid": "27"
        },
        {
          "name": "Let the coundown finish",
          "link": "Let the coundown finish",
          "pid": "28"
        }
      ],
      "name": "Inspect the equipment",
      "pid": "26",
      "position": {
        "x": "1525",
        "y": "450"
      }
    },
    {
      "text": "You stare at the metallic panel next to the terminal, your hand hovering over a large, unmarked button. You’ve been trapped here for what feels like too long, and the pressure of the strange atmosphere is starting to get to you. The countdown, the messages, the cold, sterile space—it all feels like a trap.\n\nWith no other options and a growing sense of urgency, you press the button at random.\n\nA sudden, deafening mechanical whirring fills the room, and the lights flicker above you. For a moment, everything goes black, and your heart races, but then a sharp, artificial voice fills the room again, echoing in every corner:\n\n\"ERROR. RANDOM INPUT DETECTED.\"\n\nThe walls around you tremble, and the floor beneath your feet seems to shift, causing you to stumble. Your mind races, but there’s no time to second-guess your decision now. The whirring intensifies, and a series of high-pitched tones begin to play—like a computer trying to process something it doesn’t understand.\n\nSuddenly, a large compartment in the floor opens with a hydraulic hiss, revealing a long, dark shaft leading down into an unknown abyss. The edges of the shaft are lined with bright, flickering lights, and there’s a faint sound coming from deep within—a low, almost rhythmic thumping, like something large moving down there.\n\nBefore you can fully comprehend what’s happening, a mechanical arm extends from the ceiling and grabs you by the arm with unnatural strength, pulling you toward the shaft’s edge.\n\n\"WARNING. UNAUTHORIZED ACCESS DETECTED. SYSTEM ERROR.\"\n\nBubba’s voice cuts through the panic, and you turn to see him stumbling out of nowhere, as if he just materialized back into existence. “Em! What did you do?” he yells, trying to reach you.\n\nThe mechanical arm is tightening its grip, and the lights flicker again. It’s like the entire room is alive now, responding to your mistake.\n\n\"SUBJECT IN DANGER. AUTOMATED PROTOCOL ACTIVATED.\"\n\nYou have a split second to act before the arm drags you into the abyss below.\n\n[[Try to free yourself from the mechanical arm ->Wrestling]]\n[[Push Bubba away to keep him safe ->Stealth]]\n[[Press another button in a desperate attempt to stop the system ->Cybernetics]]",
      "links": [
        {
          "name": "Try to free yourself from the mechanical arm ",
          "link": "Wrestling",
          "pid": "31"
        },
        {
          "name": "Push Bubba away to keep him safe ",
          "link": "Stealth",
          "pid": "32"
        },
        {
          "name": "Press another button in a desperate attempt to stop the system ",
          "link": "Cybernetics",
          "pid": "33"
        }
      ],
      "name": "Try pressing buttons at random",
      "pid": "27",
      "position": {
        "x": "1825",
        "y": "525"
      }
    },
    {
      "text": "The countdown reaches zero, and the terminal’s screen goes black. For a few seconds, all is silent. Then, you hear the hum of nearby machines intensify, as if they are waking up. You stand frozen in place, not sure if you’re meant to run, hide, or prepare for what’s to come.\n\nThe walls flicker momentarily, displaying strange symbols and diagrams—none of them making any sense to you. It’s as if this whole place is meant to observe or store information about you. The atmosphere shifts once more, colder now, almost sterile in its precision.\n\nYou move to the terminal to try to interact, but before you can, another message appears:\n\n“EXTERNAL SUBJECT. YOU HAVE BEEN SELECTED. INITIATING TESTING SEQUENCE.”\n[[id: -> Testing ending]]",
      "links": [
        {
          "name": "id: ",
          "link": " Testing ending",
          "pid": "29"
        }
      ],
      "name": "Let the coundown finish",
      "pid": "28",
      "position": {
        "x": "1650",
        "y": "700"
      }
    },
    {
      "text": "",
      "name": " Testing ending",
      "pid": "29",
      "position": {
        "x": "1650",
        "y": "825"
      }
    },
    {
      "text": "",
      "name": "Face the dark force",
      "pid": "30",
      "position": {
        "x": "825",
        "y": "975"
      }
    },
    {
      "text": "You summon every ounce of strength you have and pull at the mechanical arm with all your might. It’s cold, rigid, and unnaturally strong, but you manage to twist your arm free just in time. You fall backward onto the floor as the arm retracts, and the compartment below you shuts with a loud slam.\n\nBubba rushes to your side, breathless. “That was way too close, Em.”\n[[Wait]]",
      "links": [
        {
          "name": "Wait",
          "link": "Wait",
          "pid": "34"
        }
      ],
      "name": "Wrestling",
      "pid": "31",
      "position": {
        "x": "1800",
        "y": "675"
      }
    },
    {
      "text": "In the heat of the moment, you quickly duck and roll away from the mechanical arm’s reach, managing to escape its grip just before it pulls you into the abyss. Bubba yells in alarm, but you’re already on your feet, hidden beneath the shadow of a nearby terminal.\n\nThe arm retracts, and the system seems to reset, the hum of machinery dulling slightly. You’re safe—for now.\n\n“What the hell was that?” Bubba mutters, eyes wide with disbelief.\n\n“I think we’ve made it angry,” you reply, still feeling the aftershocks of the close call.\n[[Wait]]",
      "links": [
        {
          "name": "Wait",
          "link": "Wait",
          "pid": "34"
        }
      ],
      "name": "Stealth",
      "pid": "32",
      "position": {
        "x": "1925",
        "y": "675"
      }
    },
    {
      "text": "You don’t hesitate for a second. You activate your cybernetic implant and attempt to send a counter-signal to the system controlling the mechanical arm. The room buzzes with energy as you desperately try to override its protocols.\n\nThe arm stutters, its movement slowing as the system attempts to recalibrate, but your implants manage to inject a scrambling signal. For a moment, it seems like the arm is going to stop. It’s struggling, its movements jerky as if it’s malfunctioning.\n\nAnd then—success. The arm lets go, retracting sharply into the ceiling.\n\n\"ACCESS TERMINATED. SYSTEM RESET.\"\n\nThe lights flicker one last time before returning to normal. You and Bubba are left standing in the now-still room, your heart still pounding from the ordeal.\n\nBubba looks at you with wide eyes. “That was close. Too close.”\n[[Wait]]",
      "links": [
        {
          "name": "Wait",
          "link": "Wait",
          "pid": "34"
        }
      ],
      "name": "Cybernetics",
      "pid": "33",
      "position": {
        "x": "2050",
        "y": "675"
      }
    },
    {
      "text": "The room, now quiet and unnervingly still, feels suffocating. The sterile white walls glisten under the harsh artificial light, and the strange hum of machinery is the only sound that fills the air. It’s as if the entire facility has paused in response to your recent interference, waiting for your next move.\n\nBubba’s footsteps echo as he paces nervously. “We need to get out of here, Em. Whatever this place is, it’s not something we should stick around to figure out.”\n\nYou agree, but you’re not sure where to go. Every direction seems to lead into the same oppressive void of machinery. The doors are sealed, the walls unyielding. But just as you start to lose hope, something changes.\n\nThe floor beneath you shudders once more, not violently like before, but with a soft, mechanical precision. Then, the wall to your left slides open with a quiet hiss, revealing a narrow passageway bathed in dim light. It’s an exit, or at least, it seems to be.\n\nWithout a word, you and Bubba move toward it, the air growing colder as you approach. The passageway stretches ahead, its walls lined with more of those strange symbols you encountered earlier—this time, they appear less cryptic, almost familiar. As you step forward, you notice that the walls seem to pulse with a faint, rhythmic energy, like a heartbeat.\n\nThe passage narrows further as you proceed, the silence in the space broken only by the sound of your footsteps and Bubba’s heavy breathing. Time feels warped here, and every moment seems to stretch longer than it should.\n\nFinally, after what feels like an eternity, you reach a large, sealed door at the end of the passage. A keypad is mounted beside it, its screen glowing a soft green. You approach it cautiously, your hand hovering over the interface. You don’t have much time, but the message displayed on the screen seems to imply it’s meant for you:\n\n“ACCESS GRANTED.\nSUBJECT: EM. EXIT READY.”\n\nA sharp metallic click fills the air as the door unlocks, and it slides open smoothly, revealing an entirely different world on the other side.\n\nThe air is thick with the scent of fresh grass and salt from the sea. You’re standing on the edge of a cliff, overlooking an expansive landscape—an unfamiliar coast. Below, a city sprawls across the horizon, ancient in design, yet alive with movement. It feels strange, out of place, but you’re certain it’s the exit you were searching for.\n\nBubba stares in disbelief, his voice barely a whisper. \"What… what is this place?\"\n\nYou step forward, the wind picking up as it whips around you. The world beyond feels like a strange blend of the real and the unreal, a place that doesn’t belong in the same reality you’ve known.\n\nWith no other choice but to move forward, you and Bubba leave the data center behind, stepping into the unknown.\n\nThe door slides shut behind you, and the world you’ve escaped from vanishes without a trace. You’re left in a new place, its mysteries waiting to unfold.",
      "name": "Wait",
      "pid": "34",
      "position": {
        "x": "1925",
        "y": "800"
      }
    },
    {
      "text": "",
      "name": "Prepare to fight",
      "pid": "35",
      "position": {
        "x": "2050",
        "y": "475"
      }
    },
    {
      "text": "You and Bubba settle into the strange camping spot you’ve made, the hum of the floor beneath your feet echoing in the silence. The atmosphere feels almost dreamlike, as though time doesn’t flow properly here. You take a deep breath, trying to shake the feeling that you’re being watched, but the eeriness of the place lingers.\n\nAs you get up to explore, you notice a few strange items left scattered around the shelves—trinkets that seem to radiate a soft, almost magical glow. You wander over to one shelf and find a small, intricately carved box. It seems old, maybe centuries old, but it’s strangely preserved, as if untouched by time.\n\n“Look at this,” you murmur, holding it up to Bubba. He steps closer, his curiosity piqued.\n\n“What is it? A puzzle box or something?”\n\nYou shake your head, unsure. As you carefully open it, you find an antique compass inside. But this isn’t any normal compass—the needle spins erratically, pointing in random directions.\n\n“Is it broken?” Bubba asks.\n\nYou test it. The compass seems to react to the environment, moving erratically with the hum of the floor. You tuck it into your bag, feeling a strange connection to the device. Whatever this store is, it seems to be more than just a place—it might be a doorway to something larger.\n\nAfter a few days of scavenging and exploring, the two of you decide to pack up and continue. You find some more strange items, including a delicate, glowing stone, which you keep in your pocket for later. The campsite feels like a small pocket of peace in the otherwise unsettling store.\n\nFinally, after three days, you feel a shift in the air. The once-shifting walls now feel more stable, and you find a door that had been hidden behind a series of shelves. It opens easily, leading you outside to the bright, welcoming light of the outside world. You’re free at last.\n\nYou exchange a relieved smile with Bubba as you step into the fresh air, the strange items from the shelves safely tucked away. Whatever this place was, it’s over now.",
      "name": "Ignore the feeling of being watched and just enjoy camping with Bubba",
      "pid": "36",
      "position": {
        "x": "625",
        "y": "475"
      }
    },
    {
      "text": "",
      "name": "Step into the circle and see what happens next.",
      "pid": "37",
      "position": {
        "x": "150",
        "y": "950"
      }
    }
  ],
  "name": "akei",
  "startnode": "1",
  "creator": "Twine",
  "creator-version": "2.9.2",
  "ifid": "849820C3-D9EC-46E8-9081-2F9ED64384BD"
}

