{
  "title": "Bachelorette party",
  "textboxes":[
  {
    "id": "bachelorette-party-1",
    "description": "You and Bubba are at The Rainbow Lounge, a vibrant gay club packed with lights, laughter, and music blasting through the speakers. The bachelorette party is in full swing, and your friend is happily surrounded by friends and strangers alike. Bubba is already a few drinks in, and you’re feeling pretty buzzed too. The night is young, but things are starting to get hazy.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Have another round of beers",
        "next_id": "bachelorette-party-2"
      },
      {
        "text": "Hit the dance floor with Bubba and the group",
        "next_id": "bachelorette-party-3"
      },
      {
        "text": "Find some microdosed laced water to sober up a bit",
        "next_id": "bachelorette-party-4"
      }
    ]
  },
  {
    "id": "bachelorette-party-2",
    "description": "You and Bubba clink glasses, ordering another round. The night gets blurrier, and everything feels like a wild, joyous blur. Someone starts a drinking game, and before you know it, you’re downing even more. Suddenly, you feel a wave of dizziness.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Keep drinking and hope it passes",
        "next_id": "bachelorette-party-5",
        "skill_check": {
          "skill": "endurance",
          "level": 25,
          "fail": "The dizziness worsens, and you realize you’ve hit your limit. You stumble and have to sit down, trying to keep the room from spinning."
        }
      },
      {
        "text": "Laugh it off and take a break",
        "next_id": "bachelorette-party-6"
      }
    ]
  },
  {
    "id": "bachelorette-party-3",
    "description": "You drag Bubba onto the dance floor, and the two of you start dancing with the bachelorette party crowd. The energy is infectious, and Bubba’s wild dance moves earn a few cheers. But the beers are catching up, and he starts bumping into people.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Keep dancing and have fun",
        "next_id": "bachelorette-party-7",
        "skill_check": {
          "skill": "acrobatics",
          "level": 20,
          "fail": "Bubba trips over himself and stumbles into another guest, spilling their drink. Things are getting a little messy."
        }
      },
      {
        "text": "Suggest heading back to the bar for a breather",
        "next_id": "bachelorette-party-8"
      }
    ]
  },
  {
    "id": "bachelorette-party-4",
    "description": "You head to the bar and order a glass of microdosed laced water. Bubba follows you, grabbing a few napkins to blot his forehead. 'This is intense,' he says with a grin, his face red from dancing. The microdosed laced water helps clear your head a little.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Return to the party and take it slower",
        "next_id": "bachelorette-party-9"
      },
      {
        "text": "Convince Bubba to head home before things get too wild",
        "next_id": "bachelorette-party-10"
      }
    ]
  },
  {
    "id": "bachelorette-party-5",
    "description": "Despite feeling dizzy, you keep drinking. Everything around you blurs, and eventually, you lose track of what’s happening. Hours later, you find yourself sitting on the sidewalk outside, with Bubba patting your back as you try to regain your senses.",
    "image": "",
    "sound": "",
    "end": "bad",
		"choices": []

  },
  {
    "id": "bachelorette-party-6",
    "description": "You laugh off the dizziness and take a break, enjoying the music from a distance. Bubba gives you a big smile, clearly having the time of his life. The night feels just right, and you’re glad you didn’t push it too far.",
    "image": "",
    "sound": "",
		"choices": [],

    "end": "good"
  },
  {
    "id": "bachelorette-party-7",
    "description": "Bubba’s enthusiasm gets the better of him, and he accidentally bumps into the bachelorette, spilling her drink. There’s an awkward silence as everyone looks at you two. Bubba sheepishly apologizes, but the moment has passed.",
    "image": "",
    "sound": "",
    "end": "neutral",
		"choices": []

  },
  {
    "id": "bachelorette-party-8",
    "description": "You manage to convince Bubba to head back to the bar with you. He’s clearly a bit wobbly but agrees, and the two of you take a moment to catch your breath. The night feels a little calmer after that.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Finish the night slowly and head home",
        "next_id": "bachelorette-party-11"
      },
      {
        "text": "Try to rejoin the party carefully",
        "next_id": "bachelorette-party-9"
      }
    ]
  },
  {
    "id": "bachelorette-party-9",
    "description": "You and Bubba rejoin the party, but this time you’re both pacing yourselves. The atmosphere is lively, and you’re able to enjoy the music and laughter without overdoing it.",
    "image": "",
    "sound": "",
    "end": "good",
		"choices": []

  },
  {
    "id": "bachelorette-party-10",
    "description": "You suggest to Bubba that it might be best to call it a night. He nods, looking a little disappointed, but agrees. You make your way out of the club, both of you content that you didn’t go overboard.",
    "image": "",
    "sound": "",
    "end": "neutral",
		"choices": []

  },
  {
    "id": "bachelorette-party-11",
    "description": "You and Bubba spend the rest of the night slowly sipping microdosed laced water and watching the fun unfold. Eventually, you help your friend back to her place, making sure she gets home safe. The two of you laugh about the night on the way back to the camper, glad you kept it under control.",
    "image": "",
    "sound": "",
    "end": "good",
	"choices": []
  }
]
}