{
  "title": "Cultists encounter",
  "textboxes": [
  {
    "id": "cultists-encounter-1",
    "description": "You and Bubba are driving through a remote stretch of road when your camper suddenly breaks down. As you step outside to assess the damage, you hear chanting in the distance. Following the sound, you come across a group of hooded figures gathered in a circle, their hands raised towards the sky. As you approach, one of them looks directly at Bubba and shouts, 'The false Bubba must be destroyed!'",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Approach the cultists and try to talk to them calmly",
        "next_id": "cultists-encounter-2"
      },
      {
        "text": "Tell Bubba to run while you try to distract the cultists",
        "next_id": "cultists-encounter-3"
      },
      {
        "text": "Pull out your weapon to defend yourself and Bubba",
        "next_id": "cultists-encounter-4"
      }
    ]
  },
  {
    "id": "cultists-encounter-2",
    "description": "You step forward and try to reason with the cultists, explaining that Bubba is the real deal. But the cult leader steps forward, his eyes glowing with fervor. 'You speak lies! Only the true Bubba will bear the mark!' He points to a small, arcane symbol on Bubba’s chest. Bubba looks at you, confused, unsure of what this means.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Try to prove Bubba’s authenticity by showing a hidden mark or symbol",
        "next_id": "cultists-encounter-5",
        "skill_check": {
          "skill": "arcanism",
          "level": 35,
          "fail": "You attempt to call upon a hidden symbol to prove Bubba’s true identity, but the cultists only grow more agitated. They begin chanting louder, preparing to attack."
        }
      },
      {
        "text": "Call upon any magic you know to calm them down",
        "next_id": "cultists-encounter-6",
        "skill_check": {
          "skill": "elementalism",
          "level": 40,
          "fail": "Your magic fizzles out before it can affect the group. The cultists’ chants grow more insistent, and they prepare to strike."
        }
      }
    ]
  },
  {
    "id": "cultists-encounter-3",
    "description": "You signal Bubba to run while you try to distract the cultists. Bubba looks uncertain but starts running. You turn to face the cultists and attempt to create a diversion by knocking over a pile of nearby rocks. The noise is enough to grab their attention, but as you make a run for it, a few cultists begin to chase you.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Climb up a nearby tree to escape",
        "next_id": "cultists-encounter-7",
        "skill_check": {
          "skill": "wrestling",
          "level": 25,
          "fail": "You try to climb, but the tree branches snap beneath your weight. The cultists catch up, surrounding you."
        }
      },
      {
        "text": "Hide in the tall grass nearby",
        "next_id": "cultists-encounter-8",
        "skill_check": {
          "skill": "stealth",
          "level": 30,
          "fail": "You crouch down, but your movements give you away. The cultists grab you and pull you back to their circle."
        }
      }
    ]
  },
  {
    "id": "cultists-encounter-4",
    "description": "You pull out your weapon, ready to defend yourself and Bubba. The cult leader raises his hand, and several cultists step forward to restrain you. They are armed with strange, ritualistic blades, but you hold your ground. Bubba looks at you, silently pleading for a way out.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Attempt to use your weapon in a defensive stance",
        "next_id": "cultists-encounter-9",
        "skill_check": {
          "skill": "firearms",
          "level": 50,
          "fail": "Your weapon jams just as the cultists close in on you. You’re forced to defend yourself with your bare hands, but you’re overwhelmed."
        }
      },
      {
        "text": "Try to dodge and move around them to create space",
        "next_id": "cultists-encounter-10",
        "skill_check": {
          "skill": "acrobatics",
          "level": 30,
          "fail": "You attempt to dodge but are caught by one of the cultists, who pulls you back into the circle."
        }
      }
    ]
  },
  {
    "id": "cultists-encounter-5",
    "description": "You try to show the cultists the hidden symbol, but it’s no use—Bubba doesn’t have the mark they speak of. The cultists become enraged, and the leader screams, 'Lies! You are deceived!' The chanting intensifies, and you feel the air grow thick with malevolent energy.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Take a defensive stance and prepare for the worst",
        "next_id": "cultists-encounter-11",
        "skill_check": {
          "skill": "wrestling",
          "level": 40,
          "fail": "You attempt to brace for the attack, but the cultists overpower you. They begin chanting louder, preparing to sacrifice Bubba."
        }
      },
      {
        "text": "Try to flee with Bubba, hoping to find shelter",
        "next_id": "cultists-encounter-12",
        "skill_check": {
          "skill": "navigation",
          "level": 35,
          "fail": "You try to lead Bubba to safety, but the cultists catch up, surrounding you both before you can escape."
        }
      }
    ]
  },
  {
    "id": "cultists-encounter-6",
    "description": "You attempt to use your magic to calm the cultists, but it seems to only fuel their belief that you’re an imposter. The cult leader steps forward, drawing an ominous knife, and raises it toward Bubba.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Use elemental magic to create a wall of fire between you and the cultists",
        "next_id": "cultists-encounter-13",
        "skill_check": {
          "skill": "elementalism",
          "level": 60,
          "fail": "The fire you summon goes wild, creating chaos in the circle but failing to create a proper barrier. The cultists take advantage of the distraction to strike."
        }
      },
      {
        "text": "Throw a magic smoke bomb to disorient the cultists",
        "next_id": "cultists-encounter-14",
        "skill_check": {
          "skill": "alchemy",
          "level": 45,
          "fail": "The smoke bomb doesn’t go off properly, and the cultists close in faster than you can react."
        }
      }
    ]
  },
  {
    "id": "cultists-encounter-7",
    "description": "You try to climb the tree, but it’s too fragile to hold your weight. The cultists swarm around the trunk, shouting and preparing to cut it down. You drop to the ground, surrounded by the furious group.",
    "image": "",
    "sound": "",
    "end": "bad",
		      "choices": []

  },
  {
    "id": "cultists-encounter-8",
    "description": "You try to hide in the grass, but your movements are too loud. The cultists spot you and drag you back into their ritual circle. Bubba looks helpless as the leader steps forward to pronounce judgment on both of you.",
    "image": "",
    "sound": "",
		      "choices": [],

    "end": "bad"
  },
  {
    "id": "cultists-encounter-9",
    "description": "You try to fend off the cultists with your weapon, but your aim is off, and the cultists overpower you. They begin to chant louder, preparing a ritual to summon dark forces. Bubba screams as he’s dragged toward the center.",
    "image": "",
    "sound": "",
		      "choices": [],

    "end": "bad"
  },
  {
    "id": "cultists-encounter-10",
    "description": "You dodge around the cultists, but they corner you in a small clearing. The cult leader approaches with a knife, and the rest prepare to assist in his ritual. Bubba looks terrified.",
    "image": "",
    "sound": "",
    "end": "bad",
		      "choices": []

  }
  ]
}
