{
  "title": "Tiny Territory: The Founding of Em-Land",
  "textboxes": [
    {
      "id": "territory-1",
      "description": "While wandering through the wilderness with Bubba, you come across a peculiar, isolated plot of land—100 meters by 100 meters, perfectly square and utterly uninhabited. A strange border fence and mismatched signage suggest it’s been claimed, unclaimed, and reclaimed for generations. The USSR’s insignia is carved into a stone on one side, while an Ottoman banner flaps in the breeze on the other. Bubba squints, muttering, 'Seems like a no man’s land… ripe for the taking?'",
      "choices": [
        {
          "text": "Declare it your own sovereign nation: Em-Land.",
          "next_id": "territory-2"
        },
        {
          "text": "Investigate the USSR and Ottoman claims first.",
          "next_id": "territory-3"
        },
        {
          "text": "Walk away—this is more trouble than it’s worth.",
          "next_id": "end-neutral"
        }
      ]
    },
    {
      "id": "territory-2",
      "description": "You boldly proclaim this land as the sovereign territory of Em-Land, with Bubba as your first (and only) citizen. Bubba lets out a triumphant cheer, but your victory is short-lived as two guards—one in Soviet fatigues, the other in Ottoman armor—appear from the bushes, both demanding your immediate withdrawal.",
      "choices": [
        {
          "text": "Attempt to diplomatically reason with both guards.",
          "next_id": "territory-4",
          "skill_check": {
            "skill": "diplomacy",
            "value": 50,
            "fail": "The guards remain unswayed and prepare to forcibly evict you from the land."
          }
        },
        {
          "text": "Declare your intent to defend Em-Land at all costs.",
          "next_id": "territory-5"
        },
        {
          "text": "Offer a bribe to the Soviet guard to ignore your presence.",
          "next_id": "territory-6",
          "skill_check": {
            "skill": "management",
            "value": 45,
            "fail": "The Soviet guard sees through your bribe attempt and becomes even more hostile."
          }
        }
      ]
    },
    {
      "id": "territory-3",
      "description": "You decide to investigate further, starting with the USSR. After a short trek to a nearby outpost, a Soviet officer informs you that this land, though tiny, is 'strategically essential' to their mission, without clarifying why. On the Ottoman side, an envoy explains that this land is considered a sacred, ancient claim of the Empire. Both factions insist they have the rights.",
      "choices": [
        {
          "text": "Return to the land and declare independence despite the claims.",
          "next_id": "territory-2"
        },
        {
          "text": "Suggest a treaty to share the territory among all parties.",
          "next_id": "territory-7",
          "skill_check": {
            "skill": "diplomacy",
            "value": 60,
            "fail": "Neither side is interested in sharing and both guards prepare to take action against you."
          }
        },
        {
          "text": "Abandon the quest and leave the disputed land.",
          "next_id": "end-neutral"
        }
      ]
    },
    {
      "id": "territory-4",
      "description": "You try to reason with the guards, proposing that Em-Land could become a peaceful, neutral zone where both factions might coexist. They seem intrigued, but wary.",
      "choices": [
        {
          "text": "Press forward with a proposal for a neutral shared land.",
          "next_id": "territory-7"
        },
        {
          "text": "Declare full independence and set up defenses.",
          "next_id": "territory-5"
        },
        {
          "text": "Offer a tribute of rare items from the camper to sweeten the deal.",
          "next_id": "territory-6"
        }
      ]
    },
    {
      "id": "territory-5",
      "description": "You and Bubba scramble to fortify the land, using makeshift defenses and setting up a perimeter. The guards watch with amusement until one begins to draw a weapon.",
      "choices": [
        {
          "text": "Attempt to outwit the guards with an illusion spell.",
          "next_id": "territory-8",
          "skill_check": {
            "skill": "arcanism",
            "value": 70,
            "fail": "Your spell falters, and the guards quickly advance, seeing through the illusion."
          }
        },
        {
          "text": "Appeal one last time to the guards’ sense of fairness.",
          "next_id": "territory-4"
        },
        {
          "text": "Defend Em-Land by force, using improvised tools.",
          "next_id": "end-bad"
        }
      ]
    },
    {
      "id": "territory-6",
      "description": "You offer the Soviet guard a handful of rare trinkets you’ve picked up along your travels. He examines them with suspicion but pockets one, a slight smile forming.",
      "choices": [
        {
          "text": "Take advantage of his good mood to reinforce Em-Land’s independence.",
          "next_id": "territory-9"
        },
        {
          "text": "Negotiate a neutrality pact with both sides.",
          "next_id": "territory-7"
        }
      ]
    },
    {
      "id": "territory-7",
      "description": "You propose that the land remain a neutral zone where neither faction has full control. After some negotiation, both guards begrudgingly accept, each agreeing to report this solution to their superiors as a tentative truce.",
      "choices": [
        {
          "text": "Finalize the agreement and establish Em-Land as a neutral territory.",
          "next_id": "end-good"
        },
        {
          "text": "Leave the land as neutral but press for a formal declaration of Em-Land.",
          "next_id": "territory-10"
        }
      ]
    },
    {
      "id": "territory-8",
      "description": "You weave a quick illusion spell, conjuring a massive image of yourself towering over the land. The guards, startled, retreat, convinced they’re witnessing an act of divine intervention.",
      "choices": [
        {
          "text": "Secure the land quickly and mark it as Em-Land.",
          "next_id": "end-good"
        },
        {
          "text": "Use the opportunity to get concessions from both factions.",
          "next_id": "territory-10"
        }
      ]
    },
    {
      "id": "territory-9",
      "description": "With the Soviet guard’s support, you declare Em-Land as a sovereign micro-nation. The Ottoman guard eyes you suspiciously but decides to report back to his superiors instead of escalating. You now stand as the official ruler of Em-Land—at least for the moment.",
      "choices": [
        {
          "text": "Hold a small celebration with Bubba, marking the founding of Em-Land.",
          "next_id": "end-good"
        },
        {
          "text": "Begin formalizing Em-Land’s independence.",
          "next_id": "territory-10"
        }
      ]
    },
    {
      "id": "territory-10",
      "description": "You set about formalizing Em-Land’s independence, setting up a flag and drafting a constitution with Bubba. The land’s legitimacy as a micro-nation is still in question, but for now, Em-Land stands tall.",
      "choices": [
        {
          "text": "Finalize everything and begin living as a sovereign state.",
          "next_id": "end-good"
        },
        {
          "text": "Decide to leave the land behind, having made your mark.",
          "next_id": "end-neutral"
        }
      ]
    },
    {
      "id": "end-good",
      "description": "You’ve successfully declared Em-Land an independent micro-nation, earning tentative recognition from both the USSR and the Ottoman Empire. Bubba grins as he plants a small flag with your insignia. 'Long live Em-Land!' he declares. The two of you share a small feast under the stars, your own tiny kingdom now a reality.",
      "choices": []
    },
    {
      "id": "end-neutral",
      "description": "After a lengthy back-and-forth, you decide to leave the land unclaimed. As you and Bubba walk away, you can’t help but feel a pang of regret, but the thought of the land enduring as no man’s land is oddly satisfying.",
      "choices": []
    },
    {
      "id": "end-bad",
      "description": "Despite your efforts, the combined forces of both factions prove overwhelming. You’re forced to retreat, leaving your dreams of Em-Land behind as you and Bubba make a hasty exit. Perhaps your own sovereign nation was too much to ask for… this time.",
      "choices": []
    }
  ]
}
