{
  "title": "Moonlit Shapes",
  "textboxes": [
    {
      "id": "shapes-1",
      "description": "As you wander through a moonlit field, your foot nudges something solid on the ground. Looking closer, you see a collection of strange, carved shapes scattered around—a sphere, a cube, a twisted spiral, and more, each faintly glowing under the moon’s light.",
      "choices": [
        {
          "text": "Examine the shapes closely.",
          "next_id": "shapes-2"
        },
        {
          "text": "Try arranging the shapes into a pattern.",
          "next_id": "shapes-3"
        }
      ]
    },
    {
      "id": "shapes-2",
      "description": "The shapes are carved with ancient symbols, unfamiliar yet intriguing. Each one seems to resonate with a specific energy, but you're unsure what they signify.",
      "choices": [
        {
          "text": "Try to arrange them into a pattern.",
          "next_id": "shapes-3"
        }
      ]
    },
    {
      "id": "shapes-3",
      "description": "You begin to place the shapes in a circle, feeling a pull that guides your hands. As you place the last shape, they glow brighter, and a soft hum fills the air. It’s as if the shapes are coming to life under the moon’s gaze.",
      "choices": [
        {
          "text": "Step back and observe the result.",
          "next_id": "end-good"
        },
        {
          "text": "Touch one of the glowing shapes. (Requires mental skill check: Intuition, 20)",
          "next_id": "shapes-4",
          "skill_check": {
            "skill": "intuition",
            "value": 20,
            "fail": "As you reach out, the glow dims slightly, and the hum fades. The shapes remain, but the moment of mystery passes, leaving you in the quiet field."
          }
        }
      ]
    },
    {
      "id": "shapes-4",
      "description": "Your fingers brush the glowing surface, and you feel a pulse of warmth spread through you. A whisper fills your mind: 'The cycle completes, as all things return to dust.'",
      "choices": [
        {
          "text": "Contemplate the meaning and leave the field.",
          "next_id": "end-neutral"
        }
      ]
    },
    {
      "id": "end-good",
      "description": "The shapes pulse in harmony, casting intricate shadows across the field. You step back, feeling a quiet satisfaction as the moon’s light intensifies their glow. With a sense of calm, you leave the field, the shapes still resonating in your mind.",
      "choices": []
    },
    {
      "id": "end-neutral",
      "description": "You ponder the whisper’s meaning as you walk away, leaving the shapes arranged in the moonlight. The encounter stays with you, lingering like a riddle yet to be solved.",
      "choices": []
    }
  ]
}
