{
  "title": "Resurrection's Price",
  "textboxes": [
    {
      "id": "res-1",
      "description": "Bubba lies unconscious, his body pale and still. The doctors have given up, and the air around you feels heavy. The road ahead is uncertain, and you can feel the weight of the decision pressing down on you. In your mind, a shadow of a figure whispers—Lady Margaret. You know she has the power, but at what cost?",
      "choices": [
        {
          "text": "Contact Lady Margaret, asking for her help.",
          "next_id": "res-2"
        },
        {
          "text": "Try to resuscitate Bubba on your own, without magic.",
          "next_id": "res-3"
        },
        {
          "text": "Grieve quietly and accept Bubba’s fate.",
          "next_id": "res-4"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-2",
      "description": "You close your eyes and reach out with your mind, calling upon Lady Margaret. A cold wind rushes through the room as her presence fills the space, her ethereal voice whispering in your ear. 'I can bring him back,' she says, 'But know this: the price is steep. Forbidden magic is not without consequence.' Her silhouette materializes in front of you, her eyes glowing with an unnatural light.",
      "choices": [
        {
          "text": "Agree to the deal, no matter the cost.",
          "next_id": "res-5"
        },
        {
          "text": "Refuse her help, unsure of the consequences.",
          "next_id": "res-6"
        },
        {
          "text": "Ask her for more details about the price.",
          "next_id": "res-7"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-3",
      "description": "You try to resuscitate Bubba the best you can. Your hands shake as you perform chest compressions, but it’s clear that nothing is working. His body feels cold, unresponsive. As time stretches on, you realize you might have reached the limit of your abilities. The weight of the moment is crushing, and desperation begins to creep in.",
      "choices": [
        {
          "text": "Give up and accept the loss.",
          "next_id": "res-4"
        },
        {
          "text": "Contact Lady Margaret, asking for her help.",
          "next_id": "res-2"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-4",
      "description": "You sit by Bubba’s side, the weight of the moment settling in. There’s no turning back now. The loss feels unbearable. The world continues to move around you, but time feels still. The emptiness without Bubba is overwhelming, and you wonder what you should do next.",
      "choices": [
        {
          "text": "Take some time to grieve and remember Bubba.",
          "next_id": "res-8"
        },
        {
          "text": "Leave the room, unsure of what comes next.",
          "next_id": "res-9"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-5",
      "description": "Lady Margaret’s form sharpens into clarity, her figure glowing with dark energy. 'Very well,' she says, her voice a strange blend of pity and triumph. 'I will grant you this favor. But when the time comes, I will collect.' With a wave of her hand, the room shifts, and a portal of swirling darkness opens. You feel the temperature drop sharply as you step forward.",
      "choices": [
        {
          "text": "Step into the portal and follow Lady Margaret’s lead.",
          "next_id": "res-10"
        },
        {
          "text": "Ask what will happen when the time comes to pay the price.",
          "next_id": "res-11"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-6",
      "description": "Lady Margaret’s form flickers and fades as her presence vanishes. You stand there, still holding Bubba’s lifeless hand. For now, you’ve chosen to do this on your own, even if the cost is greater. The silence is deafening, and the decision weighs heavily on your heart.",
      "choices": [
        {
          "text": "Try to find another way to save Bubba.",
          "next_id": "res-3"
        },
        {
          "text": "Accept Bubba’s fate and begin to plan your next steps.",
          "next_id": "res-4"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-7",
      "description": "Lady Margaret’s lips curl into a knowing smile. 'The price is always the same,' she says, 'A piece of your soul, your very essence. You will pay for this, sooner or later. Are you willing to give it all for one more chance to undo the finality of death?' Her voice softens, and you can hear the temptation in her words.",
      "choices": [
        {
          "text": "Agree to the deal, understanding the consequences.",
          "next_id": "res-5"
        },
        {
          "text": "Refuse her offer, unwilling to make such a sacrifice.",
          "next_id": "res-6"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-8",
      "description": "The grief feels heavy as you sit with Bubba’s lifeless form. His absence creates an emptiness, but you know that this chapter of your life must come to an end. You gather your belongings and prepare to leave, but the weight of his memory will stay with you.",
      "choices": [
        {
          "text": "Leave the area and begin your journey alone.",
          "next_id": "res-9"
        },
        {
          "text": "Seek solace in a quiet place and reflect on your time with Bubba.",
          "next_id": "res-4"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-9",
      "description": "You leave the room, unsure of what lies ahead. The path forward is uncertain, and the world feels different without Bubba by your side. Each step is a reminder of what’s been lost, but you know the journey must continue, even without him.",
      "choices": [
        {
          "text": "Move forward, carrying Bubba’s memory with you.",
          "next_id": "res-8"
        },
        {
          "text": "Find someone else to share your journey with.",
          "next_id": "res-10"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-10",
      "description": "The portal opens, and you step through into a strange, otherworldly space. Lady Margaret stands beside you, guiding you forward. The air is thick with magic, and the very atmosphere hums with the unnatural power of the ritual. Bubba’s body is placed on an altar of stone, and the dark ritual begins.",
      "choices": [
        {
          "text": "Trust Lady Margaret and let the magic take its course.",
          "next_id": "res-12"
        },
        {
          "text": "Resist the ritual, unsure of the consequences.",
          "next_id": "res-13"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-11",
      "description": "Lady Margaret’s smile fades, and she sighs. 'You will understand when the time comes,' she says. 'All debts must be paid, and I do not offer my magic without reason.' The tension in the air grows thick as you realize there is no turning back now.",
      "choices": [
        {
          "text": "Agree to the deal, knowing the consequences.",
          "next_id": "res-5"
        },
        {
          "text": "Refuse the deal and face the consequences of your choice.",
          "next_id": "res-6"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-12",
      "description": "You feel the energy crackle in the air, and a storm of light and shadow erupts around you. The ritual takes hold, swirling around Bubba’s body. His chest rises, and his heart begins to beat once more. But as the ritual concludes, you feel a sharp pain in your chest. The price has been paid.",
      "choices": [
        {
          "text": "Embrace the power, knowing the cost.",
          "next_id": "res-14"
        },
        {
          "text": "Question Lady Margaret about what you’ve just given up.",
          "next_id": "res-15"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-13",
      "description": "You resist the ritual, trying to fight back, but the magic swirls around you, overwhelming your senses. Lady Margaret’s voice becomes a distant echo as the ritual forces its way through. You are powerless against it.",
      "choices": [
        {
          "text": "Surrender to the magic, hoping it will end soon.",
          "next_id": "res-12"
        },
        {
          "text": "Break free from the magic and face the consequences.",
          "next_id": "res-16"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-14",
      "description": "Bubba’s breathing stabilizes, and his eyes flutter open. He’s alive, but you can feel the cost of the magic weighing heavily on you. A part of your soul is gone, forever. You turn to Lady Margaret, but she’s already fading from your sight, her work done.",
      "choices": [
        {
          "text": "Accept the consequences and leave with Bubba.",
          "next_id": "res-17"
        },
        {
          "text": "Ask Lady Margaret what will happen next.",
          "next_id": "res-18"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "res-15",
      "description": "Lady Margaret smiles, a cold, knowing smile. 'You’ve paid the price,' she says. 'But now you must live with the consequences of your choices.' The pain in your chest intensifies as you realize that something inside you is now forever changed.",
      "choices": [
        {
          "text": "Continue on your journey, knowing the cost.",
          "next_id": "res-17"
        },
        {
          "text": "Return to your past life, trying to forget the price of resurrection.",
          "next_id": "res-19"
        }
      ],
      "image": "",
      "sound": ""
    }
  ]
}
