{
  "title": "Bachelorette party",
  "textboxes":[
  {
    "id": "lsdtrip-1",
    "description": "Em takes a sip from a water bottle she found in the camper. Almost instantly, a strange sensation washes over her. Colors intensify, and the walls begin to shimmer. Bubba, noticing her distress, looks concerned. 'Em, you alright?' he asks.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Tell Bubba that something feels off",
        "next_id": "lsdtrip-2"
      },
      {
        "text": "Try to ignore the feeling and focus",
        "next_id": "lsdtrip-3"
      }
    ]
  },
  {
    "id": "lsdtrip-2",
    "description": "Em explains the odd sensations to Bubba. He nods understandingly, looking at the bottle with suspicion. 'That water might be… tainted. I’ll help you through it,' he says calmly.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Ask Bubba to keep talking to you to keep grounded",
        "next_id": "lsdtrip-4"
      },
      {
        "text": "Attempt to calm down by observing the surroundings",
        "next_id": "lsdtrip-5",
        "skill_check": {
          "skill": "observation",
          "level": 20,
          "fail": "The surroundings start to distort, and everything appears to melt. It’s overwhelming."
        }
      }
    ]
  },
  {
    "id": "lsdtrip-3",
    "description": "Em tries to shake off the strange feeling, but the colors around her begin to intensify. The world bends and twists, making it difficult to focus.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Ask Bubba for help",
        "next_id": "lsdtrip-2"
      },
      {
        "text": "Lie down and close your eyes, hoping it passes",
        "next_id": "lsdtrip-6"
      }
    ]
  },
  {
    "id": "lsdtrip-4",
    "description": "Bubba starts talking to Em, his voice a steady anchor in a sea of colors and shapes. 'Remember, it’s all just in your mind. Focus on my voice,' he says.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Listen intently to Bubba’s voice",
        "next_id": "lsdtrip-7",
        "skill_check": {
          "skill": "empathy",
          "level": 15,
          "fail": "Bubba’s voice starts to sound distant, almost echoing. Em feels herself slipping away into the hallucinations."
        }
      },
      {
        "text": "Try to laugh it off, thinking it’s just a trip",
        "next_id": "lsdtrip-8"
      }
    ]
  },
  {
    "id": "lsdtrip-5",
    "description": "Em attempts to ground herself by focusing on her surroundings, but the more she looks, the more things seem to come alive. The walls breathe, and patterns dance around her.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Panic and ask Bubba for help",
        "next_id": "lsdtrip-2"
      },
      {
        "text": "Embrace the experience and see where it leads",
        "next_id": "lsdtrip-9"
      }
    ]
  },
  {
    "id": "lsdtrip-6",
    "description": "Lying down, Em closes her eyes, but instead of calming down, a kaleidoscope of colors fills her mind. The patterns seem to pulse to the beat of her heart.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Try to control your breathing",
        "next_id": "lsdtrip-10",
        "skill_check": {
          "skill": "meditation",
          "level": 25,
          "fail": "The colors spin faster, leaving Em feeling even more disoriented and out of control."
        }
      }
    ]
  },
  {
    "id": "lsdtrip-7",
    "description": "Em focuses on Bubba’s voice, and slowly the intensity of the colors fades. The world begins to settle, and she feels a sense of calm.",
    "image": "",
    "sound": "",
	    "choices": [],
    "end": "good"
  },
  {
    "id": "lsdtrip-8",
    "description": "Em laughs, finding humor in the surreal shapes and colors around her. Bubba chuckles, too, and his presence helps her feel grounded and less overwhelmed.",
    "image": "",
		    "choices": [],
    "sound": "",
    "end": "neutral"
  },
  {
    "id": "lsdtrip-9",
    "description": "Em surrenders to the hallucinations, exploring the strange world her mind creates. She begins to lose track of time, drifting deeper into the visions.",
    "image": "",
    "sound": "",
		    "choices": [],
    "end": "bad"
  },
  {
    "id": "lsdtrip-10",
    "description": "Em controls her breathing, slowing her heart rate and easing the intensity of the colors. Gradually, the hallucinations become less overwhelming.",
    "image": "",
		    "choices": [],
    "sound": "",
    "end": "good"
  }
]}
