{
  "title": "The Bus That Wasn't",
  "textboxes": [
    {
      "id": "missing-bus-1",
      "description": "You stand by the bus stop, an old slab of concrete that feels more like a time capsule than a transportation hub. The kind of bus stop that’s been here since before the concept of time was invented. You check your pocket watch—a gift from a wizard who once forgot your name—and sigh. You're late for the wizard conference, but the bus just zoomed past without even a blink. It looked like it *knew* you were there, but decided to keep going. The air smells like damp earth and overripe apples, which is odd because no one has an orchard anywhere near here.",
      "choices": [
        {
          "text": "Try walking to the town square to catch another bus.",
          "next_id": "missing-bus-2"
        },
        {
          "text": "Stand here and wait for the bus to come back, surely it's just a mistake.",
          "next_id": "missing-bus-3"
        },
        {
          "text": "Stumble your way to the station house. Maybe someone there knows what's going on.",
          "next_id": "missing-bus-4"
        }
      ]
    },
    {
      "id": "missing-bus-2",
      "description": "You trudge toward the town square, your shoes making soft *plop* sounds on the cobblestones like you're stepping in something important. The town square itself looks like it was built on the last day of a forgotten century, with lopsided buildings and the faintest smell of bread. But something’s wrong—there are symbols all over the ground, drawn in chalk, spirals and squiggles that might have been put there by a child—or a conspiracy. They hum if you stare too long. Do they... pulse in time with your heartbeat?",
      "skill_check": {
        "skill": "arcanism",
        "difficulty": "medium",
        "fail": "You squint at the symbols, trying to read their meaning, but they start to wiggle like they’re mocking you. You feel a sudden desire to leave before they decide to crawl up your ankles."
      },
      "choices": [
        {
          "text": "Follow the symbols. They must lead somewhere interesting.",
          "next_id": "missing-bus-5"
        },
        {
          "text": "Ask a local what these strange markings mean.",
          "next_id": "missing-bus-6"
        }
      ]
    },
    {
      "id": "missing-bus-3",
      "description": "You decide to wait, even though the bus is long gone. An old woman in a bright red shawl, who you’re almost sure wasn’t there a second ago, leans against the lamppost. 'Don’t worry,' she says with an unsettling grin, 'it’ll come when it comes.' You notice her shoes are slightly too big for her feet, and she smells faintly of mildew. The air around her crackles with something unspoken.",
      "choices": [
        {
          "text": "Ask her about the bus. She knows something.",
          "next_id": "missing-bus-7"
        },
        {
          "text": "Just keep waiting. Maybe the bus is having a nap somewhere.",
          "next_id": "missing-bus-8"
        }
      ]
    },
    {
      "id": "missing-bus-4",
      "description": "You wander over to the station house, a rickety little place that feels like it belongs in a children's book about forgotten towns. Inside, the walls are covered in old maps, some of them upside down, some curling at the edges like they’re allergic to being flat. Behind the counter, Mr. Fiddlesticks, the town’s notoriously forgetful transportation manager, is sipping tea from a mug that says, 'I’m Not Lost, I’m Just Early.' He doesn’t look up when you walk in.",
      "choices": [
        {
          "text": "Ask him about the bus schedule. He might know where it’s gone.",
          "next_id": "missing-bus-9"
        },
        {
          "text": "Examine one of the maps. They look... strange.",
          "next_id": "missing-bus-10"
        }
      ]
    },
    {
      "id": "missing-bus-5",
      "description": "You follow the chalk symbols as they twist and curl around corners, leading you to a narrow alleyway. It ends at a crumbling theater, a place that feels like it used to be a circus tent but forgot how to be one. The marquee flickers above the entrance, displaying the words: 'TONIGHT: The Leyline Show, Tickets: By Invitation Only.' You swear you’ve never seen that theater in your life, but you feel... drawn to it.",
      "choices": [
        {
          "text": "Enter the theater and see what’s going on.",
          "next_id": "missing-bus-11"
        },
        {
          "text": "Turn back. This feels like a bad idea.",
          "next_id": "missing-bus-12"
        }
      ]
    },
    {
      "id": "missing-bus-6",
      "description": "A man in a very, very old suit shuffles by. He has a cane, and his mustache looks like it’s been glued on with too much care. 'Leylines,' he mutters as he shuffles past you. 'Yeah, they’re real. But nobody talks about them unless they’ve got a few too many oddments in their pockets. Old theater, near the river…' He stops, looks back over his shoulder, and winks. Then he disappears down a side street.",
      "choices": [
        {
          "text": "Follow the old man’s advice and head for the theater.",
          "next_id": "missing-bus-11"
        },
        {
          "text": "Ignore the man and walk back to the station.",
          "next_id": "missing-bus-4"
        }
      ]
    },
    {
      "id": "missing-bus-7",
      "description": "The old woman in the red shawl chuckles. 'This is a place for waiting, darling. The bus will come when it’s ready. Or maybe not. In fact, the next bus could be anything. It could be the wind, or a crow, or a wizard who decided to forget his hat.' She winks, and you swear you hear the sound of an owl hooting somewhere close by.",
      "choices": [
        {
          "text": "Ask her if she knows how to get to the wizard conference.",
          "next_id": "missing-bus-13"
        },
        {
          "text": "Just wait. Something’s bound to happen.",
          "next_id": "missing-bus-8"
        }
      ]
    },
    {
      "id": "missing-bus-8",
      "description": "You wait. And wait. And wait. Eventually, the bus appears—only it’s not the same bus you saw earlier. This one’s all crooked, like a bent spoon, and the driver is wearing a full moon for a hat. He waves as if you should know him. 'Hop on, we're almost late for the meeting.' He doesn’t say *which* meeting, but you climb aboard anyway, a little unsure of what’s happening.",
      "choices": [
        {
          "text": "Sit down and ride along, hoping this bus actually gets you there.",
          "next_id": "missing-bus-14"
        },
        {
          "text": "Ask the driver about the bus. This doesn’t feel right.",
          "next_id": "missing-bus-15"
        }
      ]
    },
    {
      "id": "missing-bus-9",
      "description": "You squint at the map, and something strange happens. The lines start to move. They wiggle. They connect. They spin, and suddenly, the town looks like it’s surrounded by invisible threads, vibrating at a frequency you can’t quite hear. Mr. Fiddlesticks notices you staring. 'Ah,' he says, sipping more tea, 'That’s the leyline energy. Tricky stuff, that. But if you know where to look, it can guide you.'",
      "choices": [
        {
          "text": "Ask him where the leyline leads.",
          "next_id": "missing-bus-16"
        },
        {
          "text": "Leave the station and go toward the theater. Maybe it holds the answer.",
          "next_id": "missing-bus-5"
        }
      ]
    },
    {
      "id": "missing-bus-10",
      "description": "You examine the map closely and realize the leyline leads straight to the theater. Could the bus and the leyline be connected? Perhaps the strange energy is what makes the buses run on their own schedule. You wonder if this town is just one big enchanted waiting room.",
      "choices": [
        {
          "text": "Follow the leyline to the theater.",
          "next_id": "missing-bus-11"
        },
        {
          "text": "Decide to leave and find your own way to the conference.",
          "next_id": "missing-bus-5"
        }
      ]
    },
    {
      "id": "missing-bus-11",
      "description": "You step into the theater, the air thick with something unnameable. The lights flicker once, twice, and then the stage curtain rises to reveal a room filled with other lost souls—some of them look like wizards, others like musicians, and a few like plain old travelers. They all stare at you, waiting. 'You’ve come for the leyline conference, I presume?' asks the man on stage, wearing a monocle and a pointed hat. 'We were all waiting for you.'",
      "choices": [
        {
          "text": "Sit down and attend the conference, hoping for answers.",
          "next_id": "missing-bus-17"
        },
        {
          "text": "Turn around and leave. This is all too strange.",
          "next_id": "missing-bus-18"
        }
      ]
    }
  ]
}
