{
  "title": "Night Intruder",
  "textboxes": [
    {
      "id": "night-intruder-1",
      "description": "It’s the dead of night. Shadows stretch across the camper’s walls, the hum of crickets and the distant hoot of an owl blending into a heavy silence. You and Bubba are both asleep, the camper’s cooling system sighing softly. Suddenly, a faint, sharp scratching grates against the camper’s side, slicing through the stillness. Bubba stirs, his eyes snapping open, and you hold your breath as a soft thud follows the scratching. Someone—or something—is trying to break in.",
      "choices": [
        {
          "text": "Peer through the window, trying not to be seen.",
          "next_id": "night-intruder-2"
        },
        {
          "text": "Wake Bubba fully, gripping his arm and ready to act.",
          "next_id": "night-intruder-3"
        },
        {
          "text": "Stay silent, waiting in the darkness, hoping they'll pass.",
          "next_id": "night-intruder-4"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-2",
      "description": "Your heart pounding, you inch toward the window, barely breathing as you peer out. A shadowy figure crouches beside the camper’s door, methodically prying at the lock. In the dim moonlight, you see the glint of metal in their hand—a crowbar. Their movements are deliberate, as if they have all the time in the world, unaware that you’re watching them.",
      "choices": [
        {
          "text": "Step outside, confronting the intruder head-on.",
          "next_id": "night-intruder-5"
        },
        {
          "text": "Grab a weapon to intimidate them from inside.",
          "next_id": "night-intruder-6"
        },
        {
          "text": "Quietly wake Bubba, signaling him to prepare.",
          "next_id": "night-intruder-3"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-3",
      "description": "Bubba blinks awake, his gaze hardening as he hears the scratching. He motions for you to stay silent and pulls a battered crowbar from under his bunk, its metal gleaming darkly in the faint light. The two of you prepare, every creak of the camper heightening your sense of dread.",
      "choices": [
        {
          "text": "Let Bubba take the lead in confronting the intruder.",
          "next_id": "night-intruder-7"
        },
        {
          "text": "Take a weapon yourself, preparing to defend your ground.",
          "next_id": "night-intruder-8"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-4",
      "description": "You freeze, straining to hear every sound. The scratching stops momentarily, replaced by an unsettling silence. Then, slow, careful footsteps approach, each one sending a shiver down your spine. The intruder is only feet away now, testing the handle with quiet precision.",
      "choices": [
        {
          "text": "Check the window again to see where they are.",
          "next_id": "night-intruder-9"
        },
        {
          "text": "Wait in tense silence, every muscle ready to act.",
          "next_id": "night-intruder-10"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-5",
      "description": "You pull open the door, stepping into the chill night air. The burglar, a shadowy figure masked and cloaked, freezes mid-motion, their crowbar poised. Neither of you speaks, the only sound the rapid thud of your heartbeat. You glimpse dark eyes beneath the mask—eyes calculating whether to attack or flee.",
      "choices": [
        {
          "text": "Demand to know what they want, ready to react.",
          "next_id": "night-intruder-11"
        },
        {
          "text": "Threaten them to leave while you still have the chance.",
          "next_id": "night-intruder-12"
        },
        {
          "text": "Charge at them, trying to catch them off guard.",
          "next_id": "night-intruder-13"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-6",
      "description": "Grabbing a wrench, you bang it against the camper wall, the sound reverberating in the silent night. There’s a pause, followed by rapid footsteps receding into the woods. The intruder might be gone—for now.",
      "choices": [
        {
          "text": "Step outside and scan the area for movement.",
          "next_id": "night-intruder-9"
        },
        {
          "text": "Stay hidden, watching for any sign of return.",
          "next_id": "night-intruder-4"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-7",
      "description": "Bubba grips the crowbar tightly, his stance rigid as he creeps toward the door. The intruder hears a faint creak and turns, but Bubba is faster, bursting out with a roar and swinging the crowbar in a swift arc. The intruder stumbles back, caught off guard, their crowbar slipping from their hand.",
      "choices": [
        {
          "text": "Join Bubba and subdue the intruder together.",
          "next_id": "night-intruder-13"
        },
        {
          "text": "Demand the intruder leave while they still can.",
          "next_id": "night-intruder-12"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-8",
      "description": "You grab a heavy object—a wrench, a knife, anything to defend yourself. As you approach the door, the scratching stops, leaving an unsettling stillness. When you cautiously open the door, there’s nothing but silence and shadows stretching across the empty woods.",
      "choices": [
        {
          "text": "Circle the camper, searching for any hidden threat.",
          "next_id": "night-intruder-9"
        },
        {
          "text": "Return inside, waiting to see if they come back.",
          "next_id": "night-intruder-10"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-9",
      "description": "Stepping outside, you scan the dark woods. The wind rustles the leaves, and shadows dance, but the intruder is nowhere to be seen. The air feels thick with unease, as if someone—or something—is watching you from the treeline.",
      "choices": [
        {
          "text": "Lock the camper and stay alert inside.",
          "next_id": "night-intruder-end"
        },
        {
          "text": "Stand watch for the rest of the night, uneasy and tense.",
          "next_id": "night-intruder-end"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-10",
      "description": "You wait, tension building as the silence stretches. Minutes feel like hours, until a faint rustle signals movement in the distance. The intruder is gone, but the night feels darker, colder, and you wonder if they’ll return.",
      "choices": [
        {
          "text": "Check the camper's locks once more.",
          "next_id": "night-intruder-9"
        },
        {
          "text": "Try to rest, though sleep feels distant.",
          "next_id": "night-intruder-end"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-11",
      "description": "The intruder stares at you, silent and unmoving. Beneath the mask, there’s a flicker of uncertainty, maybe fear. 'I needed…something,' they mutter, voice barely audible. Their grip on the crowbar loosens, and they glance to the side, as if planning their next move.",
      "choices": [
        {
          "text": "Offer them a chance to explain and leave peacefully.",
          "next_id": "night-intruder-14"
        },
        {
          "text": "Warn them that another move will have consequences.",
          "next_id": "night-intruder-12"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-12",
      "description": "You raise your voice, demanding they leave. The intruder hesitates, then bolts into the woods, disappearing into the night. The darkness swallows them, leaving only silence behind.",
      "choices": [
        {
          "text": "Head back inside, shaken but safe.",
          "next_id": "night-intruder-end"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-13",
      "description": "Bubba and you overwhelm the intruder, who finally yields, their crowbar clattering to the ground. They mutter something unintelligible and hold up their hands in surrender.",
      "choices": [
        {
          "text": "Demand an explanation before letting them go.",
          "next_id": "night-intruder-14"
        },
        {
          "text": "Turn them away, warning them not to return.",
          "next_id": "night-intruder-end"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-14",
      "description": "The intruder mutters about needing 'supplies' and 'desperation' before slinking into the shadows. You and Bubba watch them disappear, tension easing only once the night returns to quiet.",
      "choices": [
        {
          "text": "Return inside, resolving to secure the camper better.",
          "next_id": "night-intruder-end"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "night-intruder-end",
      "description": "The night’s intruder has gone, leaving you with lingering unease. You lock the camper, but as you settle down, you can’t help but wonder if they’ll be back, lurking in the night.",
      "choices": []
    }
  ]
}
