{"text": "
THE MAY-FLOWER AND HER LOG\r\n\r\nJuly 15, 1620--May 6, 1621\r\nChiefly from Original Sources\r\n\r\nBy AZEL AMES, M.D.\r\nMember of Pilgrim Society, etc.\r\n\r\n\r\n\r\nBOOK 5.\r\n\r\nCHAPTER VII\r\n\r\nQUARTERS, COOKING, PROVISIONS\r\n\r\nProbably no more vexatious problem presented itself for the time being to\r\nthe \"governors\" of the two vessels and their \"assistants,\" upon their\r\nselection, than the assignment of quarters to the passengers allotted to\r\ntheir respective ships.  That these allotments were in a large measure\r\ndetermined by the requirements of the women and children may be\r\nconsidered certain.  The difficulties attendant on due recognition of\r\nsocial and official station (far more imperative in that day than this)\r\nwere in no small degree lessened by the voluntary assignment of\r\nthemselves, already mentioned, of some of the Leyden chief people to the\r\nsmaller ship; but in the interests of the general welfare and of harmony,\r\ncertain of the leaders, both of the Leyden and London contingents, were\r\nof necessity provided for in the larger vessel.  The allotments to the\r\nrespective ships made at Southampton, the designation of quarters in the\r\nships themselves, and the final readjustments upon the MAY-FLOWER at\r\nPlymouth (England), when the remaining passengers of both ships had been\r\nunited, were all necessarily determined chiefly with regard to the needs\r\nof the women, girls, and babes.  Careful analysis of the list shows that\r\nthere were, requiring this especial consideration, nineteen women, ten\r\nyoung girls, and one infant.  Of the other children, none were so young\r\nthat they might not readily bunk with or near their fathers in any part\r\nof the ship in which the latter might be located.\r\n\r\nWe know enough of the absolute unselfishness and devotion of all the\r\nLeyden leaders, whatever their birth or station,--so grandly proven in\r\nthose terrible days of general sickness and death at New Plymouth,--to be\r\ncertain that with them, under all circumstances, it was noblesse oblige,\r\nand that no self-seeking would actuate them here.  It should be\r\nremembered that the MAY-FLOWER was primarily a passenger transport, her\r\npassengers being her principal freight and occupying the most of the\r\nship, the heavier cargo being chiefly confined to the \"hold.\"  As in that\r\nday the passenger traffic was, of course, wholly by sailing vessels, they\r\nwere built with cabin accommodations for it, as to numbers, etc.,\r\nproportionately much beyond those of the sailing craft of to-day.  The\r\ntestimony of Captain John Smith, \"the navigator,\" as to the passengers of\r\nthe MAY-FLOWER \"lying wet in their cabins,\" and that of Bradford as to\r\nBillington's \"cabin between decks,\" already quoted, is conclusive as to\r\nthe fact that she had small cabins (the \"staterooms\" of to-day), intended\r\nchiefly, no doubt, for women and children.  The advice of Edward Winslow\r\nto his friend George Morton, when the latter was about to come to New\r\nEngland in the ANNE, \"build your cabins as open as possible,\"\r\nis suggestive of close cabins and their discomforts endured upon the\r\nMAY-FLOWER.  It also suggests that the chartering-party was expected in\r\nthose days to control, if not to do, the \"fitting up\" of the ship for her\r\nvoyage.  In view of the usual \"breadth of beam\" of ships of her class and\r\ntonnage, aft, and the fore and aft length of the poop, it is not\r\nunreasonable to suppose that there were not less than four small cabins\r\non either side of the common (open) cabin or saloon (often depicted as\r\nthe signing-place of the Compact), under the high poop deck.  Constructed\r\non the general plan of such rooms or cabins to-day (with four single\r\nberths, in tiers of two on either hand), there would be--if the women and\r\ngirls were conveniently distributed among them--space for all except the\r\nBillingtons, who we know had a cabin (as had also doubtless several of\r\nthe principal men) built between decks.  This would also leave an after\r\ncabin for the Master, who not infrequently made his quarters, and those\r\nof his chief officer, in the \"round house,\" when one existed, especially\r\nin a crowded ship.\r\n\r\nCabins and bunks \"between decks\" would provide for all of the males of\r\nthe company, while the seamen, both of the crew and (some of) those in\r\nthe employ of the Pilgrims--like Trevore and Ely--were no doubt housed in\r\nthe fore castle.  Alderton and English seem to have been counted \"of the\r\ncompany.\"  The few data we have permit us to confidently assume that some\r\nsuch disposition of the passengers was (necessarily) made, and that but\r\nfor the leaky decks, the inseparable discomforts of the sea, and those of\r\nover crowding, the wives of the Pilgrims (three of whom gave birth to\r\nchildren aboard the ship), and their daughters, were fairly \"berthed.\"\r\n\r\nBradford is authority for the statement that with the \"governor\" of the\r\nship's company were chosen \"two or three assistants .  .  .  to order\r\n[regulate] the people by the way [on the passage] and see to the\r\ndisposition of the provisions,\" etc. The last-named duty must have been a\r\nmost difficult and wearisome one.  From what has been shown of the\r\npoverty of the ship's cooking facilities (especially for so large a\r\ncompany), one must infer that it would be hopeless to expect to cook food\r\nin any quantity, except when all conditions favored, and then but slowly\r\nand with much difficulty.  From the fact that so many would require food\r\nat practically the same hours of the day, it is clear that there must\r\nhave been distribution of food (principally uncooked) to groups or\r\nfamilies, who, with the aid of servants (when available), must each have\r\nprepared their own meals, cooking as occasion and opportu nity indicated;\r\nmuch after the manner of the steerage passengers in later days, but\r\nbefore those of the great ocean liners.  There appears to have been but\r\none cook for the officers and crew of the ship, and his hands were\r\ndoubtless full with their demands.  It is certain that his service to the\r\npassengers must have been very slight.  That \"the cook\" is named as one\r\nof the ship's crew who died in Plymouth harbor (New England) is all the\r\nknowledge we have concerning him.\r\n\r\nThe use of and dependence upon tea and coffee, now so universal, and at\r\nsea so seemingly indispensable, was then unknown, beer supplying their\r\nplaces, and this happily did not have to be prepared with fire.  \"Strong\r\nwaters\"--Holland gin and to some extent \"aqua vitae\" (brandy)--were\r\nrelied upon for the (supposed) maintenance of warmth.  Our Pilgrim\r\nFathers were by no means \"total abstainers,\" and sadly bewailed being\r\ndeprived of their beer when the supply failed.  They also made general\r\nand habitual (moderate) use of wine and spirits, though they sharply\r\ninterdicted and promptly punished their abuse.\r\n\r\nIn the absence of cooking facilities, it became necessary in that day to\r\nrely chiefly upon such articles of food as did not require to be prepared\r\nby heat, such as biscuit (hard bread), butter, cheese (\"Holland cheese\"\r\nwas a chief staple with the Pilgrims), \"haberdyne\" (or dried salt\r\ncodfish), smoked herring, smoked (\"cured \") ham and bacon, \"dried neat's\r\ntongues,\" preserved and \"potted\" meats (a very limited list in that day),\r\nfruits, etc. Mush, oatmeal, pease-puddings, pickled eggs, sausage meats,\r\nsalt beef and pork, bacon, \"spiced beef,\" such few vegetables as they had\r\n(chiefly cabbages, turnips, and onions,--there were no potatoes in that\r\nday), etc., could be cooked in quantity, when the weather permitted, and\r\nwould then be eaten cold.\r\n\r\nExcept as dried or preserved fruits, vegetables (notably onions), limes,\r\nlemon juice, and the free use of vinegar feebly counteracted, their food\r\nwas distinctively stimulant of scorbutic and tuberculosis disease, which\r\nconstant exposure to cold and wet and the overcrowded state of the ship\r\ncould but increase and aggravate.  Bradford narrates of one of the crew\r\nof the MAY-FLOWER when in Plymouth harbor, as suggestive of the wretched\r\nconditions prevalent in the ship, that one of his shipmates, under an\r\nagreement to care for him, \"got him a little spice and made him a mess of\r\nbeef, once or twice,\" and then deserted him.\r\n\r\nJosselyn, in his \"Two Voyages to New England,\" gives as the result of the\r\nexperience and observations had in his voyages, but a few years later,\r\nmuch that is interesting and of exceptional value as to the food and\r\nequipment of passengers to, and colonists in, this part of America.  It\r\nhas especial interest, perhaps, for the author and his readers, in the\r\nfact that Josselyn's statements were not known until after the data given\r\nin these pages had been independently worked out from various sources,\r\nand came therefore as a gratifying confirmation of the conclusions\r\nalready reached.\r\n\r\nJosselyn says as to food, as follows:--\"The common proportion of\r\nvictuals for the sea to a mess (being 4 men) is as followeth:--\r\n\r\n\"2 pieces of Beef of 3 lb. 1\/4 apiece.  Pork seems to have been\r\ninadvertently omitted.\r\n\r\n\"Four pounds of Bread [ship-bread].\r\n\r\n\"One pint & 1\/2 of Pease.\r\n\r\n\"Four Gallons of Bear [Beer], with mustard and vinegar for 3 flesh days\r\nin the week.\"\r\n\r\n\r\n\"For four fish days to each mess per day:--\r\n\r\n\"Two pieces of Codd or Haberdine, making 3 pieces of a fish, i.e.  a\r\ndried salt cod being divided into three pieces, 2 of those pieces were to\r\nbe a day's ration for 4 men.\r\n\r\n\"Four pounds of Bread.\r\n\r\n\"Three-quarters of a pound of cheese.\r\n\r\n\"Bear as before.\"\r\n\r\n\"Oatmeal per day for 50 men 1 Gallon [dry], and so proportionable for\r\nmore or fewer.\"\r\n\r\n\"Thus you see the ship's provision is Beefe and Porke, Fish, Butter,\r\nCheese, Pease, Pottage, Water-Gruel, Bisket, and six shilling Bear.\"\r\n\r\n\r\n\"For private fresh provision you may carry with you (in case you or any\r\nof yours should be sick at sea):--\r\n\r\n\"Conserves of Roses, Clove-Gilliflowers, Wormwood, Green-Ginger, Burnt-\r\nWine, English Spirits, Prunes to stew, Raisons of the Sun, Currence\r\n[currants], Sugar, Nutmeg, Mace, Cinna mon, Pepper and Ginger, White\r\nBisket, Butter, or 'Captains biscuit,' made with wheat flour or Spanish\r\nRusk, Eggs, Rice, Juice of Lemons, well put up to cure or prevent the\r\nScurvy, Small Skillets, Pipkins, Porringers and small Frying Pans.\"\r\n\r\nJosselyn further gives us an estimate for:--\r\n\r\n\"Victuals for a whole year to be carried out of England for one man and so\r\nfor more after this rate.\"  He annexed also their current prices:--\r\n\r\n\"Eight bushels of Meal [Rye meal probably intended]\r\nTwo bushels of Pease at 3\/s\r\nTwo bushels of Oatmeal at 4s\/6d\r\nOne Gallon of Aqua Vitae\r\nOne Gallon of Oyl\r\nTwo Gallons of Vinegar\r\n[No estimate of Beef or Pork, or of vegetables, is included.]\r\nA Hogshead of English Bear\r\nA Hogshead of Irish Bear\r\nA Hogshead of Vinegar\r\nA bushel of Mustard seed\r\nA Kental [Quintal] of fish, Cod or Haberdine, 112 lb.\"\r\n\r\n\r\nEdward Window, in his letter to George Morton before mentioned, advising\r\nhim as to his voyage, says: \"Bring juice of lemons and take it fasting.\r\nIt is of good use.\"\r\n\r\nIt is indeed remarkable that, totally unused to any such conditions, wet,\r\ncold, poorly fed, overcrowded, storm-tossed, bruised and beaten, anxious,\r\nand with no homes to welcome them, exposed to new hardships and dangers\r\non landing, worn and exhausted, any of the MAY-FLOWER'S company survived.\r\nIt certainly cannot be accounted strange that infectious diseases, once\r\nstarted among them, should have run through their ranks like fire, taking\r\nboth old and young. Nor is it strange that--though more inured to\r\nhardship and the conditions of sea life--with the extreme and unusual\r\nexposure of boat service on the New England coast in mid winter, often\r\nwading in the icy water and living aboard ship in a highly infected\r\natmosphere, the seamen should have succumbed to disease in almost equal\r\nratio with the colonists.  The author is prepared, after careful\r\nconsideration, to accept and professionally indorse, with few exceptions,\r\nthe conclusions as to the probable character of the decimating diseases\r\nof the passengers and crew of the MAY-FLOWER, so ably and interestingly\r\npresented by Dr. Edward E. Cornwall in the \"New England Magazine\" for\r\nFebruary, 1897--From the fact that Edward Thompson, Jasper More, and\r\nMaster James Chilton died within a month of the arrival at Cape Cod (and\r\nwhile the ship lay in that harbor), and following the axiom of vital\r\nstatistics that \"for each death two are constantly sick,\" there must have\r\nbeen some little (though not to say general) sickness on the MAY-FLOWER\r\nwhen she arrived at Cape Cod.  It would, in view of the hardship of the\r\nvoyage, have been very remarkable if this had not been the case.  It\r\nwould have been still more remarkable if the ill-conditioned, thin-\r\nblooded, town-bred \"servants\" and apprentices had not suffered first and\r\nmost.  It is significant that eight out of nine of the male \"servants\"\r\nshould have died in the first four months.  It was impossible that scurvy\r\nshould not have been prevalent with both passengers and crew.\r\n\r\n\r\n\r\n\r\nCHAPTER VIII\r\n\r\nTHE MAY-FLOWER'S LADING\r\n\r\nBeside her human freight of one hundred and thirty or more passengers and\r\ncrew, the lading of the MAY-FLOWER when she sailed from Plymouth\r\n(England), September 6\/16, 1620, was considerable and various.  If\r\nclearing at a custom-house of to-day her manifest would excite no little\r\ninterest and surprise.  Taking no account of the ship's stores and\r\nsupplies (necessarily large, like her crew, when bound upon such a\r\nvoyage, when every possible need till her return to her home port must be\r\nprovided for before sailing), the colonists' goods and chattels were\r\nmany, their provisions bulky, their ordnance, arms, and stores (in the\r\nhold) heavy, and their trading-stock fairly ample.  Much of the cargo\r\noriginally stowed in the SPEEDWELL, a part, as we know, of her company,\r\nand a few of her crew were transferred to the MAY-FLOWER at Plymouth, and\r\nthere can be no doubt that the ship was both crowded and overladen.\r\n\r\nIt is altogether probable that the crowded condition of her spar and main\r\ndecks caused the supply of live-stock taken--whether for consumption upon\r\nthe voyage or for the planters' needs on shore--to be very limited as to\r\nboth number and variety.  It has been matter of surprise to many that no\r\ncattle (not even milch-cows) were taken, but if--as is not unlikely--it\r\nwas at first proposed to take a cow or two (when both ships were to go\r\nand larger space was available), this intent was undoubtedly abandoned at\r\nPlymouth, England, when it became evident that there would be dearth of\r\nroom even for passengers, none whatever for cattle or their fodder (a\r\nlarge and prohibitive quantity of the latter being required for so long a\r\nvoyage), and that the lateness of the season and its probable hardships\r\nwould endanger the lives of the animals if taken. So far as appears the\r\nonly domestic live-stock aboard the MAY-FLOWER consisted of goats, swine,\r\npoultry, and dogs. It is quite possible that some few sheep, rabbits, and\r\npoultry for immediate consumption (these requiring but little forage) may\r\nhave been shipped, this being customary then as now. It is also probable\r\nthat some household pets--cats and caged singing-birds, the latter always\r\nnumerous in both England and Holland--were carried on board by their\r\nowners, though no direct evidence of the fact is found.  There is ample\r\nproof that goats, swine, poultry, and dogs were landed with the colonists\r\nat New Plymouth, and it is equally certain that they had at first neither\r\ncattle, horses, nor sheep.  Of course the she-goats were their sole\r\nreliance for milk for some time, whether afloat or ashore, and goat's\r\nflesh and pork their only possibilities in the way of fresh meat for many\r\nmonths, save poultry (and game after landing), though we may be sure, in\r\nview of the breeding value of their goats, poultry, and swine, few were\r\nconsumed for food.  The \"fresh meat\" mentioned as placed before\r\nMassasoit' on his first visit was probably venison, though possibly kid's\r\nmeat, pork, or poultry.  Of swine and poultry they must have had a pretty\r\nfair supply, judging from their rapid increase, though their goats must\r\nhave been few. They were wholly without beasts of draft or burden (though\r\nit seems strange that a few Spanish donkeys or English \"jacks\" had not\r\nbeen taken along, as being easily kept, hardy, and strong, and quite\r\nequal to light ploughing, hauling, carrying, etc.), and their lack was\r\nsorely felt.  The space they and their forage demanded it was doubtless\r\nconsidered impracticable to spare.  The only dogs that appear in evidence\r\nare a large mastiff bitch (the only dog of that breed probably seen on\r\nthese shores since Pring's \"bigge dogges\" so frightened the Indians' in\r\nthis region seventeen years before)\r\n\r\n     [Captain Martin Pring had at Plymouth, in 1603, two great \"mastive\r\n     dogges\" named \"Fool\" and \"Gallant,\" the former being trained to carry\r\n     a half-pike in his mouth.  \"The Indians were more afraid of these\r\n     dogs than of twenty men.\"  American Magazine of History; Goodwin,\r\n     Pilgrim Republic, p. 3.]\r\n\r\nand a small spaniel, both the property of passengers, though there may\r\nhave been others not mentioned. Speaking of the venison found in a tree\r\nby one of the exploring parties, Winslow says: \"We thought it fitter for\r\nthe dogs than for us,\" perhaps suggesting by his word \"the\" their own\r\ndogs aboard ship and provision for them.  There is an intimation as to\r\nthe ownership of these two dogs in the facts that on certainly two\r\noccasions John Goodman was accompanied by the little spaniel (once when\r\nalone), from which it may perhaps be inferred that he was the dog's\r\nmaster; while the big mastiffs presence when only Peter Browne and\r\nGoodman were together suggests that Browne was her owner. The goats,\r\nswine, rabbits, and poultry were doubtless penned on the spar-deck\r\nforward, while possibly some poultry, and any sheep brought for food, may\r\nhave been temporarily housed--as was a practice with early voyagers--in\r\nthe (unused) ship's boats, though these appear to have been so few in\r\nnumber and so much in demand that it is doubtful if they were here\r\navailable as pens. The heavy cargo and most of the lighter was of course\r\nstowed in the hold, as the main deck (or \"'tween decks\") was mostly\r\noccupied as quarters for the male passengers, old and young, though the\r\ncolonists' shallop, a sloop-rigged boat some thirty feet in length,  had\r\nbeen \"cut down\" and stowed \"between the decks\" for the voyage.  A glimpse\r\nof the weary life at sea on that long and dreary passage is given in\r\nBradford's remark that \"she was much opened with the people's lying in\r\nher during the voyage:' This shallop with her equipment, a possible spare\r\nskiff or two, the chests, \"boxes,\" and other personal belongings of the\r\npassengers, some few cases of goods, some furniture, etc., constituted\r\nthe only freight for which there could have been room \"between decks,\"\r\nmost of the space (aft) being occupied by cabins and bunks.\r\n\r\nThe provisions in use, both by passengers and crew, were probably kept in\r\nthe lazarette or \"runs,\" in the stern of the ship, which would be\r\nunusually capacious in vessels of this model; some--the bulkiest--in the\r\nhold under the forward hatch, as the custom was, and to some extent still\r\nis. The food supply of the Pilgrims, constituting part of the MAY-\r\nFLOWER'S Cargo, included, as appears from authentic sources:--\r\n\r\nBreadstuff's, including,--\r\n     Biscuits or ship-bread (in barrels).\r\n     Oatmeal (in barrels or hogsheads).\r\n     Rye meal (in hogsheads).\r\nButter (in firkins).\r\nCheese, \"Hollands\" and English (in boxes).\r\nEggs, pickled (in tubs).\r\nFish, \"haberdyne\" [or salt dried cod] (in boxes).\r\nSmoked herring (in boxes).\r\nMeats, including,--\r\n     Beef, salt, or \"corned\" (in barrels).\r\n          Dry-salted (in barrels).\r\n          Smoked (in sacks).\r\n          Dried neats'-tongues (in boxes).\r\n     Pork, bacon, smoked (in sacks or boxes).\r\n          Salt [\" corned \"] (in barrels).\r\n          Hams and shoulders, smoked (in canvas sacks or hogsheads).\r\nSalt (in bags and barrels).\r\nVegetables, including,--\r\n     Beans (in bags and barrels).\r\n     Cabbages (in sacks and barrels).\r\n     Onions (in sacks).\r\n     Turnips (in sacks).\r\n     Parsnips (in sacks).\r\n     Pease (in barrels), and\r\nVinegar (in hogsheads), while,--\r\nBeer (in casks), brandy, \"aqua vitae\" (in pipes), and gin [\"Hollands,\"\r\n     \"strong waters,\" or \"schnapps\"] (in pipes) were no small or\r\n     unimportant part, from any point of view, of the provision supply.\r\n\r\nWinslow, in his letter to George Morton advising him as to his\r\npreparations for the voyage over, says: \"Be careful to have a very good\r\nbread-room to keep your biscuit in.\"  This was to keep them from\r\ndampness.  Winthrop gives us the memorandum of his order for the ship-\r\nbread for his voyage in 1630.  He says: \"Agreed with Keene of Southwark,\r\nbaker, for 20,000 of Biscuit, 15,000 of brown, and 5,000 of white.\"\r\nCaptain Beecher minutes: \"10 M. of bread for the ship ARBELLA.\"\r\nBeecher's memorandum of \"oatmeal\" is \"30 bushels.\"  Winslow mentions\r\n\"oatmeal,\" and Winthrop notes among the provisions bought by Captain\r\nWilliam Pierce, \"4 hhds. of oatmeal.\"  Rye meal was usually meant by the\r\nterm \"meal,\" and Window in his letter to George Morton advises him: \"Let\r\nyour meal be so hard-trod in your casks that you shall need an adz or\r\nhatchet to work it out with;\" and also to \"be careful to come by [be able\r\nto get at] some of your meal to spend [use] by the way.\"  Notwithstanding\r\nthat Bradford' speaks of their \"selling away\" some \"60 firkins of\r\nbutter,\" to clear port charges at Southampton, and the leaders, in their\r\nletter to the Adventurers from that port (August 3), speak of themselves,\r\nwhen leaving Southampton in August, 1620, as \"scarce having any butter,\"\r\nthere seems to have been some left to give as a present to Quadrequina,\r\nMassasoit's brother, the last of March following, which would indicate\r\nits good \"keeping\" qualities.  Wood, in his \"New England's Prospect\"\r\n(ch. 2), says: \"Their butter and cheese were corrupted.\"  Bradford\r\nmentions that their lunch on the exploration expedition of November 15,\r\non Cape Cod, included \"Hollands cheese,\" which receives also other\r\nmention.  There is a single mention, in the literature of the day, of\r\neggs preserved in salt, for use on shipboard.  \"Haberdyne\" (or dried salt\r\ncod) seems to have been a favorite and staple article of diet aboard\r\nship. Captain Beecher minutes \"600 haberdyne for the ship ARBELLA.\"\r\nWood says: \"Their fish was rotten.\"  Smoked \"red-herring\" were familiar\r\nfood to all the MAY-FLOWER company.  No house or ship of England or\r\nHolland in that day but made great dependence upon them.  Bacon was, of\r\ncourse, a main staple at sea.  In its half-cooked state as it came from\r\nthe smoke-house it was much relished with their biscuit by seamen and\r\nothers wishing strong food, and when fried it became a desirable article\r\nof food to all except the sick.  Mention is made of it by several of the\r\nearly Pilgrim writers.  Carlyle, as quoted, speaks of it as a diet-staple\r\non the MAY-FLOWER.  Salt (\"corned\") beef has always been a main article\r\nof food with seamen everywhere.  Wood' states that the \"beef\" of the\r\nPilgrims was \"tainted.\"  In some way it was made the basis of a reputedly\r\npalatable preparation called \"spiced beef,\" mentioned as prepared by one\r\nof the sailors for a shipmate dying on the MAY-FLOWER in Plymouth harbor.\r\nIt must have been a very different article from that we now find so\r\nacceptable under that name in England.  Winthrop' gives the price of his\r\nbeef at \"19 shillings per cwt.\"  Winslow advises his friend Morton, in\r\nthe letter so often quoted, not to have his beef \"dry-salted,\" saying,\r\n\"none can do it better than the sailors,\" which is a suggestion not\r\nreadily understood.  \"Smoked\" beef was practically the same as that known\r\nas \"jerked,\" \"smoked,\" or \"dried\" beef in America.  A \"dried neat's-\r\ntongue\" is named as a contribution of the Pilgrims to the dinner for\r\nCaptain Jones and his men on February 21, 1621, when they had helped to\r\ndraw up and mount the cannon upon the platform on the hill at Plymouth.\r\nWinthrop paid \"14d. a piece\" for his \"neats' tongues.\"  The pork of the\r\nPilgrims is also said by Wood' to have been \"tainted.\"  Winthrop states\r\nthat his pork cost \"20 pence the stone\" (14 lbs.).\r\n\r\nHams seem to have been then, as now, a highly-prized article of diet.\r\nGoodwin mentions that the salt used by the Pilgrims was (evaporated)\r\n\"sea-salt\" and very \"impure.\"  Winthrop mentions among his supplies,\r\n\"White, Spanish, and Bay salt.\"\r\n\r\nThe beans of the Pilgrims were probably of the variety then known as\r\n\"Spanish beans.\"  The cabbages were apparently boiled with meat, as\r\nnowadays, and also used considerably for \"sour-krout\" and for pickling,\r\nwith which the Leyden people had doubtless become familiar during their\r\nresidence among the Dutch.  As anti-scorbutics they were of much value.\r\nThe same was true of onions, whether pickled, salted, raw, or boiled.\r\nTurnips and parsnips find frequent mention in the early literature of the\r\nfirst settlers, and were among their stock vegetables.  Pease were\r\nevidently staple articles of food with the Plymouth people, and are\r\nfrequently named.  They probably were chiefly used for porridge and\r\npuddings, and were used in large quantities, both afloat and ashore.\r\n\r\nVinegar in hogsheads was named on the food-list of every ship of the\r\nPilgrim era.  It was one of their best antiscorbutics, and was of course\r\na prime factor in their use of \"sour krout,\" pickling, etc.  The fruits,\r\nnatural, dried, and preserved, were probably, in that day, in rather\r\nsmall supply. Apples, limes, lemons, prunes, olives, rice, etc., were\r\namong the luxuries of a voyage, while dried or preserved fruits and small\r\nfruits were not yet in common use. Winslow, in the letter cited, urges\r\nthat \"your casks for beer .  .  .  be iron bound, at least for the first\r\n[end] tyre\" [hoop].  Cushman states that they had ample supplies of beer\r\noffered them both in Kent and Amsterdam.  The planters' supply seems to\r\nhave failed, however, soon after the company landed, and they were\r\nobliged to rely upon the whim of the Captain of the MAY-FLOWER for their\r\nneeds, the ship's supply being apparently separate from that of the\r\nplanters, and lasting longer.  Winthrop's supply seems to have been large\r\n(\"42 tons\"--probably tuns intended). It was evidently a stipulation of\r\nthe charter-party that the ship should, in part at least, provision her\r\ncrew for the voyage,--certainly furnish their beer.  This is rendered\r\ncertain by Bradford's difficulty (as stated by himself) with Captain\r\nJones, previously referred to, showing that the ship had her own supply\r\nof beer, separate from that of the colonists, and that it was intended\r\nfor the seamen as well as the officers.\r\n\r\nBradford mentions \"aqua vitae\" as a constituent of their lunch on the\r\nexploring party of November 15.  \"Strong waters\" (or Holland gin) are\r\nmentioned as a part of the entertainment given Massasoit on his first\r\nvisit, and they find frequent mention otherwise.  Wine finds no mention.\r\nBradford states in terms: \"Neither ever had they any supply of foode from\r\nthem [the Adventurers] but what they first brought with them;\" and again,\r\n\"They never had any supply of vitales more afterwards (but what the Lord\r\ngave them otherwise), for all ye company [the Adventurers] sent at any\r\ntime was allways too short for those people yt came with it.\"\r\n\r\nThe clothing supplies of the Pilgrims included hats, caps, shirts, neck-\r\ncloths, jerkins, doublets, waistcoats, breeches (stuff and leather),\r\n\"hosen,\" stockings, shoes, boots, belts (girdles), cloth, piece-goods\r\n(dress-stuff's), \"haberdasherie,\" etc., etc., all of which, with minor\r\nitems for men's and women's use, find mention in their early narratives,\r\naccounts, and correspondence.  By the will of Mr. Mullens it appears that\r\nhe had twenty-one dozen of shoes and thirteen pairs of boots on board,\r\ndoubtless intended as medium of exchange or barter.  By the terms of the.\r\ncontract with the colonists, the Merchant Adventurers were to supply all\r\ntheir actual necessities of Clothing food, clothing, etc., for the full\r\nterm of seven years, during which the labors of the \"planters\" were to be\r\nfor the joint account.  Whether under this agreement they were bound to\r\nfully \"outfit\" the colonists before they embarked (and did so), as was\r\ndone by Higginson's company coming to Salem in 1628-29 at considerable\r\ncost per capita, and as was done for those of the Leyden people who came\r\nover in 1629 with Pierce in the MAY-FLOWER and the TALBOT to Salem, and\r\nagain in 1630 with the same Master (Pierce) in the LION by the Plymouth\r\nsuccessors to the Adventurers (without recompense), does not clearly\r\nappear.  No mention is found of any \"outfitting\" of the MAY-FLOWER\r\npassengers except the London apprentices.  There is no doubt that a\r\nconsiderable supply of all the above-named articles was necessarily sent\r\nby the Adventurers on the MAY-FLOWER, both for the Pilgrims' needs on the\r\nvoyage and in the new colony, as also for trading purposes.  There seems\r\nto have been at all times a supreme anxiety, on the part of both Pilgrim\r\nand Puritan settlers, to get English clothes upon their red brethren of\r\nthe forest, whether as a means of exchange for peltry, or for decency's\r\nsake, is not quite clear. There was apparently a greater disparity in\r\ncharacter, intelligence, and station between the leaders of Higginson's\r\nand Winthrop's companies and their followers than between the chief men\r\nof the Pilgrims and their associates.  With the former were titles and\r\nconsiderable representation of wealth and position.  With the passengers\r\nof the MAY-FLOWER a far greater equality in rank, means, intelligence,\r\ncapacity, and character was noticeable.  This was due in part, doubtless,\r\nto the religious beliefs and training of the Leyden contingent, and had\r\nprompt illustration in their Compact, in which all stood at once on an\r\nequal footing.  There was but little of the \"paternal\" nature in the form\r\nof their government (though something at times in their punishments), and\r\nthere was much personal dignity and independence of the indi vidual.\r\nAn equipment having so much of the character of a uniform--not to say\r\n\"livery \"--as that furnished by Higginson's company to its people\r\nsuggests the \"hedger and ditcher\" type of colonists (of whom there were\r\nvery few among the Plymouth settlers), rather than the scholar,\r\npublisher, tradesman, physician, hatter, smith, carpenter, \"lay reader,\"\r\nand soldier of the Pilgrims, and would certainly have been obnoxious to\r\ntheir finer sense of personal dignity and proportion.  Doubtless an\r\nequivalent provision existed--though in less \"all-of-a-pattern \"\r\ncharacter--in the bales and boxes of the MAY-FLOWER'S cargo for every\r\nneed suggested by the list of the Higginson \"outfit,\" which is given\r\nherewith, both as matter of interest and as affording an excellent idea\r\nof the accepted style and needs in dress of a New England settler (at\r\nleast of the men) of 1620-30.  One cannot fail to wonder at the\r\nnoticeably infrequent mention of provision in apparel, etc., for the\r\nwomen and children. The inventory of the \"Apparell for 100 men\" furnished\r\nby Higginson's company in 1628-29 gives us, among others, the following\r\nitems of clothing for each emigrant:--\r\n4 \"peares of shoes.\"\r\n4 \"peares of stockings.\"\r\n1 \"peare Norwich gaiters.\"\r\n4 \"shirts.\"\r\n2 \"suits dublet and hose of leather lyn'd with oyld skyn leather, ye hose\r\n     & dublett with hooks & eyes.\"\r\n1 \"sute of Norden dussens or hampshire kersies lynd the hose with skins,\r\ndublets with lynen of gilford or gedlyman kerseys.\"\r\n4  bands.\r\n2 handkerchiefs.\r\n1 \"wastecoat of greene cotton bound about with red tape.\"\r\n1 leather girdle.\r\n1 \"Monmouth cap.\"\r\n1 \"black hatt lyned in the brows with lether.\"\r\n5 \"Red knitt capps milf'd about 5d apiece.\"\r\n2 \"peares of gloves.\"\r\n1 \"Mandiliion lynd with cotton\" [mantle or greatcoat].\r\n1 \"peare of breeches and waistcoat.\"\r\n1 \"leather sute of Dublett & breeches of oyled leather.\"\r\n1 \"peare of leather breeches and drawers to weare with both there other\r\nsutes.\"\r\n\r\nIn 1628 Josselyn put the average cost of clothing to emigrants to New\r\nEngland at L4 each.  In 1629 good shoes cost the \"Bay\" colonists 2s\/7d\r\nper pair.  In his \"Two Voyages to New England \"previously referred to,\r\nJosselyn gives an estimate (made about 1628) of the \"outfit\" in clothing\r\nneeded by a New England settler of his time.  He names as \"Apparel for\r\none man--and after this rate for more:--\"\r\n          One Hatt\r\n          One Monmouth Cap\r\n          Three falling bands\r\n          Three Shirts\r\n          One Wastcoat\r\n          One Suite of Frize (Frieze)\r\n          One Suite of Cloth\r\n          One Suite of Canvas\r\n          Three Pairs of Irish Stockings\r\n          Four Pairs of Shoes\r\n          One Pair of Canvas Sheets\r\n          Seven ells of coarse canvas, to make a bed at sea for two men,\r\n               to be filled with straw\r\n          One Coarse Rug at Sea\r\n\r\nThe Furniture of the Pilgrims has naturally been matter of much interest\r\nto their descendants and others for many years.  While it is doubtful if\r\na single article now in existence can be positively identified and\r\ntruthfully certified as having made the memorable voyage in the MAY-\r\nFLOWER (nearly everything having, of course, gone to decay with the wear\r\nand tear of more than two hundred and fifty years), this honorable origin\r\nis still assigned to many heirlooms, to some probably correctly.  Dr.\r\nOliver Wendell Holmes in his delightful lines, \"On Lending a Punch Bowl,\"\r\nhumorously claims for his convivial silver vessel a place with the\r\nPilgrims:--\r\n\r\n         \"Along with all the furniture, to fill their new abodes,\r\n          To judge by what is still on hand, at least a hundred loads.\"\r\n\r\nTo a very few time-worn and venerated relics--such as Brewster's chair\r\nand one or more books, Myles Standish's Plymouth sword, the Peregrine\r\nWhite cradle, Winslow's pewter, and one or two of Bradford's books--a\r\nstrong probability attaches that they were in veritate, as traditionally\r\navowed, part of the MAY-FLOWER'S freight, but of even these the fact\r\ncannot be proven beyond the possibility of a doubt.\r\n\r\nFrom its pattern and workmanship, which are of a period antedating the\r\n\"departure from Delfshaven,\" and the ancient tradition which is traceable\r\nto Brewster's time, it appears altogether probable that what is known as\r\n\"Elder Brewster's chair\" came with him on the ship.  There is even\r\ngreater probability as to one of his books bearing his autograph.\r\n\r\nThe sword of Myles Standish, in possession of the Pilgrim Society, may\r\nclaim, with equal probability, MAY-FLOWER relation, from its evident\r\nantiquity and the facts that, as a soldier, his trusty blade doubtless\r\nstayed with him, and that it is directly traceable in his descendants'\r\nhands, back to his time; but an equally positive claim is made for\r\nsimilar honors for another sword said to have also belonged to the\r\nCaptain, now in the keeping of the Massachusetts Historical Society.\r\n\r\nThe Peregrine White cradle \"is strongly indorsed as of the MAY-FLOWER,\r\nfrom the facts that it is, indubitably, of a very early Dutch pattern and\r\nmanufacture; that Mrs. White was anticipating the early need of a cradle\r\nwhen leaving Holland; and that the descent of this one as an heirloom in\r\nher (second) family is so fairly traced.\"\r\n\r\nThe pewter and the silver flask of Winslow not only bear very early\r\n\"Hallmarks,\" but also the arms of his family, which it is not likely he\r\nwould have had engraved on what he may have bought after notably becoming\r\nthe defender of the simplicity and democracy of the \"Pilgrim Republic.\"\r\nLong traceable use in his family strengthens belief in the supposition\r\nthat these articles came with the Pilgrims, and were then very probably\r\nheirlooms. One of Governor Bradford's books (Pastor John Robinson's\r\n\"Justification of Separation\"), published in 1610, and containing the\r\nGovernor's autograph, bears almost 'prima facie' evidence of having come\r\nwith him in the MAY-FLOWER, but of course might, like the above-named\r\nrelics, have come in some later ship.\r\n\r\nIn this connection it is of interest to note what freight the MAY-FLOWER\r\ncarried for the intellectual needs of the Pilgrims.  Of Bibles, as the\r\n\"book of books,\" we may be sure--even without the evidence of the\r\ninventories of the early dead--there was no lack, and there is reason to\r\nbelieve that they existed in several tongues, viz. in English, Dutch, and\r\npossibly French (the Walloon contribution from the Huguenots), while\r\nthere is little doubt that, alike as publishers and as \"students of the\r\nWord,\" Brewster, Bradford, and Winslow, at least, were possessed of, and\r\nmore or less familiar with, both the Latin and Greek Testaments.  It is\r\naltogether probable, however, that Governor Bradford's well attested\r\nstudy of \"the oracles of God in the original\" Hebrew, and his possession\r\nof the essential Hebrew Bible, grammar, and lexicon, were of a later day.\r\nSome few copies of the earliest hymnals (\"psalme-bookes\")--then very\r\nlimited in number--there is evidence that the Holland voyagers had with\r\nthem in the singing of their parting hymns at Leyden and Delfshaven, as\r\nmentioned by Winslow and in the earlier inventories: These metrical\r\nversions of the Psalms constituted at the time, practically, the only\r\nhymnology permitted in the worship of the \"Separatists,\" though the grand\r\nhymn of Luther, \"Ein feste Burg ist unser Gott,\" doubtless familiar to\r\nthem, must have commended itself as especially comforting and apposite.\r\n\r\nOf the doctrinal tracts of their beloved Pastor, John Robinson, there is\r\nevery probability, as well as some proof, that there was good supply, as\r\nwell as those of Ainsworth and Clyfton and of the works of William Ames,\r\nthe renowned Franeker Professor, the controversial opponent but sincere\r\nfriend of Robinson: the founder of evangelical \"systematic theology,\"\r\n[method--Methodist?  D.W.] whom death alone prevented from becoming the\r\nPresident of Harvard College.  We may be equally sure that the few cases\r\nof books in the freight of the Pilgrim ship included copies of the\r\npublications of the \"hidden and hunted press\" of Brewster and Brewer, and\r\nsome at least of the issues of their fellows in tribulation at Amsterdam\r\nand in Scotland and England.  Some few heavy tomes and early classics in\r\nEnglish, Dutch, Latin, and Greek were also presumably among the goodly\r\nnumber of books brought in the MAY FLOWER by Brewster, Bradford, Winslow,\r\nFuller, Hopkins, Allerton, Standish, and others, though it is probable\r\nthat the larger part of the very considerable library of four hundred\r\nvolumes, left at his death by Brewster (including sixty-two in Latin),\r\nand of the respectable libraries of Fuller, Standish, and others, named\r\nin their respective inventories, either were brought over in the later\r\nships, or were the products of the earliest printers of New England.  One\r\nis surprised and amused that the library of the good Dr. Fuller should\r\ncontain so relatively small a proportion of medical works (although the\r\nnumber in print prior to his death in 1633 was not great), while rich in\r\nreligious works pertinent to his functions as deacon.  It is equally\r\ninteresting to note that the inventory of the soldier Standish should\r\nname only one book on military science, \"Bariffe's Artillery,\" though it\r\nincludes abundant evidence to controvert, beyond reasonable doubt, the\r\nsuggestion which has been made, that he was of the Romanist faith.  Just\r\nwhich of the books left by the worthies named, and others whose\r\ninventories we possess, came with them in the Pilgrim ship, cannot be\r\ncertainly determined, though, as before noted, some still in existence\r\nbear intrinsic testimony that they were of the number. There is evidence\r\nthat Allerton made gift of a book to Giles Heale of the MAY-FLOWER\r\n(perhaps the ship's surgeon), while the ship lay at Plymouth, and Francis\r\nCooke's inventory includes \"1 great Bible and 4 olde bookes,\" which as\r\nthey were \"olde,\" and he was clearly not a book-buyer, very probably came\r\nwith him in the ship.  In fact, hardly an adult of the Leyden colonists,\r\nthe inventory of whose estate at death we possess, but left one or more\r\nbooks which may have been his companions on the voyage.\r\n\r\nSome of the early forms of British and Dutch calendars, \"annuals,\" and\r\nagricultural \"hand-books,\" it is certain were brought over by several\r\nfamilies, and were doubtless much consulted and well-thumbed \"guides,\r\ncounsellors, and friends\" in the households of their possessors.  The\r\ngreat preponderance of reading matter brought by the little colony was,\r\nhowever, unquestionably of the religious controversial order, which had\r\nbeen so much a part of their lives, and its sum total was considerable.\r\nThere are intimations, in the inventories of the Fathers, of a few works\r\nof historical cast, but of these not many had yet been printed.\r\n\"Caesar's Commentaries,\" a \"History of the World,\" and a \"History of\r\nTurkey\" on Standish's shelves, with the two Dictionaries and \"Peter\r\nMartyr on Rome\" on Dr. Fuller's, were as likely to have come in the first\r\nship, and to have afforded as much satisfaction to the hungry readers of\r\nthe little community as any of the books we find named in the lists of\r\ntheir little stock. It is pathetic to note, in these days of utmost\r\nprodigality in juvenile literature, that for the Pilgrim children, aside\r\nfrom the \"Bible stories,\" some of the wonderful and mirth-provoking\r\nmetrical renderings of the \"Psalme booke,\" and the \"horne booke,\" or\r\nprimer (the alphabet and certain elementary contributions in verse or\r\nprose, placed between thin covers of transparent horn for protection),\r\nthere was almost absolutely nothing in the meagre book-freight of the\r\nPilgrim ark.  \"Milk for Babes,\" whether as physical or mental pabulum,\r\nwas in poor supply aboard the MAY-FLOWER.\r\n\r\nThe most that can be claimed with confidence, for particular objects of\r\nalleged MAY-FLOWER relation, is that there is logical and moral certainty\r\nthat there was a supply of just such things on board, because they were\r\nindispensable, and because every known circumstance and condition\r\nindicates their presence in the hands to which they are assigned, while\r\ntradition and collateral evidence confirm the inference and sometimes go\r\nvery far to establish their alleged identity, and their presence with\r\ntheir respective owners upon the ship. A few other articles besides those\r\nenumerated in possession of the Pilgrim Society, and of other societies\r\nand individuals, present almost equally strong claims with those named,\r\nto be counted as \"of MAY-FLOWER belonging,\" but in no case is the\r\nconnection entirely beyond question.  Where so competent, interested, and\r\nconscientious students of Pilgrim history as Hon. William T. Davis, of\r\nPlymouth, and the late Dr. Thomas B. Drew, so long the curator of the\r\nPilgrim Society, cannot find warrant for a positive claim in behalf of\r\nany article as having come, beyond a doubt, \"in the MAY FLOWER,\" others\r\nmay well hesitate to insist upon that which, however probable and\r\ndesirable, is not susceptible of conclusive proof.\r\n\r\nThat certain articles of household furniture, whether now existent or\r\nnot, were included in the ship's cargo, is attested by the inventories of\r\nthe small estates of those first deceased, and, by mention or\r\nimplication, in the narratives of Bradford, Winslow, Morton, and other\r\ncontemporaries, as were also many utensils and articles of domestic use.\r\nThere were also beyond question many not so mentioned, which may be\r\nsafely named as having very certainly been comprised in the ship's\r\nlading, either because in themselves indispensable to the colonists, or\r\nbecause from the evidence in hand we know them to have been inseparable\r\nfrom the character, social status, daily habits, home life, or\r\nascertained deeds of the Pilgrims.  When it is remembered that\r\nfurnishings, however simple, were speedily required for no less than\r\nnineteen \"cottages\" and their households, the sum total called for was not\r\ninconsiderable.\r\n\r\n     [Bradford, in Mourt's Relation (p. 68), shows that the colonists\r\n     were divided up into \"nineteen families,\" that \"so we might build\r\n     fewer houses.\"  Winslow, writing to George Morton, December 11\/21,\r\n     1621, says: \"We have built seven dwelling-houses and four for the\r\n     use of the plantation.\"  Bradford (Historie, Mass.  ed.  p. 110)\r\n     calls the houses \"small cottages.\"]\r\n\r\nAmong the furniture for these \"cottages\" brought on the Pilgrim ship may\r\nbe enumerated: chairs, table-chairs, stools and forms (benches), tables\r\nof several sizes and shapes (mostly small), table-boards and \"cloathes,\"\r\ntrestles, beds; bedding and bed-clothing, cradles, \"buffets,\" cupboards\r\nand \"cabinets,\" chests and chests of drawers, boxes of several kinds and\r\n\"trunks,\" andirons, \"iron dogs,\" \"cob-irons,\" fire-tongs and \"slices\"\r\n(shovels), cushions, rugs, and \"blanckets,\" spinning wheels, hand-looms,\r\netc., etc.  Among household utensils were \"spits,\" \"bake-kettles,\" pots\r\nand kettles (iron, brass, and copper), frying-pans, \"mortars\" and pestles\r\n(iron, brass, and \"belle-mettle\"), sconces, lamps (oil \"bettys\"),\r\ncandlesticks, snuffers, buckets, tubs, \"runlets,\" pails and baskets,\r\n\"steel yards,\" measures, hour-glasses and sun-dials, pewter-ware\r\n(platters, plates, mugs, porringers, etc.), wooden trenchers, trays,\r\n\"noggins,\" \"bottles,\" cups, and \"lossets.\"  Earthen ware, \"fatten\" ware\r\n(mugs, \"jugs,\" and \"crocks \"), leather ware (bottles, \"noggins,\" and\r\ncups), table-ware (salt \"sellars,\" spoons, knives, etc), etc.  All of the\r\nforegoing, with numerous lesser articles, have received mention in the\r\nearly literature of the Pilgrim exodus, and were undeniably part of the\r\nMAY-FLOWER'S lading.\r\n\r\nThe MAY-FLOWER origin claimed for the \"Governor Carver chair\" and the\r\n\"Elder Brewster chair\" rests wholly upon tradition, and upon the\r\nvenerable pattern and aspect of the chairs themselves.  The \"Winslow\r\nchair,\" in possession of the Pilgrim Society at Plymouth (Mass.), though\r\nbearing evidence of having been \"made in Cheapside, London, in 1614,\" is\r\nnot positively known to have been brought on the MAY-FLOWER.  Thacher's\r\n\"History of Plymouth\" (p. 144.) states that \"a sitting-chair, said to\r\nhave been screwed to the floor of the MAY-FLOWER'S cabin for the\r\nconvenience of a lady, is known to have been in the possession of\r\nPenelope Winslow (who married James Warren), and is now in possession of\r\nHannah White.\"  There are certain venerable chairs alleged, with some\r\nshow of probability, to have been the property of Captain Standish, now\r\nowned in Bridgewater, but there is no record attached to them, and they\r\nare not surely assignable to either ship or owner.  That some few tables\r\n--mostly small--were brought in the MAY-FLOWER, there is some evidence,\r\nbut the indications are that what were known as \"table-boards\"--long and\r\nnarrow boards covered with what were called \"board-cloths\"--very largely\r\ntook the place of tables.  The walnut-top table, said to have once been\r\nGovernor Winslow's and now in possession of the Pilgrim Society, is not\r\nknown to have come over with him, and probably did not.  It was very\r\nlikely bought for the use of the Council when he was governor.  The\r\n\"table-boards\" mentioned were laid on \"trestles\" (cross-legged and folding\r\nsupports of proper height), which had the great merit that they could be\r\nplaced in any convenient spot and as easily folded up, and with the board\r\nput away, leaving the space which a table would have permanently occupied\r\nfree for other use.\r\n\r\nBradford mentions that when the fire of Sunday, January 14., 1621,\r\noccurred in the \"common house,\" the \"house was as full of beds as they\r\ncould lie one by another.\"  There is a doubt, however, whether this\r\nindicates bedsteads or (probably) \"pallets\" only.  Beds, bedding of all\r\nsorts, pillow-\"beers,\" pillow-cases and even \"mattrises,\" are of most\r\nfrequent mention in the earliest wills and inventories.  (See Appendix.)\r\n\"Buffets,\" \"cupboards,\" and \"cabinets,\" all find mention in the earliest\r\nwriters and inventories, and one or two specimens, for which a MAY-FLOWER\r\nhistory is claimed, are in possession of the Pilgrim Society and others.\r\nThe \"White\" cabinet, of putative MAY-FLOWER connection, owned by the\r\nPilgrim Society, is a fine example of its class, and both its \"ear marks\"\r\nand its known history support the probable truth of the claim made for\r\nit.  Of \"chests\" and \"chests-of-drawers\" there were doubtless goodly\r\nnumbers in the ship, but with the exception of a few chests (or the\r\nfragments of them), for which a MAY-FLOWER passage is vaunted, little is\r\nknown of them.  The chest claimed to be that of Elder Brewster, owned by\r\nthe Connecticut Historical Society, was not improb ably his, but that it\r\nhad any MAY-FLOWER relation is not shown.  A fragment of a chest claimed\r\nto have been \"brought by Edward Winslow in the MAY-FLOWER\" is owned by\r\nthe Pilgrim Society, and bears considerable evidence of the probable\r\nvalidity of such claim, but proof positive is lacking.  Boxes of several\r\nkinds and sizes were part of the Pilgrims' chattels on their ship, some\r\nof them taking the place of the travellers' \"trunks\" of to-day, though\r\n\"trunks\" were then known by that name and find early mention in Pilgrim\r\ninventories, and there were no doubt some upon the Pilgrim ship.  A few\r\nclaiming such distinction are exhibited, but without attested records of\r\ntheir origin.\r\n\r\n\"Andirons, fire-dogs, and cob-irons\" (the latter to rest roasting spits\r\nupon) were enumerated among the effects of those early deceased among the\r\nPilgrims, rendering it well-certain that they must have been part of\r\ntheir belongings on the MAY-FLOWER.  Fire-tongs and \"slices\" [shovels]\r\nare also frequently mentioned in early Pilgrim inventories, placing them\r\nin the same category with the \"andirons and fire-dogs.\"\r\n\r\nIn \"Mourt's Relation,\" in the accounts given of the state reception of\r\nMassasoit, \"a green rug and three or four cushions\" are shown to have\r\nperformed their parts in the official ceremonies, and were, of course,\r\nnecessarily brought in the MAY-FLOWER.\r\n\r\nSpinning-wheels and hand-looms were such absolute necessities, and were\r\nso familiar and omnipresent features of the lives and labors of the\r\nPilgrim housewives and their Dutch neighbors of Leyden, that we should be\r\ncertain that they came with the Pilgrims, even if they did not find\r\nmention in the earliest Pilgrim inventories.  Many ancient ones are\r\nexhibited in the \"Old Colony,\" but it is not known that it is claimed for\r\nany of them that they came in the first ship. It is probable that some of\r\nthe \"cheese fatts\" and churns so often named in early inventories came in\r\nthe ship, though at first there was, in the absence of milch kine, no\r\nsuch use for them as there had been in both England and Holland, and soon\r\nwas in New England.\r\n\r\nAmong cooking utensils the roasting \"spit\" was, in one form or another,\r\namong the earliest devices for cooking flesh, and as such was an\r\nessential of every household.  Those brought by the Plymouth settlers\r\nwere probably, as indicated by the oldest specimens that remain to us, of\r\na pretty primitive type.  The ancient \"bake-kettle\" (sometimes called\r\n\"pan\"), made to bury in the ashes and thus to heat above and below, has\r\nnever been superseded where resort must be had to the open fire for\r\ncooking, and (practically unchanged) is in use to-day at many a sheep-\r\nherder's and cowboy's camp fire of the Far West.  We may be sure that it\r\nwas in every MAY-FLOWER family, and occasional ancient specimens are yet\r\nto be found in \"Old Colony\" garrets.  Pots and kettles of all sorts find\r\nmore frequent mention in the early inventories than anything else, except\r\nmuskets and swords, and were probably more numerous upon the ship than\r\nany other cooking utensil.  A few claimed to be from the Pilgrim ship are\r\nexhibited, chief of which is a large iron pot, said to have been \"brought\r\nby Myles Standish in the MAY-FLOWER,\" now owned by the Pilgrim Society.\r\n\r\nHardly an early Pilgrim inventory but includes \"a mortar and pestle,\"\r\nsometimes of iron, sometimes of \"brass\" or \"belle-mettle\" (bell metal).\r\nThey were of course, in the absence of mills, and for some purposes for\r\nwhich small hand mills were not adapted, prime necessities, and every\r\nhouse hold had one.  A very fine one of brass (with an iron pestle), nine\r\nand a half inches across its bell-shaped top,--exhibited by the Pilgrim\r\nSociety, and said to have been \"brought in the MAY-FLOWER by Edward\r\nWinslow,\"--seems to the author as likely to have been so as almost any\r\narticle for which that distinction is claimed.\r\n\r\nThe lighting facilities of the Pilgrims were fewer and cruder than those\r\nfor cooking.  They possessed the lamp of the ancient Romans, Greeks, and\r\nHebrews, with but few improvements,--a more or less fanciful vessel for\r\noil, with a protuberant nose for a wick, and a loose-twisted cotton wick.\r\nHand-lamps of this general form and of various devices, called \"betty-\r\nlamps,\" were commonly used, with candlesticks of various metals,--iron,\r\nbrass, silver, and copper,--though but few of any other ware.  For wall-\r\nlighting two or more candle sockets were brought together in \"sconces,\"\r\nwhich were more or less elaborate in design and finish.  One of the early\r\nwriters (Higginson) mentions the abundance of oil (from fish) available\r\nfor lamps, but all tallow and suet used by the early colonists was, for\r\nsome years (till cattle became plentiful), necessarily imported.  Some of\r\nthe \"candle-snuffers\" of the \"first comers\" doubtless still remain.  We\r\nmay be sure every family had its candles, \"betty-lamps,\" candlesticks,\r\nand \"snuffers.\"  \"Lanthorns\" were of the primitive, perforated tin\r\nvariety--only \"serving to make darkness visible\" now found in a few old\r\nattics in Pilgrim towns, and on the \"bull-carts\" of the peons of Porto\r\nRico, by night.  Fire, for any purpose, was chiefly procured by the use\r\nof flint, steel, and tinder, of which many very early specimens exist.\r\nBuckets, tubs, and pails were, beyond question, numerous aboard the ship,\r\nand were among the most essential and highly valued of Pilgrim utensils.\r\nMost, if not all of them, we may confidently assert, were brought into\r\nrequisition on that Monday \"wash-day\" at Cape Cod, the first week-day\r\nafter their arrival, when the women went ashore to do their long-\r\nneglected laundrying, in the comparatively fresh water of the beach pond\r\nat Cape Cod harbor.  They are frequently named in the earliest\r\ninventories.  Bradford also mentions the filling of a \"runlet\" with water\r\nat the Cape. The \"steel-yards\" and \"measures\" were the only determiners\r\nof weight and quantity--as the hour-glass and sun dial were of time--\r\npossessed at first (so far as appears) by the passengers of the Pilgrim\r\nship, though it is barely possible that a Dutch clock or two may have\r\nbeen among the possessions of the wealthiest.  Clocks and watches were\r\nnot yet in common use (though the former were known in England from 1540),\r\nand except that in \"Mourt's Relation\" and Bradford's \"Historie\" mention\r\nis made of the time of day as such \"o'clock\" (indicating some degree of\r\nfamiliarity with clocks), no mention is made of their possession at the\r\nfirst.  Certain of the leaders were apparently acquainted at Leyden with\r\nthe astronomer Galileo, co-resident with them there, and through this\r\nacquaintance some of the wealthier and more scholarly may have come to\r\nknow, and even to own, one of the earliest Dutch clocks made with the\r\npendulum invented by Galileo, though hardly probable as early as 1620.\r\nPocket watches were yet practically unknown.\r\n\r\nExcept for a few pieces of silver owned by the wealthiest of their\r\nnumber, pewter was the most elegant and expensive of the Pilgrims' table-\r\nware.  A pewter platter said to have been \"brought over in the MAY-\r\nFLOWER\" is now owned by the Pilgrim Society, which also exhibits smaller\r\npewter formerly Edward Winslow's, and bearing his \"arms,\" for which, as\r\npreviously noted, a like claim is made.  Platters, dishes, \"potts,\"\r\nladles, bottles, \"flaggons,\" \"skelletts,\" cups, porringers, \"basons,\"\r\nspoons, candlesticks, and salt \"sellars,\" were among the many pewter\r\nutensils unmistakably brought on the good ship.\r\n\r\nThe wooden-ware of the colonists, brought with them, was\r\nconsiderable and various.  The Dutch were long famous for its\r\nfabrication.  There was but very little china, glass, or pottery of any\r\nkind in common use in western Europe in 1620; some kinds were not yet\r\nmade, and pewter, wood, and leather largely filled their places.  Wooden\r\ntrenchers (taking the place of plates), trays, \"noggins\" (jug or pitcher-\r\nlike cups), cups, and \"lossets\" (flat dishes like the bread-plates of to\r\nday), were of course part of every housewife's providings.  Some few of\r\nPilgrim origin possibly still exist.  As neither coffee, tea, nor china\r\nhad come into use, the cups and saucers which another century brought in\r\n--to delight their owners in that day and the ceramic hunter in this--\r\nwere not among the \"breakables\" of the \"good-wife\" of the MAY-FLOWER.\r\nThe \"table-plenishings\" had not much variety, but in the aggregate the\r\n(first) \"nineteen families\" must have required quite a quantity of\r\nspoons, knives, salt \"sellars,\" etc.  Forks there were none, and of the\r\naccessories of to-day (except napkins), very few.  Meat was held by the\r\nnapkin while being cut with the knife.  Josselyn' gives a list of\r\n\"Implements for a family of six persons\" going to New England.\r\n\r\nKitchen utensils:--\r\n              \"1 Iron Pot.\r\n               1 Great Copper Kettle.\r\n               1 Small Kettle.\r\n               1 Lesser Kettle.\r\n               1 Large Frying pan.\r\n               1 Brass Mortar.\r\n               1 Spit.\r\n               1 Gridiron.\r\n               2 Skillets.\r\n               Platters, dishes, and spoons of wood.\r\n               A pair of Bellows.\r\n               A Skoope, etc.\"\r\n\r\nAmong the implements of husbandry, etc., and mechanics' tools we find\r\nevidence of hoes, spades, shovels, scythes, \"sikles,\" mattocks, bill-\r\nhooks, garden-rakes, hay-forks (\"pitch-forks\"), besides seed-grain and\r\ngarden seeds.  Axes, saws, hammers, \"adzs,\" augers, chisels, gouges,\r\nsquares, hatchets, an \"iron jack-scrue,\" \"holdfasts\" (vises),\r\nblacksmiths' tools, coopers' tools, iron and steel in bar, anvils,\r\nchains, etc., \"staples and locks,\" rope, lime (for mortar), nails, etc.,\r\nare also known to have been in the ship.  Francis Eaton, the carpenter,\r\nseems to have had a very respectable \"kit,\" and Fletcher, the smith, was\r\nevidently fairly \"outfitted.\"\r\n\r\nThe implements of husbandry were of the lighter (?) sort; no ploughs,\r\nharrows, carts, harness, stone-drags, or other farming tools requiring\r\nthe strength of beasts for their use, were included.  In nothing could\r\nthey have experienced so sharp a contrast as in the absence of horses,\r\ncattle, and sheep in their husbandry, and especially of milch kine.\r\nBradford and Window both mention hoes, spades, mattocks, and sickles,\r\nwhile shovels, scythes, bill-hooks (brush-scythes, the terrible weapons\r\nof the English peasantry in their great \"Mon mouth\" and earlier\r\nuprisings), pitchforks, etc., find very early mention in inventories and\r\ncolonial records.  Josselyn, in his \"Two Voyages to New England,\" gives,\r\nin 1628, the following very pertinent list of \"Tools for a Family of six\r\npersons, and so after this rate for more,--intending for New England.\"\r\nThis may be taken as fairly approximating the possessions of the average\r\nMAY-FLOWER planter, though probably somewhat exceeding individual\r\nsupplies.  Eight years of the Pilgrims' experience had taught those who\r\ncame after them very much that was of service.\r\n\r\n5 Broad Howes [hoes].\r\n6 Chisels.\r\n5 Narrow Howes [hoes].\r\n3 Gimblets.\r\n5 Felling Axes.\r\n2 hatchets.\r\n2 steel hand saws.\r\n2 frones (?) to cleave pail! (Probably knives for cleaving pail stock.)\r\n2 hand saws.\r\n2 hand-bills.\r\n1 whip saw, set and files with box.\r\nNails of all sorts.\r\n2 Pick-axes.\r\nA file and rest.\r\n3 Locks and 3 paire fetters.\r\n2 Hammers.\r\n2 Currie Combs.\r\n3 Shovels.\r\nBrands for beasts.\r\n2 Spades.\r\nA hand vice.\r\n2 Augers.\r\nA pitchfork, etc.\r\n2 Broad Axes.\r\n\r\nUnhappily we know little from contemporaneous authority as to what grain\r\nand other seeds the Pilgrims brought with them for planting.  We may be\r\nsure, however, that rye, barley, oats, wheat, pease, and beans were the\r\nbulkiest of this part of their freight, though Bradford mentions the\r\nplanting of \"garden seeds\" their first spring.\r\n\r\nWhile we know from the earliest Pilgrim chronicles that their mechanics'\r\nimplements embraced axes, saws, hammers, \"adzs,\" augers, hatchets, an\r\n\"iron jack-scrue,\" \"staples and locks,\" etc., we know there must have\r\nbeen many other tools not mentioned by them, brought over with the\r\nsettlers.  The \"great iron-scrue,\" as Bradford calls it in his original\r\nMS., played, as all know, a most important part on the voyage, in forcing\r\nthe \"cracked and bowed\" deck-beam of the ship into place.  Governor\r\nBradford tells us that \"it was brought on board by one of the Leyden\r\npassengers,\" and one may hazard the guess that it was by either Moses\r\nFletcher, the smith, or Francis Eaton, the \"carpenter.\"  \"Staples\" and\r\n\"locks\" found their place and mention, as well as the \"chains,\"\r\n\"manacles,\" and \"leg-irons\" named in the list of accoutrements for\r\noffence or defence, when it became necessary to chain up the Indian spy\r\nof the Neponsets (as narrated by Winslow in his \"Good Newes from New\r\nEngland\") and other evil-doers.  The planters seem to have made stiff\r\n\"mortar,\" which premises the use of lime and indicates a supply.\r\n\r\nAmong the fishing and fowling implements of the MAY FLOWER colonists are\r\nrecorded, nets, \"seynes,\" twine, fish hooks, muskets (for large game),\r\n\"fowling pieces,\" powder, \"goose-shot,\" \"hail-shot,\" etc.\r\n\r\nSuch early mention is found of the nets, \"seynes,\" etc., of their fishing\r\nequipment, as to leave no room for doubt that store of them was brought\r\nin the ship.  They seem to have been unfortunate in the size of their\r\nfish-hooks, which are spoken of as \"too large\" even for cod.  They must,\r\nas Goodwin remarks, \"have been very large.\"  Window also says, \"We wanted\r\nfit and strong seines and other netting.\"\r\n\r\nThey seem to have relied upon their muskets to some extent for wild fowl\r\n(as witness Winslow's long and successful shot at a duck, on his visit to\r\nMassasoit), as they undoubtedly did for deer, etc.  They were apparently\r\nfairly well supplied with them, of either the \"matchlock\" or \"snaphance\"\r\n(flintlock) pattern, though the planters complained to the Merchant\r\nAdventurers (in their letter of August 3, from Southampton), that they\r\nwere \"wanting many muskets,\" etc.  That they had some \"fowling-pieces\" is\r\nshown by the fact that young Billington seems (according to Bradford) to\r\nhave \"shot one off in his father's cabin\" aboard ship in Cape Cod harbor,\r\nand there are several other coeval mentions of them.\r\n\r\nThe arms and accoutrements (besides ordnance) of the MAY-FLOWER Pilgrims,\r\nknown on the authority of Bradford and Winslow to have been brought by\r\nthem, included muskets (\"matchlocks\"), \"snaphances\" (flintlocks), armor\r\n(\"corslets,\" \"cuirasses,\" \"helmets,\" \"bandoliers,\" etc.), swords,\r\n\"curtlaxes\" (cutlasses), \"daggers,\" powder, \"mould-shot,\" \"match\" (slow-\r\nmatch for guns), \"flints,\" belts, \"knapsacks,\" \"drum,\" \"trumpet,\"\r\n\"manacles,\" \"leg-irons,\" etc., etc.  \"Pistols\" (brass) appear in early\r\ninventories, but their absence in the early hand-to-hand encounter at\r\nWessagussett indicates that none were then available, or that they were\r\nnot trusted. It is evident from the statement of Bradford that every one\r\nof the sixteen men who went out (under command of Standish) on the \"first\r\nexploration\" at Cape Cod had his \"musket, sword,, and corslet;\" that they\r\nrelied much on their armor, and hence, doubtless, took all possible with\r\nthem on the ship.  They probably did not long retain its use.  In the\r\nletter written to the Adventurers from Southampton, the leaders complain\r\nof \"wanting many muskets, much armour, &c.\"\r\n\r\nJosselyn gives' the equipment he considers necessary for each man going\r\nto New England to settle:--\r\n\r\n\"Armor compleat:--\r\n     One long piece [musket] five feet or five and a half long.\r\n     One Sword.\r\n     One bandoleer.\r\n     One belt.\r\n     Twenty pounds of powder.\r\n     Sixty pounds of shot or lead, pistol and Goose-shot.\"\r\n\r\n\"Another list gives an idea of 'complete armor.'\"\r\n     Corselet\r\n     Breast [plate or piece].\r\n     Back [ditto].\r\n     Culet (?).\r\n     Gorget [throat-piece].\r\n     Tussis [thigh-pieces].\r\n     Head-piece \"[morion skull-cap].\"\r\n\r\nBradford states that they used their \"curtlaxes\" (cutlasses) to dig the\r\nfrozen ground to get at the Indians' corn, \"having forgotten to bring\r\nspade or mattock.\"  \"Daggers\" are mentioned as used in their celebrated\r\nduel by Dotey and Leister, servants of Stephen Hopkins.  Bradford\r\nnarrates that on one of their exploring tours on the Cape the length of\r\nguard duty performed at night by each \"relief\" was determined by the\r\ninches of slow-match burned (\"every one standing when his turn came\r\nwhile five or six inches of match was burning\"), clearly indicating that\r\nthey had no watches with them.  The \"drum\" and \"trumpet\" are both\r\nmentioned in \"Mourt's Relation\" in the account given of Massasoit's\r\nreception, the latter as eliciting the especial attention of his men, and\r\ntheir efforts at blowing it.\r\n\r\nThe Ordnance (cannon) brought in the ship consisted (probably) of ten\r\nguns, certainly of six.  Of these, two (2) were \"sakers,\"--guns ten feet\r\nlong of 3 to 4 inches bore, weighing from fifteen to eighteen hundred\r\npounds each; two (2) were \"minions\" (or \"falcons\"),--guns of 3 1\/2 inch\r\nbore, weighing twelve hundred pounds (1200 lbs.) each; and two (2) were\r\n\"bases,\"--small guns of 1 1\/4 inch bore, weighing some three hundred\r\npounds (300 1bs.) each.  These were mounted on \"the Hill\" fort or\r\nplatform.  It is probable that besides these were the four smallest\r\ncannon, called \"patereros\" (or \"murderers\"), which, at the time of De\r\nRasiere's visit to Plymouth in 1627, were mounted on a platform (in front\r\nof the Governor's house), at the intersection of the two streets of the\r\ntown, and commanded its several approaches.  It is not likely that they\r\nwere sent for after 1621, because the Adventurers were never in mood to\r\nsend if asked, while Bradford, in speaking of the first alarm by the\r\nIndians, says, \"This caused us to plant our great ordnance in places most\r\nconvenient,\" leaving a possible inference that they had smaller ordnance\r\nin reserve.  With this ordnance was of course a proper supply of\r\nammunition adapted to its use.  The \"sakers\" are said to have carried a\r\nfour-pound ball, the \"minions\" a three-pound ball, and the \"bases\" a ball\r\nof a pound weight.  There is not entire agreement between authorities, in\r\nregard to the size, weight, and calibre of these different classes of\r\nearly ordnance, or the weight of metal thrown by them, but the above are\r\napproximate data, gathered from careful comparison of the figures given\r\nby several.  There is no doubt that with this heavy ordnance and\r\nammunition they stowed among their ballast and dunnage (as was the case\r\nin Higginson's ships), their \"spare chains and anchors, chalk, bricks,\r\nsea-coal (for blacksmithing), iron, steel, lead, copper, red-lead, salt,\"\r\netc.; all of which they also necessarily had, and from their bulk,\r\ncharacter, and weight, would stow as low in the ship as might be.\r\n\r\nThat a considerable \"stock of trading goods\" was included in the MAY-\r\nFLOWER'S lading is mentioned by at least one writer, and that this was a\r\nfact is confirmed by the records of the colonists' dealings with the\r\nIndians, and the enumeration of not a few of the goods which could have\r\nhad, for the most part, no other use or value.  They consisted largely of\r\nknives, bracelets (bead and metal), rings, scissors, copper-chains,\r\nbeads, \"blue and red trading cloth,\" cheap (glass) jewels (\"for the\r\nears,\" etc.), small mirrors, clothing (e. g. \"red-cotton horseman's\r\ncoats--laced,\" jerkins, blankets, etc.), shoes, \"strong waters,\" pipes,\r\ntobacco, tools and hard ware (hatchets, nails, hoes, fish-hooks, etc.),\r\nrugs, twine, nets, etc., etc.  A fragment of one of the heavy hoes of the\r\nancient pattern --\"found on the site of the Pilgrim trading house at\r\nManomet \"--is owned by the Pilgrim Society, and speaks volumes of the\r\nlabor performed by the Pilgrims, before they had ploughs and draught-\r\ncattle, in the raising of their wonderful crops of corn. Such was the\r\nMAY-FLOWER'S burden, animate and inanimate, when--the last passenger and\r\nthe last piece of freight transferred from the SPEEDWELL--her anchor\r\n\"hove short,\" she swung with the tide in Plymouth roadstead, ready to\r\ndepart at last for \"the Virginia plantations.\"\r\n\r\n\r\n\r\n\r\nETEXT EDITOR'S BOOKMARKS:\r\n\r\nAnxiety to get English clothes upon their red brethren\r\nForks there were none\r\nLanterns--only \"serving to make darkness visible\"\r\nMeat was held by the napkin while being cut with the knife\r\n\r\n\r\n\r\n\r\n\r\n\r\n*** END OF THE PROJECT GUTENBERG EBOOK THE MAYFLOWER AND HER LOG; JULY 15, 1620-MAY 6, 1621 — VOLUME 5 ***\r\n\r\n\r\n    \r\n\r\nUpdated editions will replace the previous one—the old editions will\r\nbe renamed.\r\n\r\nCreating the works from print editions not protected by U.S. copyright\r\nlaw means that no one owns a United States copyright in these works,\r\nso the Foundation (and you!) can copy and distribute it in the United\r\nStates without permission and without paying copyright\r\nroyalties. Special rules, set forth in the General Terms of Use part\r\nof this license, apply to copying and distributing Project\r\nGutenberg™ electronic works to protect the PROJECT GUTENBERG™\r\nconcept and trademark. Project Gutenberg is a registered trademark,\r\nand may not be used if you charge for an eBook, except by following\r\nthe terms of the trademark license, including paying royalties for use\r\nof the Project Gutenberg trademark. If you do not charge anything for\r\ncopies of this eBook, complying with the trademark license is very\r\neasy. You may use this eBook for nearly any purpose such as creation\r\nof derivative works, reports, performances and research. Project\r\nGutenberg eBooks may be modified and printed and given away—you may\r\ndo practically ANYTHING in the United States with eBooks not protected\r\nby U.S. copyright law. Redistribution is subject to the trademark\r\nlicense, especially commercial redistribution.\r\n\r\n\r\nSTART: FULL LICENSE\r\n\r\nTHE FULL PROJECT GUTENBERG LICENSE\r\n\r\nPLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK\r\n\r\nTo protect the Project Gutenberg™ mission of promoting the free\r\ndistribution of electronic works, by using or distributing this work\r\n(or any other work associated in any way with the phrase “Project\r\nGutenberg”), you agree to comply with all the terms of the Full\r\nProject Gutenberg™ License available with this file or online at\r\nwww.gutenberg.org\/license.\r\n\r\nSection 1. General Terms of Use and Redistributing Project Gutenberg™\r\nelectronic works\r\n\r\n1.A. By reading or using any part of this Project Gutenberg™\r\nelectronic work, you indicate that you have read, understand, agree to\r\nand accept all the terms of this license and intellectual property\r\n(trademark\/copyright) agreement. If you do not agree to abide by all\r\nthe terms of this agreement, you must cease using and return or\r\ndestroy all copies of Project Gutenberg™ electronic works in your\r\npossession. If you paid a fee for obtaining a copy of or access to a\r\nProject Gutenberg™ electronic work and you do not agree to be bound\r\nby the terms of this agreement, you may obtain a refund from the person\r\nor entity to whom you paid the fee as set forth in paragraph 1.E.8.\r\n\r\n1.B. “Project Gutenberg” is a registered trademark. It may only be\r\nused on or associated in any way with an electronic work by people who\r\nagree to be bound by the terms of this agreement. There are a few\r\nthings that you can do with most Project Gutenberg™ electronic works\r\neven without complying with the full terms of this agreement. See\r\nparagraph 1.C below. There are a lot of things you can do with Project\r\nGutenberg™ electronic works if you follow the terms of this\r\nagreement and help preserve free future access to Project Gutenberg™\r\nelectronic works. See paragraph 1.E below.\r\n\r\n1.C. The Project Gutenberg Literary Archive Foundation (“the\r\nFoundation” or PGLAF), owns a compilation copyright in the collection\r\nof Project Gutenberg™ electronic works. Nearly all the individual\r\nworks in the collection are in the public domain in the United\r\nStates. If an individual work is unprotected by copyright law in the\r\nUnited States and you are located in the United States, we do not\r\nclaim a right to prevent you from copying, distributing, performing,\r\ndisplaying or creating derivative works based on the work as long as\r\nall references to Project Gutenberg are removed. Of course, we hope\r\nthat you will support the Project Gutenberg™ mission of promoting\r\nfree access to electronic works by freely sharing Project Gutenberg™\r\nworks in compliance with the terms of this agreement for keeping the\r\nProject Gutenberg™ name associated with the work. You can easily\r\ncomply with the terms of this agreement by keeping this work in the\r\nsame format with its attached full Project Gutenberg™ License when\r\nyou share it without charge with others.\r\n\r\n1.D. The copyright laws of the place where you are located also govern\r\nwhat you can do with this work. Copyright laws in most countries are\r\nin a constant state of change. If you are outside the United States,\r\ncheck the laws of your country in addition to the terms of this\r\nagreement before downloading, copying, displaying, performing,\r\ndistributing or creating derivative works based on this work or any\r\nother Project Gutenberg™ work. The Foundation makes no\r\nrepresentations concerning the copyright status of any work in any\r\ncountry other than the United States.\r\n\r\n1.E. Unless you have removed all references to Project Gutenberg:\r\n\r\n1.E.1. The following sentence, with active links to, or other\r\nimmediate access to, the full Project Gutenberg™ License must appear\r\nprominently whenever any copy of a Project Gutenberg™ work (any work\r\non which the phrase “Project Gutenberg” appears, or with which the\r\nphrase “Project Gutenberg” is associated) is accessed, displayed,\r\nperformed, viewed, copied or distributed:\r\n\r\n    This eBook is for the use of anyone anywhere in the United States and most\r\n    other parts of the world at no cost and with almost no restrictions\r\n    whatsoever. You may copy it, give it away or re-use it under the terms\r\n    of the Project Gutenberg License included with this eBook or online\r\n    at www.gutenberg.org. If you\r\n    are not located in the United States, you will have to check the laws\r\n    of the country where you are located before using this eBook.\r\n  \r\n1.E.2. If an individual Project Gutenberg™ electronic work is\r\nderived from texts not protected by U.S. copyright law (does not\r\ncontain a notice indicating that it is posted with permission of the\r\ncopyright holder), the work can be copied and distributed to anyone in\r\nthe United States without paying any fees or charges. If you are\r\nredistributing or providing access to a work with the phrase “Project\r\nGutenberg” associated with or appearing on the work, you must comply\r\neither with the requirements of paragraphs 1.E.1 through 1.E.7 or\r\nobtain permission for the use of the work and the Project Gutenberg™\r\ntrademark as set forth in paragraphs 1.E.8 or 1.E.9.\r\n\r\n1.E.3. If an individual Project Gutenberg™ electronic work is posted\r\nwith the permission of the copyright holder, your use and distribution\r\nmust comply with both paragraphs 1.E.1 through 1.E.7 and any\r\nadditional terms imposed by the copyright holder. Additional terms\r\nwill be linked to the Project Gutenberg™ License for all works\r\nposted with the permission of the copyright holder found at the\r\nbeginning of this work.\r\n\r\n1.E.4. Do not unlink or detach or remove the full Project Gutenberg™\r\nLicense terms from this work, or any files containing a part of this\r\nwork or any other work associated with Project Gutenberg™.\r\n\r\n1.E.5. Do not copy, display, perform, distribute or redistribute this\r\nelectronic work, or any part of this electronic work, without\r\nprominently displaying the sentence set forth in paragraph 1.E.1 with\r\nactive links or immediate access to the full terms of the Project\r\nGutenberg™ License.\r\n\r\n1.E.6. You may convert to and distribute this work in any binary,\r\ncompressed, marked up, nonproprietary or proprietary form, including\r\nany word processing or hypertext form. However, if you provide access\r\nto or distribute copies of a Project Gutenberg™ work in a format\r\nother than “Plain Vanilla ASCII” or other format used in the official\r\nversion posted on the official Project Gutenberg™ website\r\n(www.gutenberg.org), you must, at no additional cost, fee or expense\r\nto the user, provide a copy, a means of exporting a copy, or a means\r\nof obtaining a copy upon request, of the work in its original “Plain\r\nVanilla ASCII” or other form. Any alternate format must include the\r\nfull Project Gutenberg™ License as specified in paragraph 1.E.1.\r\n\r\n1.E.7. Do not charge a fee for access to, viewing, displaying,\r\nperforming, copying or distributing any Project Gutenberg™ works\r\nunless you comply with paragraph 1.E.8 or 1.E.9.\r\n\r\n1.E.8. You may charge a reasonable fee for copies of or providing\r\naccess to or distributing Project Gutenberg™ electronic works\r\nprovided that:\r\n\r\n    • You pay a royalty fee of 20% of the gross profits you derive from\r\n        the use of Project Gutenberg™ works calculated using the method\r\n        you already use to calculate your applicable taxes. The fee is owed\r\n        to the owner of the Project Gutenberg™ trademark, but he has\r\n        agreed to donate royalties under this paragraph to the Project\r\n        Gutenberg Literary Archive Foundation. Royalty payments must be paid\r\n        within 60 days following each date on which you prepare (or are\r\n        legally required to prepare) your periodic tax returns. Royalty\r\n        payments should be clearly marked as such and sent to the Project\r\n        Gutenberg Literary Archive Foundation at the address specified in\r\n        Section 4, “Information about donations to the Project Gutenberg\r\n        Literary Archive Foundation.”\r\n    \r\n    • You provide a full refund of any money paid by a user who notifies\r\n        you in writing (or by e-mail) within 30 days of receipt that s\/he\r\n        does not agree to the terms of the full Project Gutenberg™\r\n        License. You must require such a user to return or destroy all\r\n        copies of the works possessed in a physical medium and discontinue\r\n        all use of and all access to other copies of Project Gutenberg™\r\n        works.\r\n    \r\n    • You provide, in accordance with paragraph 1.F.3, a full refund of\r\n        any money paid for a work or a replacement copy, if a defect in the\r\n        electronic work is discovered and reported to you within 90 days of\r\n        receipt of the work.\r\n    \r\n    • You comply with all other terms of this agreement for free\r\n        distribution of Project Gutenberg™ works.\r\n    \r\n\r\n1.E.9. If you wish to charge a fee or distribute a Project\r\nGutenberg™ electronic work or group of works on different terms than\r\nare set forth in this agreement, you must obtain permission in writing\r\nfrom the Project Gutenberg Literary Archive Foundation, the manager of\r\nthe Project Gutenberg™ trademark. Contact the Foundation as set\r\nforth in Section 3 below.\r\n\r\n1.F.\r\n\r\n1.F.1. Project Gutenberg volunteers and employees expend considerable\r\neffort to identify, do copyright research on, transcribe and proofread\r\nworks not protected by U.S. copyright law in creating the Project\r\nGutenberg™ collection. Despite these efforts, Project Gutenberg™\r\nelectronic works, and the medium on which they may be stored, may\r\ncontain “Defects,” such as, but not limited to, incomplete, inaccurate\r\nor corrupt data, transcription errors, a copyright or other\r\nintellectual property infringement, a defective or damaged disk or\r\nother medium, a computer virus, or computer codes that damage or\r\ncannot be read by your equipment.\r\n\r\n1.F.2. LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the “Right\r\nof Replacement or Refund” described in paragraph 1.F.3, the Project\r\nGutenberg Literary Archive Foundation, the owner of the Project\r\nGutenberg™ trademark, and any other party distributing a Project\r\nGutenberg™ electronic work under this agreement, disclaim all\r\nliability to you for damages, costs and expenses, including legal\r\nfees. YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT\r\nLIABILITY, BREACH OF WARRANTY OR BREACH OF CONTRACT EXCEPT THOSE\r\nPROVIDED IN PARAGRAPH 1.F.3. YOU AGREE THAT THE FOUNDATION, THE\r\nTRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE\r\nLIABLE TO YOU FOR ACTUAL, DIRECT, INDIRECT, CONSEQUENTIAL, PUNITIVE OR\r\nINCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH\r\nDAMAGE.\r\n\r\n1.F.3. LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a\r\ndefect in this electronic work within 90 days of receiving it, you can\r\nreceive a refund of the money (if any) you paid for it by sending a\r\nwritten explanation to the person you received the work from. If you\r\nreceived the work on a physical medium, you must return the medium\r\nwith your written explanation. The person or entity that provided you\r\nwith the defective work may elect to provide a replacement copy in\r\nlieu of a refund. If you received the work electronically, the person\r\nor entity providing it to you may choose to give you a second\r\nopportunity to receive the work electronically in lieu of a refund. If\r\nthe second copy is also defective, you may demand a refund in writing\r\nwithout further opportunities to fix the problem.\r\n\r\n1.F.4. Except for the limited right of replacement or refund set forth\r\nin paragraph 1.F.3, this work is provided to you ‘AS-IS’, WITH NO\r\nOTHER WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\r\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PURPOSE.\r\n\r\n1.F.5. Some states do not allow disclaimers of certain implied\r\nwarranties or the exclusion or limitation of certain types of\r\ndamages. If any disclaimer or limitation set forth in this agreement\r\nviolates the law of the state applicable to this agreement, the\r\nagreement shall be interpreted to make the maximum disclaimer or\r\nlimitation permitted by the applicable state law. The invalidity or\r\nunenforceability of any provision of this agreement shall not void the\r\nremaining provisions.\r\n\r\n1.F.6. INDEMNITY - You agree to indemnify and hold the Foundation, the\r\ntrademark owner, any agent or employee of the Foundation, anyone\r\nproviding copies of Project Gutenberg™ electronic works in\r\naccordance with this agreement, and any volunteers associated with the\r\nproduction, promotion and distribution of Project Gutenberg™\r\nelectronic works, harmless from all liability, costs and expenses,\r\nincluding legal fees, that arise directly or indirectly from any of\r\nthe following which you do or cause to occur: (a) distribution of this\r\nor any Project Gutenberg™ work, (b) alteration, modification, or\r\nadditions or deletions to any Project Gutenberg™ work, and (c) any\r\nDefect you cause.\r\n\r\nSection 2. Information about the Mission of Project Gutenberg™\r\n\r\nProject Gutenberg™ is synonymous with the free distribution of\r\nelectronic works in formats readable by the widest variety of\r\ncomputers including obsolete, old, middle-aged and new computers. It\r\nexists because of the efforts of hundreds of volunteers and donations\r\nfrom people in all walks of life.\r\n\r\nVolunteers and financial support to provide volunteers with the\r\nassistance they need are critical to reaching Project Gutenberg™’s\r\ngoals and ensuring that the Project Gutenberg™ collection will\r\nremain freely available for generations to come. In 2001, the Project\r\nGutenberg Literary Archive Foundation was created to provide a secure\r\nand permanent future for Project Gutenberg™ and future\r\ngenerations. To learn more about the Project Gutenberg Literary\r\nArchive Foundation and how your efforts and donations can help, see\r\nSections 3 and 4 and the Foundation information page at www.gutenberg.org.\r\n\r\nSection 3. Information about the Project Gutenberg Literary Archive Foundation\r\n\r\nThe Project Gutenberg Literary Archive Foundation is a non-profit\r\n501(c)(3) educational corporation organized under the laws of the\r\nstate of Mississippi and granted tax exempt status by the Internal\r\nRevenue Service. The Foundation’s EIN or federal tax identification\r\nnumber is 64-6221541. Contributions to the Project Gutenberg Literary\r\nArchive Foundation are tax deductible to the full extent permitted by\r\nU.S. federal laws and your state’s laws.\r\n\r\nThe Foundation’s business office is located at 809 North 1500 West,\r\nSalt Lake City, UT 84116, (801) 596-1887. Email contact links and up\r\nto date contact information can be found at the Foundation’s website\r\nand official page at www.gutenberg.org\/contact\r\n\r\nSection 4. Information about Donations to the Project Gutenberg\r\nLiterary Archive Foundation\r\n\r\nProject Gutenberg™ depends upon and cannot survive without widespread\r\npublic support and donations to carry out its mission of\r\nincreasing the number of public domain and licensed works that can be\r\nfreely distributed in machine-readable form accessible by the widest\r\narray of equipment including outdated equipment. Many small donations\r\n($1 to $5,000) are particularly important to maintaining tax exempt\r\nstatus with the IRS.\r\n\r\nThe Foundation is committed to complying with the laws regulating\r\ncharities and charitable donations in all 50 states of the United\r\nStates. Compliance requirements are not uniform and it takes a\r\nconsiderable effort, much paperwork and many fees to meet and keep up\r\nwith these requirements. We do not solicit donations in locations\r\nwhere we have not received written confirmation of compliance. To SEND\r\nDONATIONS or determine the status of compliance for any particular state\r\nvisit www.gutenberg.org\/donate.\r\n\r\nWhile we cannot and do not solicit contributions from states where we\r\nhave not met the solicitation requirements, we know of no prohibition\r\nagainst accepting unsolicited donations from donors in such states who\r\napproach us with offers to donate.\r\n\r\nInternational donations are gratefully accepted, but we cannot make\r\nany statements concerning tax treatment of donations received from\r\noutside the United States. U.S. laws alone swamp our small staff.\r\n\r\nPlease check the Project Gutenberg web pages for current donation\r\nmethods and addresses. Donations are accepted in a number of other\r\nways including checks, online payments and credit card donations. To\r\ndonate, please visit: www.gutenberg.org\/donate.\r\n\r\nSection 5. General Information About Project Gutenberg™ electronic works\r\n\r\nProfessor Michael S. Hart was the originator of the Project\r\nGutenberg™ concept of a library of electronic works that could be\r\nfreely shared with anyone. For forty years, he produced and\r\ndistributed Project Gutenberg™ eBooks with only a loose network of\r\nvolunteer support.\r\n\r\nProject Gutenberg™ eBooks are often created from several printed\r\neditions, all of which are confirmed as not protected by copyright in\r\nthe U.S. unless a copyright notice is included. Thus, we do not\r\nnecessarily keep eBooks in compliance with any particular paper\r\nedition.\r\n\r\nMost people start at our website which has the main PG search\r\nfacility: www.gutenberg.org.\r\n\r\nThis website includes information about Project Gutenberg™,\r\nincluding how to make donations to the Project Gutenberg Literary\r\nArchive Foundation, how to help produce our new eBooks, and how to\r\nsubscribe to our email newsletter to hear about new eBooks.\r\n\r\n\r\n
"}



