{
  "title": "Highway Heart Attack",
  "textboxes": [
    {
      "id": "heart-1",
      "description": "You and Bubba are driving through a crowded highway. The traffic is at a standstill, cars honking and engines revving as drivers get increasingly impatient. Bubba has been unusually quiet for the past few hours. He keeps glancing at the rearview mirror and tapping his fingers on the steering wheel. You think nothing of it until he suddenly lets out a sharp gasp and grabs his chest.",
      "choices": [
        {
          "text": "Ask Bubba if he’s okay.",
          "next_id": "heart-2"
        },
        {
          "text": "Try to pull the car to the side of the highway and stop.",
          "next_id": "heart-3"
        },
        {
          "text": "Tell Bubba to keep driving and focus on the road.",
          "next_id": "heart-4"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-2",
      "description": "Bubba grips the steering wheel tightly, breathing heavily. His face turns pale, and sweat begins to bead on his forehead. He winces in pain. 'I don’t think I’m okay,' he says, his voice strained. He tries to push the pedal, but his hand shakes. The traffic is heavy, and there’s no place to pull over easily.",
      "choices": [
        {
          "text": "Call emergency services immediately.",
          "next_id": "heart-5"
        },
        {
          "text": "Try to drive the car to the shoulder and stop.",
          "next_id": "heart-6"
        },
        {
          "text": "Tell Bubba to breathe deeply and try to calm down.",
          "next_id": "heart-7"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-3",
      "description": "You quickly grab the wheel, trying to steer the car towards the shoulder of the road, but the traffic is too thick. The cars are packed tightly, and there’s nowhere to go. Bubba is growing weaker, his breaths shallow. His grip on the wheel falters, and the car veers slightly to the left.",
      "choices": [
        {
          "text": "Call emergency services and try to keep Bubba conscious.",
          "next_id": "heart-5"
        },
        {
          "text": "Signal the cars around you to clear the way.",
          "next_id": "heart-8"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-4",
      "description": "You try to keep Bubba focused on the road, but his condition worsens. His breath quickens, and his face twists in pain. The cars around you are starting to inch forward, but Bubba seems unable to keep up with the pace. The highway stretches ahead, but Bubba’s ability to drive is failing.",
      "choices": [
        {
          "text": "Try to pull the car over safely on the shoulder.",
          "next_id": "heart-6"
        },
        {
          "text": "Call emergency services and guide Bubba through calming breaths.",
          "next_id": "heart-7"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-5",
      "description": "You quickly dial emergency services, your heart racing. The dispatcher answers calmly, but you can hear the urgency in their voice. 'Stay with him. Help is on the way. Can you describe his symptoms?' Bubba’s breathing is getting more labored. He seems to be fading, his head tilting toward the seat. You feel the weight of the moment.",
      "choices": [
        {
          "text": "Tell Bubba to stay with you, keeping him conscious.",
          "next_id": "heart-9"
        },
        {
          "text": "Look for a nearby exit to drive to the nearest hospital.",
          "next_id": "heart-10"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-6",
      "description": "You finally manage to veer the car toward the side of the highway. Bubba is barely conscious now, his head lolling to one side. You can hear his labored breathing, and the sound of traffic continues to fill your ears, but the world feels quieter now. The highway seems endless, and the road stretches far beyond your reach.",
      "choices": [
        {
          "text": "Call emergency services while trying to keep Bubba awake.",
          "next_id": "heart-5"
        },
        {
          "text": "Attempt CPR on Bubba to keep him alive.",
          "next_id": "heart-11"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-7",
      "description": "You guide Bubba through slow, steady breaths, hoping to help him calm down. His chest still rises and falls erratically. Sweat drips down his face. The cars continue to inch along in front of you, and the road ahead feels too far to get to safety. You wonder if there’s something you can do before the worst happens.",
      "choices": [
        {
          "text": "Call emergency services again for an update.",
          "next_id": "heart-5"
        },
        {
          "text": "Look for the nearest hospital or clinic.",
          "next_id": "heart-10"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-8",
      "description": "You honk the horn, signaling to the cars around you, trying to get them to clear a path. Some of the drivers honk back in frustration, while others begin to make room. Bubba is still losing consciousness, his body slumping against the seat. The seconds feel like hours, and the air in the car grows thick with panic.",
      "choices": [
        {
          "text": "Try to get Bubba to the nearest hospital as fast as possible.",
          "next_id": "heart-10"
        },
        {
          "text": "Keep trying to keep Bubba awake and calm.",
          "next_id": "heart-9"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-9",
      "description": "You shake Bubba lightly, urging him to stay awake. His eyes flutter open for a moment, and he tries to smile weakly. 'I don’t want to go,' he murmurs. His breath continues to wheeze and rasp in the quiet of the car. You feel the weight of the moment growing heavier as his body starts to fail him.",
      "choices": [
        {
          "text": "Hold on to Bubba’s hand and reassure him that help is coming.",
          "next_id": "heart-5"
        },
        {
          "text": "Tell Bubba to rest, hoping he can get enough strength to hold on.",
          "next_id": "heart-12"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-10",
      "description": "You finally spot an exit ahead. You signal and push through the traffic, taking the turnoff and heading toward the nearest hospital. Bubba’s breathing has become shallow, but you’re determined to get him the help he needs. The hospital is still a few kilometers away, but each moment feels like an eternity.",
      "choices": [
        {
          "text": "Keep talking to Bubba, hoping to keep him conscious.",
          "next_id": "heart-12"
        },
        {
          "text": "Push harder to drive, hoping you’ll make it in time.",
          "next_id": "heart-13"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-11",
      "description": "You quickly position yourself and begin CPR on Bubba, focusing on the steady rhythm of chest compressions. The fog of panic surrounds you as you push down, feeling his chest under your hands. Each compression feels like a battle, but you keep going. You can’t let him go.",
      "choices": [
        {
          "text": "Continue CPR, hoping help will arrive soon.",
          "next_id": "heart-13"
        },
        {
          "text": "Stop and check for signs of life.",
          "next_id": "heart-14"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-12",
      "description": "You hold Bubba’s hand tightly, trying to give him something to hold on to as his breathing slows. His hand is cold, but you keep squeezing, whispering that help is on the way. His eyelids flutter one last time, and he gives you a faint smile before his body becomes limp. The world feels quieter as the weight of the situation presses in.",
      "choices": [
        {
          "text": "Continue to drive, hoping for a miracle.",
          "next_id": "heart-13"
        },
        {
          "text": "Pull over and wait for emergency help.",
          "next_id": "heart-14"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-13",
      "description": "You keep your foot heavy on the pedal, trying to make the hospital in time. Bubba’s breathing becomes even more labored, and you’re unsure if he’s still conscious. The seconds stretch into eternity as you push the car as fast as you can, praying for the best.",
      "choices": [
        {
          "text": "Focus and drive with everything you have.",
          "next_id": "heart-15"
        },
        {
          "text": "Stop to check if Bubba is still breathing.",
          "next_id": "heart-14"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-14",
      "description": "You stop the car quickly and lean over to check Bubba’s vitals. His chest is still, and you feel the coldness of his body. The weight of everything hits you hard. This could be the end for him.",
      "choices": [
        {
          "text": "Try one last attempt to resuscitate him.",
          "next_id": "heart-11"
        },
        {
          "text": "Wait for emergency services and hope for the best.",
          "next_id": "heart-16"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-15",
      "description": "You arrive at the hospital just as Bubba’s breath fades completely. The doctors rush to your car and pull Bubba out. He’s unconscious, and they work quickly to stabilize him. You’re left in the waiting room, unsure of what will happen next.",
      "choices": [
        {
          "text": "Wait anxiously for an update from the doctors.",
          "next_id": "heart-17"
        },
        {
          "text": "Go to the room where they’re working on Bubba.",
          "next_id": "heart-18"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-16",
      "description": "Emergency services arrive shortly after, but you know that Bubba’s chance of survival has passed. They do what they can, but the heart attack was too severe.",
      "choices": [
        {
          "text": "Stay with Bubba and honor his last moments.",
          "next_id": "heart-17"
        },
        {
          "text": "Leave the car and go find a quiet place to grieve.",
          "next_id": "heart-19"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-17",
      "description": "After a tense wait, a doctor comes out to speak to you. 'I’m sorry,' they say, 'We did everything we could, but we were too late. Bubba didn’t make it.' The world seems to slow down as you process the loss.",
      "choices": [
        {
          "text": "Grieve silently, unsure of what to do next.",
          "next_id": "heart-20"
        },
        {
          "text": "Go to Bubba’s side and say your final goodbyes.",
          "next_id": "heart-21"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-18",
      "description": "You burst into the emergency room, but the doctors quickly usher you out, telling you they are working on Bubba. The next few hours are a blur of tests, waiting, and worry. Eventually, they come to tell you the grim news.",
      "choices": [
        {
          "text": "Return to the camper and try to move on.",
          "next_id": "heart-19"
        },
        {
          "text": "Stay at the hospital and await the next update.",
          "next_id": "heart-20"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-19",
      "description": "The days that follow are filled with sorrow and reflection. Bubba’s absence leaves a void, but you carry his memory forward. Life on the road continues, though it feels emptier without him.",
      "choices": [
        {
          "text": "Continue your journey alone, hoping for a sense of closure.",
          "next_id": "heart-20"
        },
        {
          "text": "Find a quiet place to reflect on the life you shared with Bubba.",
          "next_id": "heart-21"
        }
      ],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-20",
      "description": "You find a quiet space to reflect, the weight of everything settling in. Bubba’s presence will always remain a part of you, but the world moves forward, and so must you.",
      "choices": [],
      "image": "",
      "sound": ""
    },
    {
      "id": "heart-21",
      "description": "You sit by Bubba’s side one last time, saying goodbye in the quiet moments before you leave the hospital. His memory will live on in your heart as you continue on your journey.",
      "choices": [],
      "image": "",
      "sound": ""
    }
  ]
}
