{
  "title": "The Missing Bus",
  "textboxes": [
    {
      "id": "missing-bus-1",
      "description": "You stand by the worn-out bus stop at the edge of town, glancing at your pocket watch. You're already late for the wizard conference. As you peer down the road, the familiar old bus rumbles past without even a honk or a wave. You swear it had someone sitting at the wheel, but it moves on like you’re invisible. The whole town feels still, except for the occasional crow’s caw and the smell of mist rising from the fields.",
      "choices": [
        {
          "text": "Walk to the town square to see if there's another bus running.",
          "next_id": "missing-bus-2"
        },
        {
          "text": "Wait for another bus and hope for the best.",
          "next_id": "missing-bus-3"
        },
        {
          "text": "Wander to the station house to inquire about the schedule.",
          "next_id": "missing-bus-4"
        }
      ]
    },
    {
      "id": "missing-bus-2",
      "description": "You make your way to the town square, where townsfolk amble about or lean against the old well. No other buses seem to be in sight, but there’s something off about the ground—curious symbols appear etched into the cobblestone. The strange markings almost seem to pulse, aligned with your heartbeat. Could they be… leyline markers?",
      "skill_check": {
        "skill": "arcanism",
        "difficulty": "medium",
        "fail": "You try to focus on the symbols, but they blur and distort, leaving you more puzzled."
      },
      "choices": [
        {
          "text": "Follow the symbols to see if they lead to the conference location.",
          "next_id": "missing-bus-5"
        },
        {
          "text": "Ask a local if they know anything about these etchings.",
          "next_id": "missing-bus-6"
        }
      ]
    },
    {
      "id": "missing-bus-3",
      "description": "You wait by the bus stop, feeling the minutes tick by like hours. Eventually, a rusty old bus appears, driven by an elderly woman with a crooked hat and a slightly dazed expression. 'Hop in if ye don’t mind a bit o’ dirt!' she cackles. You climb aboard, realizing this might not be your usual commute.",
      "choices": [
        {
          "text": "Take a seat and hope for a direct route to the conference.",
          "next_id": "missing-bus-7"
        },
        {
          "text": "Ask the driver about the delay.",
          "next_id": "missing-bus-8"
        }
      ]
    },
    {
      "id": "missing-bus-4",
      "description": "You walk to the station house, a creaky building where the town’s ancient transportation manager, Mr. Fiddlesticks, fiddles with dusty ledgers and squints at old maps. 'Leylines are all muddled these days,' he mutters as you ask about the bus schedule. He points to a faded map, lines darting every which way across the town.",
      "choices": [
        {
          "text": "Examine the map and try to understand the leylines.",
          "next_id": "missing-bus-9"
        },
        {
          "text": "Thank Mr. Fiddlesticks and head to the town square to catch a bus.",
          "next_id": "missing-bus-2"
        }
      ]
    },
    {
      "id": "missing-bus-5",
      "description": "You follow the symbols through the winding streets, finding that they lead to a small alley just off the town square. Here, an old sign points to an abandoned theater, rumored to have been built on one of the strongest leylines in the region. Could the conference be hidden inside?",
      "choices": [
        {
          "text": "Enter the theater and investigate.",
          "next_id": "missing-bus-10"
        },
        {
          "text": "Go back to the bus stop, reconsidering your options.",
          "next_id": "missing-bus-3"
        }
      ]
    },
    {
      "id": "missing-bus-6",
      "description": "A local, grizzled and toothy, looks at you with squinted eyes. 'Those etchings? They’re ley markers, alright, but only appear when something big is brewin'. Last time I saw ’em, the whole town spun sideways for a week,' he chuckles, leaving you with more questions than answers.",
      "choices": [
        {
          "text": "Head to the theater the man mentioned, intrigued by his tale.",
          "next_id": "missing-bus-10"
        },
        {
          "text": "Walk back to the station to look for another bus option.",
          "next_id": "missing-bus-4"
        }
      ]
    },
    {
      "id": "missing-bus-7",
      "description": "The bus jerks forward and rumbles down side streets, almost like it’s on a winding path of its own making. You notice the route seems to follow an unusual energy, aligning with what you now realize must be the town’s leylines.",
      "choices": [
        {
          "text": "Try casting a spell to better sense the leylines.",
          "next_id": "missing-bus-11"
        },
        {
          "text": "Wait and let the bus take you where it wills.",
          "next_id": "missing-bus-12"
        }
      ]
    },
    {
      "id": "missing-bus-8",
      "description": "The driver laughs, 'Oh, today’s the leyline day! Buses go where they go. You might end up at your conference, or in the old theater, or maybe where the leylines cross by the river.' Her chuckle isn’t exactly reassuring.",
      "choices": [
        {
          "text": "Continue the journey, trusting fate.",
          "next_id": "missing-bus-12"
        },
        {
          "text": "Ask the driver to drop you at the theater mentioned.",
          "next_id": "missing-bus-10"
        }
      ]
    },
    {
      "id": "missing-bus-9",
      "description": "Studying the map, you realize that the leylines seem to intersect at key places around town—the town square, the old theater, and a small grove near the conference location. The leyline energy could hold a secret route to the wizard meeting.",
      "choices": [
        {
          "text": "Set out for the theater to explore further.",
          "next_id": "missing-bus-10"
        },
        {
          "text": "Head to the conference by walking the leyline path.",
          "next_id": "missing-bus-13"
        }
      ]
    },
    {
      "id": "missing-bus-10",
      "description": "Inside the theater, you find a secret passage behind the stage leading to a hidden meeting room. The wizard conference attendees are deep in discussion, debating leyline disruptions. You've finally made it, and as you sit, you learn that leyline shifts have been causing disturbances in magical transport all over town.",
      "choices": [
        {
          "text": "Stay and learn more about leyline magic.",
          "next_id": "good-ending"
        },
        {
          "text": "Politely excuse yourself to make it back on time.",
          "next_id": "neutral-ending"
        }
      ]
    },
    {
      "id": "good-ending",
      "description": "You stay for the whole conference, learning how leyline disturbances affect magical transportation and discovering ways to predict these disruptions. Armed with this knowledge, you leave with newfound respect for the town's hidden magic, and you even feel your arcane skills sharpening.",
      "choices": []
    },
    {
      "id": "neutral-ending",
      "description": "Thanking the wizards, you slip out before delving too deeply into leyline theory. You make it to your next stop with little delay, though the events leave you pondering leyline magic for future study.",
      "choices": []
    },
    {
      "id": "bad-ending",
      "description": "Confused and disoriented by the leyline’s effects, you end up wandering the streets late into the night, missing the conference entirely. The town’s magic remains a mystery as the bus driver’s words haunt you.",
      "choices": []
    }
  ]
}
