{
  "title": "The Batrachvibe Bash",
  "textboxes":[
    {
      "id": "bachelorette-party-1",
      "description": "You and Bubba are at The Rainbow Lounge, a phantasmagoric mix of neon lights, twinkling fog, and bass-thumpage that rattles your gobloggin bones. Feathers and glitter flutter like sprinks in the air. The bachelorette's shrieking “Maggalo! Maggalo!” (a goblin blessing for luck) while draping herself with discarded leis. Bubba, already a few fizzle-fizz drinks in, is grinning like a korgoth. You’re buzzed, and the night crackles with feral glee.",
      "choices": [
        {
          "text": "Order a round of slapshots with Bubba",
          "next_id": "bachelorette-party-2"
        },
        {
          "text": "Let yourself be shwoomped onto the dance floor by a whooping bridesmaid",
          "next_id": "bachelorette-party-3"
        },
        {
          "text": "Nab some 'gleemwater' to clear your head",
          "next_id": "bachelorette-party-4"
        }
      ]
    },
    {
      "id": "bachelorette-party-2",
      "description": "You and Bubba clink your slapshots—icy drinks that fizzle, pop, and bite back with a faint glibber of magic. The bar erupts in yells of 'Blaggo!' and Bubba challenges you to a drumblechug. Your senses hum, and the room spirals in wild colors. But your mind feels woozy as the fizzy magic bubbles up.",
      "choices": [
        {
          "text": "Take Bubba’s drumblechug dare",
          "next_id": "bachelorette-party-5",
          "skill_check": {
            "skill": "endurance",
            "level": 25,
            "fail": "You barely hold back a grogwhomp as dizziness smacks you. The drumblechug wins, and you’re left clutching the bar to stop the world from tilting sideways."
          }
        },
        {
          "text": "Laugh it off and flail onto the dance floor instead",
          "next_id": "bachelorette-party-6"
        }
      ]
    },
    {
      "id": "bachelorette-party-3",
      "description": "A bridesmaid shwoomps you and Bubba into a dance circle where lights whirl and sway. Bubba’s dance style—half gobloggin, half spangle-dance—is infectious, and you find yourself caught up in it, a jangle of arms and elbows. But he’s a bit too jingly, bumping into guests with each swivel.",
      "choices": [
        {
          "text": "Dance harder with Bubba and throw down some waggawomp moves",
          "next_id": "bachelorette-party-7",
          "skill_check": {
            "skill": "acrobatics",
            "level": 20,
            "fail": "Bubba’s waggawomp goes haywire, and he tumbles into another dancer, knocking their drink into the air. ‘Poggle!’ you both exclaim in unison."
          }
        },
        {
          "text": "Suggest a break at the glimmer-bar",
          "next_id": "bachelorette-party-8"
        }
      ]
    },
    {
      "id": "bachelorette-party-4",
      "description": "You grab a glass of gleemwater, the slightly sparkly stuff rumored to clear heads and steady wobbly steps. Bubba joins you, dabbing glitter from his forehead with a sigh. He mutters a goblin exclamation, 'Frollow!' The water helps, but you can see he’s itching to leap back into the dance chaos.",
      "choices": [
        {
          "text": "Return to the dance floor, but ‘stay in the bubble’",
          "next_id": "bachelorette-party-9"
        },
        {
          "text": "Tell Bubba it’s maybe time to call it a wobbly night",
          "next_id": "bachelorette-party-10"
        }
      ]
    },
    {
      "id": "bachelorette-party-5",
      "description": "Fueled by gobloggin fervor, you join the drumblechug. It’s a chaotic blur of cheers, sloshing drinks, and thunderous shouts of 'Naggalo!' But the fizzy magic hits hard, and before long, you’re outside, trying to figure out where the ground went.",
      "end": "bad",
      "choices": []
    },
    {
      "id": "bachelorette-party-6",
      "description": "You and Bubba spiral onto the dance floor, letting loose with the wigglestomps and flailflops. A glittered drag queen gives you a knowing nod and joins the tangle. The night’s wild, loud, and utterly unforgettable.",
      "end": "good",
      "choices": []
    },
    {
      "id": "bachelorette-party-7",
      "description": "You both go for the full waggawomp, tossing in wild flares and twirls. Bubba accidentally plows into the bachelorette herself, sending her tiara askew. Everyone lets out a collective ‘J’boooooo!’, but the moment passes with laughter.",
      "end": "neutral",
      "choices": []
    },
    {
      "id": "bachelorette-party-8",
      "description": "You gently guide Bubba back to the glimmer-bar, where he catches his breath and wipes the last of the glitter out of his hair. Things start feeling lighter and calmer as the lights blur around you.",
      "choices": [
        {
          "text": "Make a toast and wind down the night",
          "next_id": "bachelorette-party-11"
        },
        {
          "text": "Attempt to rejoin the fray, but with care",
          "next_id": "bachelorette-party-9"
        }
      ]
    },
    {
      "id": "bachelorette-party-9",
      "description": "You and Bubba head back to the dance floor, but this time in a ‘gleemwater groove,’ keeping it slower. You flow with the beat, weaving through the dancers in surreal harmony. You’ll remember this blissful wildness for ages.",
      "end": "good",
      "choices": []
    },
    {
      "id": "bachelorette-party-10",
      "description": "A quick debate, then you and Bubba saunter out into the chilly air, arm in arm. He mutters a lazy ‘J'poogle...’ (goblin for ‘so it ends’), looking up at the stars. You both head home, feeling that special glow of just the right night.",
      "end": "neutral",
      "choices": []
    },
    {
      "id": "bachelorette-party-11",
      "description": "You and Bubba nurse your gleemwater and watch the electric madness around you. Eventually, you help your friend get safely home, the two of you laughing at all the gobbloggin nonsense on your way back to the camper. It was a night to remember, in the most wonderfully wobbly way.",
      "end": "good",
      "choices": []
    }
  ]
}
