{
  "title": "Bachelorette party",
  "textboxes":[
  {
    "id": "lsdtrip-bubba-1",
    "description": "You notice Bubba grabbing a half-empty water bottle from the camper’s counter. Before you can say anything, he takes a big gulp. Almost immediately, his eyes go wide, and he mutters, 'Whoa, Em, something’s… happening.' The walls of the camper start to shift, bending in impossible ways.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Try to calm Bubba down",
        "next_id": "lsdtrip-bubba-2"
      },
      {
        "text": "Step back and observe what’s happening",
        "next_id": "lsdtrip-bubba-3"
      }
    ]
  },
  {
    "id": "lsdtrip-bubba-2",
    "description": "You step closer and tell Bubba to focus on you. 'It's just a trip, Bubba. Breathe and hold on.' But as you speak, the air in the camper feels thick, shimmering like a heat mirage. Bubba stares at you with an awestruck expression, as if you’ve sprouted wings.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Reassure him it’s all in his head",
        "next_id": "lsdtrip-bubba-4",
        "skill_check": {
          "skill": "empathy",
          "level": 20,
          "fail": "Bubba blinks at you, but his gaze is distant, and he starts giggling, muttering something about 'flying fish.'"
        }
      },
      {
        "text": "Back away and let him ride it out",
        "next_id": "lsdtrip-bubba-5"
      }
    ]
  },
  {
    "id": "lsdtrip-bubba-3",
    "description": "As you step back, the camper around you begins to morph. Strange colors bloom from the walls, and shadows twist into creatures with wide, staring eyes. Bubba watches with amazement, laughing. 'Em, are we in a… cosmic garden?'",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Agree and play along to keep him calm",
        "next_id": "lsdtrip-bubba-6",
        "skill_check": {
          "skill": "bluffing",
          "level": 25,
          "fail": "You try to play along, but Bubba shakes his head, suspiciously muttering, 'You’re not real!'"
        }
      },
      {
        "text": "Attempt to bring him back to reality",
        "next_id": "lsdtrip-bubba-7"
      }
    ]
  },
  {
    "id": "lsdtrip-bubba-4",
    "description": "You calmly tell Bubba it’s all just in his head. He stares at you, nodding slowly, and the camper begins to settle. The walls stop twisting, and his breathing steadies.",
    "image": "",
			  "choices": [],
    "sound": "",
    "end": "good"
  },
  {
    "id": "lsdtrip-bubba-5",
    "description": "You step back, watching as Bubba’s hallucinations intensify. Suddenly, the floor seems to open up beneath him, and he gasps, gripping the camper wall as if he’s going to fall into an endless abyss.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Rush to hold his hand and steady him",
        "next_id": "lsdtrip-bubba-8"
      }
    ]
  },
  {
    "id": "lsdtrip-bubba-6",
    "description": "You smile and nod, saying, 'Yes, Bubba, we’re in the cosmic garden. Just keep breathing.' His gaze softens, and he seems to relax as the hallucination fades, leaving him calm.",
    "image": "",
    "sound": "",
				  "choices": [],
    "end": "neutral"
  },
  {
    "id": "lsdtrip-bubba-7",
    "description": "You try to bring Bubba back to reality by pointing out objects in the camper. He squints, and the hallucinations around him start to lose their grip, but he remains on edge.",
    "image": "",
    "sound": "",
    "choices": [
      {
        "text": "Assure him that he’s safe",
        "next_id": "lsdtrip-bubba-9",
        "skill_check": {
          "skill": "diplomacy",
          "level": 30,
          "fail": "Bubba’s face fills with fear, and he backs away, still convinced he’s in a strange, dangerous world."
        }
      }
    ]
  },
  {
    "id": "lsdtrip-bubba-8",
    "description": "You grab Bubba’s hand just as he’s about to lose balance. He looks at you, his eyes wide, and for a moment, he seems to see you clearly. Slowly, the floor solidifies beneath him, and he lets out a sigh of relief.",
    "image": "",
    "sound": "",
		  "choices": [],
    "end": "good"
  },
  {
    "id": "lsdtrip-bubba-9",
    "description": "You tell Bubba he’s safe, and gradually, the hallucinations dissipate. He breathes out, regaining his senses. The camper is back to normal, and he gives you a shaky smile.",
    "image": "",
    "sound": "",
		  "choices": [],
    "end": "good"
  },
  {
    "id": "lsdtrip-bubba-10",
		  "choices": [],
    "description": "Despite your best efforts, Bubba is still lost in the hallucinations. He eventually calms down, but remains deeply shaken, as if he’s glimpsed a place beyond reality.",
    "image": "",
    "sound": "",
    "end": "bad"
  }
]
}