{
  "title": "The Mirror Maze",
  "textboxes": [
    {
      "id": "mirror-1",
      "description": "You’re exploring an abandoned carnival on a misty evening when you spot a strange building labeled 'Mirror Maze.' The entrance seems inviting yet eerie, with faded lights flickering above the doorway. A sense of curiosity pushes you to enter.",
      "choices": [
        {
          "text": "Step into the maze",
          "next_id": "mirror-2"
        },
        {
          "text": "Leave and explore elsewhere",
          "next_id": "mirror-3"
        }
      ]
    },
    {
      "id": "mirror-2",
      "description": "Inside, the maze twists in all directions, with mirrors reflecting endless versions of yourself. Some reflections seem slightly off, as if they’re watching you independently. The hairs on your neck stand up. One reflection even winks at you.",
      "choices": [
        {
          "text": "Approach the mirror that winked",
          "next_id": "mirror-4"
        },
        {
          "text": "Ignore it and keep walking",
          "next_id": "mirror-5"
        },
        {
          "text": "Attempt to break the mirror",
          "next_id": "mirror-6",
          "skill_check": {
            "skill": "strength",
            "difficulty": 60
          }
        }
      ]
    },
    {
      "id": "mirror-3",
      "description": "You decide the maze is too creepy and turn to leave. However, as you walk away, you hear a faint whisper calling your name from within the maze. The carnival’s lights flicker, and a chill sweeps through the air.",
      "choices": [
        {
          "text": "Change your mind and enter the maze",
          "next_id": "mirror-2"
        },
        {
          "text": "Ignore the voice and leave",
          "next_id": "mirror-end"
        }
      ]
    },
    {
      "id": "mirror-4",
      "description": "The mirror that winked at you ripples as you approach it, like a portal. Before you can react, your reflection reaches out and pulls you into the mirror itself. Suddenly, you’re standing in a twisted mirror-world where everything is reversed.",
      "choices": [
        {
          "text": "Explore the mirror-world",
          "next_id": "mirror-7",
          "reward": {
            "id": "arcane-knowledge",
            "quantity": 5
          }
        },
        {
          "text": "Try to break out of the mirror",
          "next_id": "mirror-8",
          "skill_check": {
            "skill": "willpower",
            "difficulty": 70
          }
        }
      ]
    },
    {
      "id": "mirror-5",
      "description": "You continue walking, but each turn seems to bring you back to the same spot. The mirrors reflect endless corridors and countless versions of you. Slowly, panic begins to creep in as you realize you might be lost.",
      "choices": [
        {
          "text": "Stay calm and look for an exit",
          "next_id": "mirror-9",
          "skill_check": {
            "skill": "problem-solving",
            "difficulty": 50
          }
        },
        {
          "text": "Call out for help",
          "next_id": "mirror-10"
        }
      ]
    },
    {
      "id": "mirror-6",
      "description": "You hit the mirror with all your strength, but it doesn’t break. Instead, it absorbs your energy, leaving you feeling drained. Suddenly, one of the reflections steps out of the mirror, looking exactly like you—but colder, with a menacing smile.",
      "choices": [
        {
          "text": "Confront your reflection",
          "next_id": "mirror-11",
          "reward": {
            "id": "willpower",
            "quantity": 10
          }
        },
        {
          "text": "Run away",
          "next_id": "mirror-5"
        }
      ]
    },
    {
      "id": "mirror-7",
      "description": "The mirror-world is unsettling, filled with strange reflections of people and places you don’t recognize. At the center of the maze, you find a shimmering object on a pedestal: a crystal key. It pulses with energy.",
      "choices": [
        {
          "text": "Take the key",
          "next_id": "mirror-12",
          "reward": {
            "id": "crystal_key",
            "quantity": 1
          }
        },
        {
          "text": "Leave the key and keep exploring",
          "next_id": "mirror-13"
        }
      ]
    },
    {
      "id": "mirror-8",
      "description": "You concentrate, forcing your will against the mirror-world’s strange power. Slowly, you begin to feel a crack forming in the glass separating you from the real world.",
      "choices": [
        {
          "text": "Push harder to break through",
          "next_id": "mirror-end",
          "reward": {
            "id": "willpower",
            "quantity": 10
          }
        }
      ]
    },
    {
      "id": "mirror-9",
      "description": "You remain calm, focusing on finding a logical route. After some careful thought, you manage to navigate the maze to an exit. You see a door in the distance that might lead you out.",
      "choices": [
        {
          "text": "Head toward the exit",
          "next_id": "mirror-end"
        }
      ]
    },
    {
      "id": "mirror-10",
      "description": "Your voice echoes, but no response comes. Just when you’re about to give up, a strange, warped version of your own voice answers back, 'Why leave when you’ve only just arrived?'",
      "choices": [
        {
          "text": "Ignore it and keep moving",
          "next_id": "mirror-9"
        },
        {
          "text": "Respond to the voice",
          "next_id": "mirror-11"
        }
      ]
    },
    {
      "id": "mirror-11",
      "description": "The reflection smiles cruelly. 'I’ve been trapped here for a long time, waiting for a chance to switch places with you.' Before you can react, it lunges forward, trying to take your place in the real world.",
      "choices": [
        {
          "text": "Fight back",
          "next_id": "mirror-14",
          "skill_check": {
            "skill": "hand-to-hand",
            "difficulty": 60
          }
        },
        {
          "text": "Run",
          "next_id": "mirror-5"
        }
      ]
    },
    {
      "id": "mirror-12",
      "description": "As you grab the crystal key, the maze begins to shake, and cracks appear in the mirrors around you. You feel a rush of power surge through you.",
      "choices": [
        {
          "text": "Use the key to break free",
          "next_id": "mirror-end",
          "reward": {
            "id": "arcane-knowledge",
            "quantity": 10
          }
        }
      ]
    },
    {
      "id": "mirror-13",
      "description": "You decide to leave the key alone, and continue exploring. However, as you walk away, the mirrors begin closing in on you, trapping you with each step.",
      "choices": [
        {
          "text": "Try to break out",
          "next_id": "mirror-8"
        }
      ]
    },
    {
      "id": "mirror-14",
      "description": "You fight against your doppelganger, and after a tough struggle, manage to push it back into the mirror. With one final push, you shatter the mirror, trapping it inside forever.",
      "choices": [
        {
          "text": "Leave the maze",
          "next_id": "mirror-end",
          "reward": {
            "id": "hand-to-hand",
            "quantity": 10
          }
        }
      ]
    },
    {
      "id": "mirror-end",
      "description": "As you step outside, the night air feels crisp and real again. But then you notice something odd: your reflection in a nearby puddle doesn’t quite match your movements. You look closer and realize—the reflection trapped in the maze isn’t you... it’s a stranger with your face.",
      "choices": []
    }
  ]
}
