{
  "title": "Date with Yourself",
  "textboxes": [
    {
      "id": "date-1",
      "description": "You walk into the small café, only to stop short as you realize the person waiting for you is... yourself. Sitting across the table, an identical version of you waves and smirks. 'Hey there,' she says with a wink. 'I figured it was time we got to know each other a little better.'",
      "choices": [
        {
          "text": "Laugh and take a seat.",
          "next_id": "date-2"
        },
        {
          "text": "Ask her, 'Is this some kind of cosmic joke?'",
          "next_id": "date-3"
        }
      ]
    },
    {
      "id": "date-2",
      "description": "You sit down and your other self grins. 'So... what do you like to do in your free time?' she asks, a playful glint in her eye.",
      "choices": [
        {
          "text": "‘I dabble in magic, you?’",
          "next_id": "date-4"
        },
        {
          "text": "‘Sometimes I just like to people-watch.’",
          "next_id": "date-5"
        }
      ]
    },
    {
      "id": "date-3",
      "description": "Your other self laughs, tilting her head. 'A cosmic joke? Maybe! Or maybe it’s fate.' She sips her coffee and gestures for you to sit.",
      "choices": [
        {
          "text": "Sit down and play along.",
          "next_id": "date-2"
        }
      ]
    },
    {
      "id": "date-4",
      "description": "She laughs. 'Oh, the magic side, huh? Guess we’re both a bit mysterious.' She leans forward and lowers her voice. 'Do you think we could cast a spell together?'",
      "choices": [
        {
          "text": "Try to cast a small spell. (Requires skill check: Arcanism, 40)",
          "next_id": "date-6",
          "skill_check": {
            "skill": "arcanism",
            "value": 40,
            "fail": "The spell fizzles in an awkward silence. Your other self giggles, ‘Well, maybe next time!’"
          }
        },
        {
          "text": "Playfully suggest a different spell.",
          "next_id": "date-7"
        }
      ]
    },
    {
      "id": "date-5",
      "description": "She nods. 'People-watching is kind of like… studying ourselves, isn’t it? Funny how you notice things you never thought about.' She leans back. 'What do you think people see when they look at us?'",
      "choices": [
        {
          "text": "‘A bundle of contradictions.’",
          "next_id": "date-8"
        },
        {
          "text": "‘A mystery they’re dying to solve.’",
          "next_id": "date-9"
        }
      ]
    },
    {
      "id": "date-6",
      "description": "With a gentle flick of your fingers, you send a spark of light dancing between you both. She watches, mesmerized. 'Wow,' she breathes, 'guess we really do know each other.'",
      "choices": [
        {
          "text": "Smile and lean back, feeling the connection.",
          "next_id": "end-good"
        }
      ]
    },
    {
      "id": "date-7",
      "description": "Your other self laughs, holding up her hand to mirror yours. 'You know, maybe the best spell is just being here. Kind of magical, isn’t it?'",
      "choices": [
        {
          "text": "Agree and enjoy the moment.",
          "next_id": "end-neutral"
        }
      ]
    },
    {
      "id": "date-8",
      "description": "She nods thoughtfully. 'Yeah, I get that. We’re all these pieces thrown together… I wonder if there’s anyone who could really understand the whole picture.'",
      "choices": [
        {
          "text": "‘Maybe that’s just part of the journey.’",
          "next_id": "end-neutral"
        }
      ]
    },
    {
      "id": "date-9",
      "description": "Your other self laughs. 'Well, I can think of a few mysteries I’m still dying to solve about you.' She winks, and you both share a moment of amused, mutual curiosity.",
      "choices": [
        {
          "text": "Laugh and enjoy the connection.",
          "next_id": "end-good"
        }
      ]
    },
    {
      "id": "end-good",
      "description": "The evening ends with laughter and a strange feeling of completeness, as if meeting yourself was exactly what you needed. As you part ways, you feel like you’ve discovered something valuable—an ally in the strangest of places.",
      "choices": []
    },
    {
      "id": "end-neutral",
      "description": "The night wraps up quietly, leaving you with the warmth of a unique experience. You walk away pondering what it means to truly know oneself, feeling a strange sense of satisfaction.",
      "choices": []
    }
  ]
}
